{
    "comments": [
        "Prof. Ahlgren was so, so nice and patient. One time, I submitted the wrong homework assignment, and he let me turn it in 3 days later for full credit! He's very compassionate and kind. Amazing professor.",
        "Gem of a teacher. Lectures are extremely helpful and develop both theory and problem-solving techniques. He's always ready to help his students and goes the extra mile. Would highly recommend!",
        "Prof. Ahlgren really cares about teaching. His lectures contain his own understanding to the topic. Exams are not hard. He gives a lot of office hours, around three or four hours per week, and he is quite friendly during office hours.",
        "Ahlgren is an awesome professor. He actually made calc 2 a great way to start the day. Lectures were some derivations and tons of examples, which is exactly what you need for the class. Not to mention, he's got a great sense of humor and is pretty down-to-earth, though he is really quirky, even bordering on awkward. Good guy, great teacher.",
        "Do the extra practice problems in the book  A's on the midterms",
        "Great professor even though the course can be tough for a lot of people. It's really important to study in this class, this is a subject that can trip people up, and a lot of difficult problems can show up on exams and get you. Funny guy too",
        "He's a really really great professor! In the beginning, it was hard to keep up with what he was doing but as time went  on, I eventually got used to the fast pace of the course. Make sure you do the homework and use the office hours. And make sure you STUDY! Can't emphasize how many points I got off for silly mistakes on the exams.",
        "He is a good lecturer. He is a really fair grader and explains every topic fairly clearly. I would recommend him if you are planning to take calc 2. He is also hilarious. Would recommend him for sure.",
        "Professor Ahlgren is amazing!  He is really funny and makes math lecture an extremely pleasant place to be.  He is definitely the best choice for a Calc 2 professor.  I strongly recommend him.  He gives lots of good examples and explains everything very clearly!"
    ],
    "tags": [
        "Gives good feedback|Respected|Accessible outside class",
        "Gives good feedback|Clear grading criteria|Amazing lectures",
        "Respected|Accessible outside class|Amazing lectures",
        "Amazing lectures|Hilarious|Clear grading criteria",
        "Respected|Inspirational|Hilarious",
        "Respected|Skip class? You won't pass.|Hilarious",
        "Tough Grader|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Hilarious|Amazing lectures",
        "Inspirational|Hilarious|Amazing lectures"
    ],
    "rating": 4.89,
    "initial": "Ahlgren, S",
    "name": "Scott Ahlgren"
}