{
    "comments": [
        "Online lectures were terrible. Heavy accent, mediocre handwriting, and long undirected videos made listening to his lectures a waste of time. The only good thing is the grading of the course, which has exams fairly often and drops the worst one, with past exams posted to study from. Watch other professor's lectures to learn, like Professor Leonard.",
        "Horrible. Lecture videos are clips from multiple semesters of recording with little or no conjunction. Lecture notes are taken from the previous professor. Impossible to understand. Literarily get dizzy watching his videos as he like to scroll the page a lot. No practice exams available. Ready to learn everything yourself and pray for a good TA.",
        "Hour long videos where his handwriting is unreadable, his accent is so thick, and some of his work is cropped out so you don't understand what he's saying. The assignments don't help you learn at all. Overall horrible class.",
        "The lectures were not clear at all and the homework was too hard a lot of the time. I do not even feel like I learned a lot in this class and was very discouraged by how poorly it was taught.",
        "Horrible class. I spent way too much time just trying to find material than learning anything. Having done extremely well before in math courses, I would say this was the worst teaching I have ever had.",
        "He does not know how to give lectures nor does he know how to give help to kids. I did not like him at all and I would recommend never taking this class with this professor.",
        "I honestly felt completely and utterly failed by the UIUC math department while taking this class. This class is a robbery. Lectures are unwatchable, so bad that more than 50% of students just refuse to go and instead learn from free videos on Youtube. Homework has nothing to do with lectures or test, and is due on test days. Avoid at all costs.",
        "I swear by the Seven kingdoms that this will probably be your worst math class you will ever take in the history of humanity. And I mean it! For 13 years I aced all my math classes homework and assignments! Calc 1 and 2 were a piece of cake compared to this disaster! DO NOT TAKE THIS CLASS WITH HIM!!! Its a waste of time, money, and mental capacit",
        "Not good at \"teaching\", I've barely survived, my saving grace was youtube professors.",
        "Worst Math class I have ever taken in my life. I never hated math like this in my life. Do not take this class with him. Please! For you own sake and mental health.",
        "TAs in office hours and discussion carried the whole class, lectures were poor quality, hard to watch with really bad background noise and microphone quality. Previous math professors have been decent to very good, even with the sudden transition to online learning but He does not seem to have made a graceful transition, after several semesters.",
        "An absolutely terrible professor and a disgrace to the quality of education at UIUC. You're better off taking the proficiency exam or teaching yourself the material than sitting through the trainwrecks that are his lectures.",
        "The definition of depression",
        "I am speechless at this point, but I really do not wish for my enemies to be in my position right now! DO NOT TAKE THIS CLASS WITH HIM!!!!!!!",
        "The only thing you'll learn from his classes are how to maximize the number of times you say \"uh\" per sentence when you speak. Unbelievably, hilariously terrible and long winded explanations of otherwise simple enough topics. If I had a penny for every time I was confused by his lectures, I could finally pay my student debt.",
        "Believe me for your sake and for your health, do not take a class with him. Study, and take the proficiency test! You will regret every moment in this class. If you want to understand the material, need to do it on your own. Lectures can just make you hate math as much as possible. I might lose my scholarship because of this class!",
        "Horrible professor. He posts two 50 minute lectures for every topic that cover about half the stuff that shows up on the homeworks. Makes you participate on the forum for credit so there's about 10 redundant, unhelpful answers to each question someone . Never responds to questions or feedback, EVER. You're better off learning on YouTube or at CC.",
        "Some of the worst online teaching I've ever seen. The lectures seem like they were recorded in a lunchbreak. You better hope your TA is a good teacher because you will struggle to be taught anything.",
        "He is an absolute disaster. His lectures are not only meaningless and makes it harder to grasp the material but also he reuses it from the previous semester. Doesn't show any sign of quality or whatsoever. He is a disgrace to the rest of the mathematics faculty and to the quality of education at UIUC. Professor Leonard is the only option you have.",
        "Assigns webassigns that will be covered in the midterm the day before midterm. Lectures aren't helpful at all learned everything in the course so far from youtube. Doesn't even post practice materials on Prairielearn after the first test so you have to jump around a bunch of loosely grouped materials to find anything useful.",
        "This professor is not good what so ever... he used the same lecture videos as the semester before meaning he doesn't care to revise his work. The practice for quizzes and exams don't help much. You'll be learning from YouTube and the textbook for this class. He's a disgrace to your learning at UIUC as well as the field of teaching!",
        "Good prof. Bit of an accent",
        "Prof was very confusing in lecture videos, and sometimes we couldn't even see everything he was writing bc it would be cut off from the screen. His explanations weren't clear and I was confused the entire semester. There was a lot of hw, 5 midterms, 5 quizzes. Took a toll on my mental health this semester. :(",
        "His lectures are not helpful, you will be learning the material by yourself for the most part. He explains subjects in a way that makes them so complicated, you are better off asking TAs about the subjects or watching videos online to learn the material.",
        "His lectures leave much to be desired. Watch Leonard on YouTube instead. His strong point as a teacher is his ability to run helpful and efficient office hours; he seems to know what you're asking before you even ask it. Homework is sometimes detached from what appears on exams so do them with answers available. His exams are fair and doable.",
        "Dude has no idea how to teach, the homework has nothing to do with the tests or quizzes.",
        "Feel like the lectures are barely comprehensible and helpful, and the questions from the homework and worksheets are as slippery as worms since the examples he gives in the lectures are very basic. Terrible experience with this guy and this class compared to calc 1 and 2 which I both got A+ in.",
        "I took this class during covid. The lecture is 100% useless. Cannot understand anything he was saying. He never explained well on any topics. I gave up watching the lecture after a couple of weeks. Completely self-taught by reading the textbook. 86% of the grade is based on exams, which is annoying. Honestly, how did this guy become a professor????",
        "The lectures were 2x longer than they had to be and meandered all over the place. He would often scroll up 2-3 pages in the notes to change a variable name then return to the bottom and begin a whole new topic. There were plenty of huge gaps in his sentences and incomplete thoughts. I had to teach myself lots of the material.",
        "Barely comprehensible, talks slowly with long pauses.",
        "Cant understand his accent and he fails to explain literally anything in the lectures. I want a teacher, not a recitation of the wiki page.",
        "Prof. Ifti will work with you and try his best to explain the concepts to us. He will ask test questions that are directly based on lecture, so it's recommended that you go. The tests aren't that hard, but studying for it will help you a lot in the long run (for the final exam).",
        "He is hard to understand and overcomplicates simple things. It is truly amazing that I passed this class. I finished with a 44% and luckily everyone else did so bad that my final grade got curved to a 61% and barely passed. Steer clear of this class and TAKE AT COMMUNITY COLLEGE IF POSSIBLE",
        "A great professor overall. Tests compose a huge portion of the course grade but the midterms were pretty straight forward. The final exam was a bit difficult but the class was curved.",
        "His lectures dont relate to what is going to be on the homework or quizzes. The material is easy but he spends an hour explaining something my TA would sufficiently spend 5 minutes going over while relating it to our work. You cant study from the book or past work for the exams because theyre completely off topic.",
        "The worst class at the university. I used to love math and wanted to major in math before taking this exam. No longer do I want to major in math. The worst professor. Doesn't teach at all and the lectures are useless. I went to every lecture and TA discussion section. Still have a terrible grade in the class. Exam averages were awful.",
        "Im an A student. This class dropped my GPA from 3.75 to 3.2 singlehandedly. Practice exams and tutoring doesnt help. Homework doesnt match what is being taught. Exams are majority of the full grade and there are no curves. Exam problems are more challenging than they need to be. Please save yourself and avoid if possible.",
        "Homework has nothing to do with the test, practice exams are useless since theyre nothing like the actual test, and the exams have to curve.",
        "I studied over 20 hours for the third midterm and got under a 20%, the average was a failing grade and he still won't curve it. No idea how this happens, tough class but it shouldn't be THIS tough. He needs to teach more, the lectures are useless.",
        "I am currently enrolled in this class, and I highly highly recommend to not take this course. The course is mainly graded off of the midterms and final which take up 75% of the weight. To keep that in perspective, the avgerae grade for our third midterm was 52%. How do you succeed in a class when the average is a 52% on a test worth 15% of theclass",
        "This is a self taught class. If you NEED to take this class, the best advice is to take it at community college where you will learn it the right way. You will not succeed in this class here.",
        "Lecture attendance wasn't required, but it was useless anyway because it is impossible to learn anything with this professor. Exams were brutal, and the final and 3 midterms equal 75% of the course grade. Homework was useless, and the 3rd midterm had a failing average, that says a lot. Avoid this professor at all costs.",
        "it is a very hard class to pass because it is a very hard class to learn it. You will learn nothing at the lectures, or the ta sessions because you don't comprehend the material in lecture to talk about in the TA sessions. The last midterm average was a 54% which is horrible, and he refused to grade it. Lecture attendance is down to 50 from 300.",
        "Is horrible at explaining during lecture. basically pointless to go because you will end up spending hours doing the homework and re-teaching yourself anyways. midterm practices are a joke, midterm 3 average score was a 55% if that says anything. Discussions are nice but the TA I had didnt do anything but pass out homework and answer questions",
        "While the class overall seems to be manageable, if you do bad on the exams there is no hope for getting a good grade in that class. There are absolutely no curves, and it is really annoying. Exam 3 was unnecessarily difficult,and we were not given enough time to answer all of the questions. The class average ended up being a 52%. BUT STILL NO CURVE",
        "Ifti is a professor who unnecessarily does more work than necessary to finish the math problems. He has some issues controlling the class and the lecture and discussions do not match up. I am so sorry if you have to take MATH 234, however it is an easy class. He is also confusing to understand.",
        "We had a small scale class- about 20 students, so he really got to know us personally. When other 231 TAs graded by accuracy on discussion questions, he just graded by effort and attendence. He is good at explaining things in lectures at least for me. To sum up, kind. I would recommend you take his class."
    ],
    "tags": [
        "Clear grading criteria",
        "Lots of homework|Lecture heavy|Tough grader",
        "Graded by few things|Test heavy|Lecture heavy",
        "Test heavy",
        "Lots of homework|Graded by few things|Lecture heavy",
        "Lots of homework|Test heavy|Lecture heavy",
        "Graded by few things|Test heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Lots of homework|Skip class? You won't pass.|Graded by few things",
        "Graded by few things|Test heavy|Lecture heavy",
        "Graded by few things|Test heavy",
        "Graded by few things|Test heavy",
        "Lots of homework|Graded by few things|Tough grader",
        "Lots of homework",
        "Lots of homework|Skip class? You won't pass.|Graded by few things",
        "Test heavy",
        "Graded by few things",
        "Graded by few things|Test heavy",
        "Lots of homework",
        "Graded by few things|Test heavy|Tough grader",
        "Lots of homework|Get ready to read|Test heavy",
        "Lots of homework",
        "Skip class? You won't pass.|Test heavy",
        "Lots of homework|Get ready to read|Test heavy",
        "Skip class? You won't pass.|Test heavy",
        "Lots of homework|Graded by few things|Test heavy",
        "Test heavy",
        "Get ready to read|Graded by few things|Lecture heavy",
        "Lots of homework|Graded by few things|Lecture heavy",
        "Test heavy|Lots of homework",
        "Accessible outside class|Clear grading criteria|Lecture heavy",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Accessible outside class|Test heavy",
        "Graded by few things|Test heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Get ready to read|Test heavy|Tough grader",
        "Lots of homework|Lecture heavy|Tough grader",
        "Lots of homework|Test heavy|Clear grading criteria",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Get ready to read|Graded by few things|Test heavy",
        "Lots of homework|Test heavy",
        "Lots of homework|Test heavy|Tough grader",
        "Lots of homework|Test heavy|Tough grader",
        "Test heavy|Tough grader",
        "LOTS OF HOMEWORK|GRADED BY FEW THINGS|LECTURE HEAVY",
        "Gives good feedback|Respected|ACCESSIBLE OUTSIDE CLASS"
    ],
    "rating": 1.38,
    "initial": "Ahmed, I",
    "name": "Iftikhar Ahmed"
}