{
    "comments": [
        "The policy for exams was switched twice because the professor tried to back on his word and many people complained. Watching his lectures are COMPLETELY useless in terms of solving actual problems and he jokes around alot. Be ready to do a lot of googling/looking elsewhere. Homework will cover cases not taught whatsoever anywhere and u need to find",
        "Laughable professor, meaning he cracks jokes and laughs at his own jokes during lecture. Exams are like 5 questions and if you miss one it's -15% on the exam. prelecture format online is terrible, and oftentimes problems are vague.",
        "Great professor. I think as a lecturer, he is adequate, but the real reason I think his classes are great is that he genuinely cares about the learning experience. How he formats his class is interactive and really makes you learn the material. He is also not afraid to change things around and takes feedback seriously",
        "Willing to discuss class structure outside of class, accessible. Group project - start early (not hard, but very stressful if delayed)! Class is easy. Textbook is rarely required. Homework wasn't too long / difficult. Covers 3 different types of databases types. Strongly recommend any CS student to take as the material of the class is important.",
        "Quite honestly the most effective course I've taken at the U of I, thanks to Prof. Abdu. Not only is he hilarious, but his lectures are extremely clear and he's very approachable before and after class. The lectures are faster-paced, so you may benefit from reading the textbook beforehand. Not mandatory, though. AND he memorized our names! WHAAT",
        "He is very responsible and kind. Always willing to help. The lectures are interesting and helpful and I truly recommend this class!",
        "Excellent prof!!!",
        "Professor Abdu very well knowledgeable in his field and is also very approachable. He takes immense feedback from his students and changes the course to make sure that all of the concerns people have are taken care of. Take his class if you decently challenging class with a great professor, take his class.",
        "I have both been a student and a TA for this class. When I took this course as a student, I felt the course was challenging. When I worked as a TA for this course, I got to know how much effort the instructors have put into this course(Yes, we put A LOT OF time into this course). Abdu is a passionate, hard-working, and caring professor.",
        "Gives off good vibes. Very nice guy too and he teaches the class pretty well.",
        "Amazing professor. One of the first professors that I've had that actually attempts to connect with his class in ways that aren't just related to the material. I would highly recommend anyone take a class with him if they have the chance! Abdu has clear lesson plans, clear grading criteria, and makes sure to adjust deadlines if needed",
        "Abdu is nothing but helpful. I would give nothing but respect for this man. His teaching style reminds me every day of what it means to be an engineer. His work ethic, his character, his respect for truly teaching students-all of it creates an atmosphere of constant inspiration. Especially with the times of this semester, Abdu carried me threw it.",
        "Honestly Abdu is the ultimate homie. He is funny, smart, and actually wants his students to succeed. HW is fair and greatly prepares you for the exams. Also the final project really can be awesome if you want it to be. I've seen few other professors take feedback as seriously as Abdu. He wants his class to be top tier, and frankly, it is.",
        "To put it shortly, Abdu is an amazing professor who makes the learning environment feel fresh with his character. He gives a lot of opportunities to help you understand the material better and provides extra credit to help students out. Homework may seem heavy but is easily doable with the appropriate time and effort.",
        "Best course taken so far as CS Graduate student at UIUC. If I happen to become a professor, I'd like to be as empathetic and approachable as he is. He LISTENS to students, and is always happy to help! He is the best professor. Period.",
        "A professor who really cares students, making you feel so worthy devoting your time to the class, having jokes and activities in class which help you focus, one of the best teachers I've ever had.",
        "Feel the Prof really cares about students and helpful. The exam was okay, similar to the examples and homework. But the group project is heavy.",
        "Well Organized class. Great Professor, very clear. The only complaint is that this class further facilitates the scam that is the IClicker. Shame on you UIUC",
        "Fantastic professor. Honestly one of my favorite teachers I've had during college. Really listens to feedback and seems to care about his students and the class",
        "Honestly as a person who wishes to teach one day, Abdu is a role model for me. He is the perfect example of how a professor truly cares about his students. The course so far is great! It covers almost all the essentials you need to learn about database systems.",
        "Great professor who genuinely cares about student feedback and is very approachable outside of class.",
        "Cares about feedback from students and a great and compassionate professor. Definitely very approachable.",
        "Abdu is so cute and passionate. Jokes aside, definitely approachable after class if you need help, he listens to feedback and really wants his students to get their money's worth.",
        "Abdu is a great professor. You can tell that he cares a lot about the subject and his students. It's a huge class and he does his best to make everyone feel welcome. Some other students seem to dislike his humor and the way he makes class interactive, but honestly I think its refreshing to have a CS professor who cares as much as he does.",
        "This is the first course i've taken in CS department, this is a very good fundamental course even though it's in 4 level. He cares about students, tried very hard to answer every single question, even made a video after class when he finds out most of us cannot figure out some concepts in class. Highly recommend! Best professor I've ever met.",
        "Best professor in UIUC. He answers more than 70% questions on piazza, and he really takes efforts. Homework is not easy, but not taking much time. Project has few restrictions, good chance to open your mind. Review sessions (most from TA) are also helpful, which save your time on homework and exam. Class is interesting and clear. Again, best prof.",
        "Abdu is the man! I've never seen a professor care so much for student's success. I definitely recommend taking him for 411 as he is very knowledge and makes the course very relevant by teaching us NoSQL as well.",
        "Best cs prof I ever met in UIUC.",
        "Professor Alawini truly cares about his students. This may seem cliche but he will actually listen to his students and actively make the class better as the semester progresses so his students get the most out of the class.",
        "Prof Abdu cares about his students! Really great experience taking the course with him! Even though the exams and home works were tough, prof Abdu is one of the best professors I've ever had.",
        "Professor Abdu is a great instructor who cares about his students and enjoys teaching. He is open to honest and critical feedback, continuously trying to improve his classroom experience. He likes his students to engage during lectures, often through Q&As. He tends to be quite active on Piazza, answering student queries. You won't be disappointed!",
        "Great professor that listen to student's feedback",
        "My first rating on this website. Prof. Abdu is a fantastic teacher and a really nice person. Exams and homeworks were hard, but I did learn a lot. I would encourage you to go to his lecture. Hes very passionate in his lecture and he can remember your name if you ask/answer a bunch of good questions."
    ],
    "tags": [
        "Participation matters",
        "Participation matters|Graded by few things|Hilarious",
        "Respected|Group projects",
        "Accessible outside class|Group projects|Caring",
        "Accessible outside class|Clear grading criteria|Caring",
        "Gives good feedback|Respected|Group projects",
        "Gives good feedback",
        "Respected|Amazing lectures|Caring",
        "Gives good feedback|Lots of homework",
        "Accessible outside class|Hilarious|Caring",
        "Respected|Clear grading criteria|Lecture heavy",
        "Gives good feedback|Accessible outside class|Caring",
        "Clear grading criteria|Hilarious|Caring",
        "Inspirational|Clear grading criteria|EXTRA CREDIT",
        "Inspirational|Amazing lectures|Caring",
        "Group projects|Amazing lectures|Caring",
        "Accessible outside class|Group projects|Hilarious",
        "Respected|Lots of homework|Participation matters",
        "Group projects|Hilarious|Amazing lectures",
        "Lots of homework|Caring|EXTRA CREDIT",
        "Gives good feedback|Respected|Accessible outside class",
        "Gives good feedback|Accessible outside class|Group projects",
        "Inspirational|Group projects|Caring",
        "Group projects|Hilarious|Caring",
        "Respected|Inspirational|Hilarious",
        "Gives good feedback|Respected|ACCESSIBLE OUTSIDE CLASS",
        "Inspirational|Caring|GROUP PROJECTS",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Gives good feedback|Participation matters|Caring",
        "Caring|EXTRA CREDIT|GROUP PROJECTS",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Caring",
        "Clear grading criteria|Amazing lectures|GROUP PROJECTS",
        "Respected|Amazing lectures|Caring"
    ],
    "rating": 4.76,
    "initial": "Alawini, A",
    "name": "Abdussalam Alawini"
}