{
    "comments": [
        "Professor Altaner is very organized and has the entire week planned out on Moodle, so it is easy to get ahead! The course was a lot of work, simply because it was only 8 weeks. Overall, it was easy and manageable.",
        "GEOL 118 was the best class I've taken on campus. Altaner is the coolest guy and gives a ton of extra credit opportunities. The exams aren't hard if you go to the review sessions because he goes over a lot of test questions and do the practice quizzes. If I could take this class every semester...I would",
        "Profesor Altaner was a great teacher. I always looked forward to hearing his jokes at the beginning of the class. He brings props in to class to further explain things and he makes a lot of jokes throughout class. Very interesting class.",
        "Professor Altaner is a great professor! He makes all of his classes fun, yet challenging. Definitely recommend.",
        "The class was out of 1000 points and there were 100 extra credit points offered. Professor tells great dad jokes and shows lots of far side cartoons in class. Lots of lectures but is worth going to, the class is pretty easy there are only three tests.",
        "The professor is really great.",
        "He is one of the best professors I've ever had! Every class starts with a dad joke and he offers tons of extra credit so its so easy to get an A. If you study your notes and take the practice tests you can easily do well on the exams and we never used the textbook. Overall, he's just a great person and teacher.",
        "Stephen Altaner is the man. No questions asked. He also loves dolomite",
        "Prof. Altaner is everything you want in a Professor. He recognizes that many of students are taking his class just for hours, and caters to them well. Also if you like Dad Jokes, you'll like him. His tests need to be studied for, and he has an ok amount of homework, but I got an A in the class and I went to every lecture I liked it so much",
        "Honestly there was no reason for me to take this class, but I am so glad I did. Stephen shows cartoons at the beginning of each lecture, and they are actually pretty entertaining, as corny as they seem. The class is pretty lax and interesting, and all the opportunities for extra credit make it an easy A. He's a BOSS"
    ],
    "tags": [
        "Lots of homework|Hilarious|EXTRA CREDIT",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Hilarious|Caring|Tough grader",
        "Hilarious|EXTRA CREDIT|LECTURE HEAVY",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Inspirational",
        "Respected|Hilarious",
        "Respected|Participation matters|Hilarious"
    ],
    "rating": 5.0,
    "initial": "Altaner, S",
    "name": "Stephen Altaner"
}