{
    "comments": [
        "Has a very strange teaching style. I find that he often makes things seem very easy in class but the tests have much harder problems than the ones he does. I also think he can be very rude to students at times. He seems unhappy to be a calculus 3 professor because he thinks much more of himself.",
        "Dr. Anema is a very strange but very effective teacher. From what I've heard, Anema's lectures best relate to the actual test material than the other calc 3 professors. He's also very charismatic and entertaining in lecture. I'd come to class just to see his outfit.",
        "Great professor, widely respected among the student and faculty populations. I find that most of his examples, however, are direct from the textbook examples, which means you aren't getting new material if you read the book. He's a pinch dry in tone but besides that he is amazing!",
        "Great lecturer; makes hard material understandable and makes an otherwise tough class understandable.",
        "Decent professor, but sometimes hard to understand. Doesn't do nearly enough examples.",
        "Took 241 once before and had trouble with everything, took it again with Professor Anema and he was so clear and simple, and would readily do any example problem during lecture if you just asked. His tests while challenging were not impossible if you studied, attended lectures and discussions, and TA hours for the Web Assigns. One of the best!",
        "He isn't funny or anything, but he is happy and wants to genuinely teach you. He is the best of the Math 241 professors my year and explains well. He sometimes gets mad if you don't do what he wants during lecture so always pick that you want to see a difficult example.",
        "Dr. Anema is an awesome guy who explains difficult concepts very well. Students from other sections will ditch theirs to hear his lectures because of how clear he is. Available after class for further clarifications.",
        "He does teach the content well, but sometimes goes about it in a round-about way that confuses me. He is also very pretentious and has this snicker that is very irritating. Professor Anema is also not very engaging and he does not even have his own office hours. I would not take his class again for sure.",
        "Best math lecturer I've had. Easiest to understand and a pleasure to attend his class, even if it's a 9am.",
        "Must attend lectures to understand concepts and get an A in the class. I skipped a couple of lectures to catch up on sleep, and my grades plummeted. The curve is generally around 90% and up receive A's.",
        "Anema was an amazing professor when it comes to explaining complex problems in Math 221. If taking Calculus is your first Calc class it may seem a bit challenging but he is very nice and is approachable right after the lecture to answer. His tests has big part of multiple choice where he loves to test students's abilities of theorems and subtleties",
        "MATH 221 can be challenging  if it's your first calculus course, but Anema is among the best lecturers available. He moves at a reasonable pace, which can't always be said about the other professors in the department. You'll need to go to your discussion sections every week and keep up with the WebAssign homework assignments if you wish to pass.",
        "Anema is an amazing lecturer, but kind of crazy when it comes to exams. (full disclosure: this was a newly \"restructured\" class) We had no past exams, the midterms and final were VERY difficult, and they were some of the longest exams I've ever seen. It was a struggle to finish them in the time much less do very well. Thank goodness for the curve.",
        "His lectures are very organized, interesting and straightforward. Great teacher, really enjoyed his lectures. Would definitely recommend taking classes with him!",
        "Professor Anema is an amazing teacher, class was a lot of work, make sure you do the webassign, midterms are hard but curved. Great person to talk to, wears the same thing everyday!",
        "Superb and chill dude. Great lectures and explanations. Even gives a list of important questions before exams and finals. 10/10 would recommend.",
        "Professor Anema is genuinely a great guy, and gives really great, thorough lectures. His tests are quite hard though, as they are somewhat long, difficult, and the grading (done by TAs) can be harsh. I would not only rely on notes, but also on the textbook, as it's a great resource.",
        "I thought he wasn't very good at explaining, in the sense that he can not catch the students' attention. Math was always my favourite subject but his classes made me fall asleep. Wish he made it more interesting and spoke in a more attention-grabbing way.",
        "I had him for Calculus I, and he is honestly a really amazing professor. Attending lectures is very useful and essential for getting a good grade in his class. However, he very clear in his instruction and really helps you understand the material. He is also a humorous person and fun to listen to in lecture."
    ],
    "tags": [
        "Skip class? You won't pass.|GRADED BY FEW THINGS",
        "Respected|LOTS OF HOMEWORK|Amazing lectures",
        "Gives good feedback|Respected|TEST HEAVY",
        "Respected|Amazing lectures|Tests are tough",
        "Skip class? You won't pass.|TEST HEAVY",
        "Skip class? You won't pass.|Amazing lectures|Would take again",
        "Amazing lectures",
        "Tough Grader|LOTS OF HOMEWORK|Amazing lectures",
        "Tough Grader|Respected|Clear grading criteria",
        "Tough Grader|Skip class? You won't pass.|LECTURE HEAVY",
        "Tough Grader|Skip class? You won't pass.|Amazing lectures",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Respected",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader|Skip class? You won't pass.|TEST HEAVY",
        "Respected|Inspirational|Amazing lectures",
        "Respected|Amazing lectures|Caring",
        "Respected|Amazing lectures|LECTURE HEAVY",
        "Tough Grader|Respected|Hilarious",
        "TEST HEAVY|LECTURE HEAVY",
        "Hilarious|Amazing lectures"
    ],
    "rating": 4.1,
    "initial": "Anema, J",
    "name": "Jason Anema"
}