{
    "comments": [
        "I would've given him a worse rating, but at least he was cool enough to meet with me over zoom and gives generous curves that I would've got a C in the course if it wasn't for that. However, his teaching abilities are beyond horrific as his lecture videos on Moodle is just him reading the slides word for word with no outside explanation of his own.",
        "He seems like a nice guy but his online lectures are him reading word for word from a useless PowerPoint already provided to you. The TAs in the optional discussion section also doesn't provide much explanation if any about the topic. Be prepared to teach yourself everything you know in this class. It could be better in person since we are in COVID",
        "Really have nothing good to say. He made us buy a course packet which would typically provide extra help, but his lecture videos are just him reading from the packet word-for-word with no kind of elaboration whatsoever. Every HW assignment is 5% of the final grade which is ridiculous. I've had him twice and hated my experience both times",
        "Pretty bad overall",
        "Professor Ramses is really nice. I took his Econ203 last summer. His lecture video is clear, solid, and very useful.",
        "Absolutely garbage as a professor. Never met anyone worse than this abomination that is the professor of econ 203. He basically reads off a garbage slide show that he sells to you as \"madatory\" text that happens to be useless. Never replies to the emails. Get ready to YouTube all content because a chimp can teach better than this guy.",
        "Get ready to teach yourself. Our lectures consist of him reading off the textbook.",
        "I knew the exact same amount about econ and stats at the beginning as I did at the end of the semester. This professor just reads his lectures straight from the slides and does not elaborate on a single thing. He does not teach, he simply expects you to learn on your own and he tells you when exams are. Miss two on the exam and you get a B on it.",
        "He is so disgusting. Final exam with 8 questions belong to a chapter never explained. No curve. No round grade. No response on piazza. Just read ppt in lecture videos. It is just impossible to learn anything or achieve A with him being instructor.",
        "Where do I even start? The class was poorly managed and the structure made absolutely zero sense. He made us use an online homework tool that half the time had wrong answers and he used it to study for exams, but again didn't have the correct answers and didn't give help. I'll cut him some slack cause it's his first year and COVID but AVOID HIM.",
        "Unprepared and boring lectures. Don't go to them. The homework assigned for each week was hard and lectures were not helping at all. The midterms were alright as long as you do the practice questions. The content of the class is interesting but he is an awful lecturer. Take this class with another prof if you don't wanna lose interest in econ.",
        "I had professor Ramses for two upper-division economics courses. While I can't comment on his teaching of lower-level courses, I really enjoyed being his student during my last year of university. He's a great lecturer; he makes the material very easy to understand. Additionally, he is very lenient with grading and will accommodate if you ask.",
        "Although his lectures can be dry and the class is hard, the one thing I can say about this professor is that he listens to his students. If you go and talk to him individually about concerns, you will find that he cares about your well-being and he will help you. If you read the textbook and do the practice problems for exams, you will do well.",
        "your grade is just 3 tests, and then 30% homework. Make sure not to mess up. Also ta's were not the nicest.",
        "The lectures are uninteresting (even for economics) and you are graded heavily on tests and some homework.",
        "This class was kind of a disaster. I know it was his first semester here but the TAs seemed to know more about the material than the prof. Lectures are useless. It's a \"flipped classroom\" but the only materials you are given are the lecture slides which makes the graded prelectures very hard. The final project was too much work & peer-graded. avoid",
        "The professor was clearly passionate about his work and the class, but the lecture-lab format of the course was not very effective. The homework also seemed like busy work without actually teaching the material. The most useful aspect of the course were the practice exams included in the workbook and the modeling project.",
        "The course is so unorganized and the structure makes no sense. Professor just re-explains what we have already taught ourselves from the course packet. Not to mention the course packet is unthorough and barely helps with homework. It's sad that ECON 202 and 203 are both poorly run courses, avoid them if you can."
    ],
    "tags": [
        "Graded by few things|Lecture heavy",
        "Graded by few things|Test heavy",
        "Lots of homework|Test heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Gives good feedback|Respected|Caring",
        "Get ready to read|Graded by few things",
        "Graded by few things|Clear grading criteria",
        "Graded by few things|Test heavy|Tough grader",
        "Tough grader",
        "Lots of homework|Graded by few things|Test heavy",
        "Lots of homework|Graded by few things|Test heavy",
        "Graded by few things|Amazing lectures|Caring",
        "Lots of homework|Graded by few things|Caring",
        "Graded by few things|Test heavy",
        "Test heavy|Graded by few things|Tough grader",
        "Lots of homework",
        "Lecture heavy",
        "Lots of homework"
    ],
    "rating": 1.78,
    "initial": "Armendariz, R",
    "name": "Ramses Armendariz"
}