{
    "comments": [
        "Very clear lecture notes. Great insights and fascinating equation derivations, but you need to follow along very closely to absorb everything.",
        "We are graded off of two midterms, a final exam, and problem sets, which count for homework. The problem sets are quite easy, he posts videos to show you exactly how to do them. The exams aren't bad, similar to the problem sets. If you ask the right questions and come to lecture, you'll be fine.",
        "Good professor!",
        "Could honestly be the worst professor I've had on campus. Lectures are hard to understand and he will often go a random tangent that is hard to follow. Lectures are different than notes and test questions are pulled from things he mentions in lectures. Content is not hard but he does a very poor job of explaining things.",
        "Econometrics was a tough class, especially over the summer. Professor Arvin-Rad explains everything really thoroughly, which helped a lot. He is committed to making sure students understand the material, and he answers questions in detail. He also curves and he'll bump up your grade if you're on the cusp and you attend lecture.",
        "This class was not easy, but the material was interesting and the professor was very knowledgable on the subject matter. I specifically liked the applications of the course and using/learning R. I do wish there was more homework to get more opportunities to practice. Going to class was also a must to stay caught up.",
        "So many good topics to get into. Housing, discrimination, maternal leave, company compensation, school lunch effectiveness. One thing I would recommend is to know R beforehand. I didn't work hard in this class and would deeply regret it.",
        "Read the lecture notes after class. Very comprehensive introduction to data. He also gives us lots of data sets for us to play with. Very accessible outside of class. Everything is online, including books. Class uses R studio",
        "undergrad level econometrics is just basic: basic linear algebra+basic stats+some theorems. should be a no brainer for most econ students. those who cant even follow Arvin-rad's lectures should consider switching to a \"more arts\" major. PS(homework) could be lengthy, but was graded on completion rather than correctness. Overall a very doable course",
        "Seems like a nice guy, but he is just an awful teacher. I can't understand half of what he says, he constantly loses his train of thought and he writes so fast that I can't keep up. I don't think he has clearly explained a single concept in the course so far, he just writes out derivations for 80 minutes. He makes the class 10x harder",
        "He is a little hard to understand, but overall great professor. Curves the midterms to an 81, and then curves the class to a median of 81. Attendance is optional, but he does still take attendance which I imagine he uses to bump your grade if youre on the border. The material is straight forward, and he does plenty of examples during class.",
        "He is the worst professor I ever met. Only curve 3% for a midterm. His lecture is boring. He also has a terrible accent. I suggest Econ department hire a person who can talk in English.",
        "Yeah be is a little boring and he has accent. But who cares? He is a great professor that teaches you everything you need in HW and Exams. I mean, how rare is that? All you have to do is pay a little attention and you get an A.",
        "Arvid-Rad is definitely someone who loves to teach and it shows. However, while he clearly cares about his students, his lectures are incredibly dull and often repetitive. Homework grading is lax but exam grading is nit-picky. If you depend upon instructor accessibility, hes an awesome choice. Otherwise, hes solidly average.",
        "The worst professor of at UIUC. NEVER take his class. Boring and cannot even understand what his saying. And of course Exams are extremely hard.",
        "Extremely nice and knowledgeable professor.",
        "The hardest course I have ever took, be aware to choose class from him",
        "As a maths major, I think his ECON471 is very clear and easy but I've also heard negative feedbacks from my classmates. So if you are really willing to study hard and you have a background in statistics/econometrics/mathematics, you should get an easy A from this class. He's also very nice and patient.",
        "Lecture are sometime long but you'll learn a lot in his class. Only a few homework assignments and tests that you'll be prepared for if you go to lecture everyday.",
        "Probably one harder classes I've taken in general, and it didn't have to do with the material. Prof Arvin-Rad is a nice enough person, but he's a bad teacher; the practice exams he posts are much easier and nothing like the exam it's preparing you for, lectures are dry and boring, and he doesn't exactly go out of his way to make himself available.",
        "One of the worst lecturers I've had at university. Will spend inordinate amounts of time on inconsequential lecture topics. Also, difficult to follow, because he often rambles and loses his train of thought. If someone else is teaching econometrics, I suggest you take him or her instead."
    ],
    "tags": [
        "Respected|Accessible outside class|Clear grading criteria",
        "Gives good feedback|Lecture heavy|Caring",
        "Gives good feedback|Respected|Clear grading criteria",
        "Test heavy|Lecture heavy",
        "Get ready to read|Participation matters|Skip class? You won't pass.",
        "Skip class? You won't pass.|Graded by few things|Lecture heavy",
        "Inspirational|Amazing lectures|Caring",
        "Accessible outside class|Lecture heavy|Caring",
        "Accessible outside class|Test heavy",
        "Lecture heavy|Tough grader",
        "Accessible outside class|Clear grading criteria|Lecture heavy",
        "Lots of homework|Test heavy|Tough grader",
        "Gives good feedback|Participation matters|ACCESSIBLE OUTSIDE CLASS",
        "ACCESSIBLE OUTSIDE CLASS|Caring|LECTURE HEAVY",
        "Tough Grader|TEST HEAVY|Tests are tough",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Tough Grader",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Tough Grader",
        "Tough Grader|Skip class? You won't pass.",
        "Get ready to read"
    ],
    "rating": 3.48,
    "initial": "Arvin-Rad, H",
    "name": "Hassan Arvin-Rad"
}