{
    "comments": [
        "All her lectures are asynchronous, and there's a lot of lecture videos. Even if you watch the lectures, it's still not enough to do well on the exams. I got an A in CHEM 104 and did all the lectures and practice problems, so I followed the same method with this class, still did not work. She used to have the exam open note, but not this sem.",
        "I really love Jordan, though the class is extremely hard and you have to really make sure you pay attention. Go to as many office hours as possible, and make sure to keep up with the lectures.",
        "Wonderful Professor. If you do all the materials shes given to you and take time to understand them, you will get an A, no questions asked. She cared about your success and gives you the tools to be successful. You just gotta use em!",
        "Orgo is a tough class but she did a great job teaching it which often led to longer videos, however, concepts were explained very clearly with plenty of examples. She is pretty strict with grading and doesn't make a lot of exceptions for individual students but does offer a lot of drops (including a midterm) which generally makes up for it.",
        "As another review mentioned: hard class but if you have any emergency your screwed. Covid was an emergency and she really made the bare minimum accommodations. Says a lot about her as a person. Exams were brutal do all the practice exams and ws and still not ace it. :)",
        "Last semester I was going through a lot with COVID, and I emailed asking for help. She gave no leeway. She gave 2 times the amount of online work than it would be if it was in person. She thinks she already made enough accommodations, but she was my least sympathetic teacher and didn't care about her students.",
        "Axelson really cares about how well students do in her class. She's likely only professor I will ever see write out a unit summary to help guide studying for the test. She makes plenty of past exams available and they all follow the same format. You have to really know your stuff but taking good notes on lectures and practicing is your best bet.",
        "Not an empathetic professor. Incapable of understanding and listening to her students. Was unable to adjust to teaching to the pandemic, and was not lenient at all. Do not recommend.",
        "Axelson has the most detailed lectures possible. They might be lengthy but most of it is her re-emphasizing the concepts. She explains the concept well and clear. The rest is all based on the work of the students.",
        "I really wanted to like Jordan Axelson's class this term. She seems like a nice person and knows her stuff but that's about all the positives I can say. There was 2x as much lecture material as there would have been in-person and she penalized the whole class when a few people cheated by making exams closed-note.",
        "Wants students to fail. The lectures are way longer than what is allowed. She doesn't care about the students. Orgo Chem 232 is obviously a hard class, but she makes it harder than it needs to be. Good luck if you have her, you'll need it.",
        "Dr. Axelson really makes Organic Chemistry easier to tackle. She provides all of the information that is needed to do well, but it is up to the students to practice outside of class. Organic Chemistry is very difficult, but it is up to the student to practice daily.",
        "Keep up with her calendar. Pace is fast, but if you keep up you won't get bogged down fast, and preparing for tests gets easier. Also she has a lot of exams. This fall she had 5 total, including final. You get to drop one and replace it with the highest score. Overall a great and understanding professor. She usually extends deadlines too.",
        "Its orgo. Youll have to work for the grade. Axelson just makes it better :)",
        "Axelson thought now that classes were online, students somehow magically had more than 24 hours in their days. So in order to compensate for a seemingly longer day, Axelson decided her allotted 50 minutes of lecture time wasn't enough. Instead, it would be a good idea to make lectures that are 70 and 80 minutes in length. Horrible all around.",
        "It was absolutely incredible to see a professor so blatantly unempathetic, and ignorant towards the most basic of issues that arise with switching to online class. She is a perfect example of a professor who lacks perspective on what it is to be a student during the covid pandemic. Wholeheartedly she is a disgrace to what it means to be a professor",
        "Her lectures are actually really useful if you pay attention to her. Review lecture notes before taking the exam and actually do all the practice worksheets. It is a hard class but if you put the work in you can definitely get good grades in her class.",
        "Axelson is decent. Her lectures are rushed, however if you record them and go over them later, they turn out to be pretty useful. The exams are extremely difficult, although somewhat similar to the practice exams she gives. IMO, the class got easier after going online since tests were open note. But overall, considering Orgo is hard, she's good.",
        "Horrible teacher. She expects everyone to be smart like her because she was able to pass orgo. Doesnt give credit like she says for regrades so dont bother. Didnt curve this semester but has curved every other semester. Was not sensitive to the fact that we went online. Class just got harder.",
        "If you put in the effort and attend office hours, the class isn't that bad. Make sure you keep up with the coursework and try to go to the exam review sessions. There are extra credit opportunities and you can drop an exam, but there isn't really a curve.",
        "I took orgo the second time around with Axelson and I went from getting a D- to an A-. She's amazing, and one of the most approachable professors I've ever had. She's an excellent lecturer, and makes difficult concepts understandable. She provides great notes and really useful resources like the practice worksheets. Take orgo with her!!!",
        "Axelson is a pretty good lecturer. The class is test heavy, but they give you plenty of resources to study with like practice questions and old exams. There are also plenty of office hours available between Axelson, Grad TAs and Undergrad TAs which I recommend going to at least before exams. Also there's a pretty thicc curve at the end.",
        "yeah, unless you're good at chem or really enjoy it, or unless you're a pre-med, then just take this class in the summer at a community college or online at a different school. you're basically screwed if you miss lectures and even then she goes through a lot of material really fast. Oregon state offers Orgo online with great reviews fyi.",
        "One of my favorite teachers at uiuc. This is a very hard class, I'm talking spending 8-12 hours a week outside of class on it. all of the grading is very fair, and you exactly what is expected of you on exams. if you use Chegg for the online homework youll get 100% then you only have to worry about the exams. there is a big curve at the end.",
        "Axelson is an amazing professor. I initially thought the course was difficult but really came to enjoy the material. Most people who thought the class was hard did not put in the work needed to do well in the course. Its really dependent on the amount of work you put into the course.",
        "Lectures are awful. She absolutely steamrolls through some of the most difficult material students at this point have ever seen, and will often flat out refuse to clarify things. Avoid taking this lecture anytime in the morning unless you wake up at 6am every day for a caffeine IV.",
        "Dr. Alexson is amazing. Her lectures are engaging and helpful. There are tons of office hours, practice worksheets, and practice exams. She really cares about her students and tries all she can to help everyone succeed. My best advice is to put in the work by going to office hours and staying up to date with the worksheets.",
        "Dr. Axelson is the best professor I've ever had. She made this class very enjoyable, the lectures are heavy so make sure to stay on top of the material. She also gives you one test drop out of 4 which is convenient since I was sick and didn't go to the last exam. I enjoyed this class so much I plan to take orgo 2 in the fall.",
        "Dr Axelson is an amazing professor! For Orgo 1 she makes it very clear what will appear on her exams, what to study, and gives optional practice worksheets, which I recommend doing to get an A. Provides all the study material needed to get an A. Recommend going to the DAILY office hours staffed by herself and TAs. Generous curve in the course.",
        "It's organic chemistry, it's going to be a monster, but she really does give you everything you need to succeed in her class. Super accessible. SUPER TEST HEAVY. If you are rusty in chem, go talk to her and she will recommend where to start from. DO NOT Fall Behind. BEWARE Exams are 45 min! AND don't be afraid to ask questions, she is nice, so ask",
        "Dr Axelson is such an excellent professor! Going to her office hours helped a lot. Ill be happy to take another chem class with her!",
        "An awesome teacher and a great class. Dr. Axelson provides all the resources you need to understand the material being taught, but you have to put in the effort and time if you want to succeed. Don't let the stigma of organic chemistry being a hard class affect you. Just apply yourself.",
        "It's organic chemistry. It's going to be hard. The lectures can be a lot to digest, so be ready to review your lecture notes every day. She's very approachable during office hours and wants you to succeed. Keep up with the content, and you should be fine",
        "She made lecture interactive and interesting however, she always seemed to rush to get all of the material for lecture done on time. Tests were fair and as long as you studied the videos, it was very much doable especially since her lectures just reinforced what the videos taught. In her office hours, she seemed to care about her students learning.",
        "Well in a word she's way too smart and expects other people to be very smart too.  You need to print out all the slides and fill them out with details in lecture. Attendance isn't mandatory but you're basically screwed if you don't show up to class.:) Very hard class and she said the average is gonna be curved to a C+ or B-. Be ready to put in 5/5",
        "Worst class I have ever taken. Period."
    ],
    "tags": [
        "Lots of homework|Test heavy|Lecture heavy",
        "Gives good feedback|Test heavy|Lecture heavy",
        "Lots of homework|Skip class? You won't pass.|Caring",
        "Skip class? You won't pass.|Lecture heavy|Caring",
        "Test heavy|Tough grader",
        "Tough grader",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Test heavy|Tough grader",
        "Respected|Test heavy|Amazing lectures",
        "Lots of homework|Lecture heavy",
        "Lots of homework|Lecture heavy|Tough grader",
        "Respected|Skip class? You won't pass.|EXTRA CREDIT",
        "Accessible outside class|Skip class? You won't pass.|Lecture heavy",
        "Gives good feedback|Accessible outside class|Caring",
        "Skip class? You won't pass.|Lecture heavy|Tough grader",
        "Test heavy",
        "Respected|Lecture heavy|Caring",
        "Gives good feedback|Accessible outside class|EXTRA CREDIT",
        "Skip class? You won't pass.|Test heavy|Lecture heavy",
        "Accessible outside class|Skip class? You won't pass.|Lecture heavy",
        "Skip class? You won't pass.|Test heavy|Lecture heavy",
        "Accessible outside class|Test heavy|Lecture heavy",
        "Skip class? You won't pass.|Test heavy|Lecture heavy",
        "Respected|Clear grading criteria|Lecture heavy",
        "Accessible outside class|Test heavy|Lecture heavy",
        "Lots of homework|Test heavy",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|TEST HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|LECTURE HEAVY",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|LECTURE HEAVY",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|TEST HEAVY",
        "Amazing lectures|Caring|Would take again",
        "ACCESSIBLE OUTSIDE CLASS|TEST HEAVY|Caring",
        "Skip class? You won't pass.|Caring",
        "Inspirational|TEST HEAVY|Caring",
        "Tough Grader|Skip class? You won't pass.|TEST HEAVY",
        "LOTS OF HOMEWORK"
    ],
    "rating": 3.58,
    "initial": "Axelson, J",
    "name": "Jordan Axelson"
}