{
    "comments": [
        "Really hated this class! So boring!",
        "I'm using so many things I learned in the course in my internship. HW and study guides were good practice for his quizzes, but they were hard.",
        "Probably one of the coolest and friendliest professors I've had at uiuc. Always available after/outside of class to answer questions, and a very lenient and generous grader. stat 385 was a very straightforward class, if you did the work you would definitely pass with at least a B. He is passionate about the material and a great teacher.",
        "It is not an easy class if you are looking for one, but definitely really helpful. I don't know why James is getting such low scores but he really was helpful and nice. The stuff he taught in class should be mastered if you ever want to an accomplished statistician.",
        "This class is so messy and incredibly boring class.",
        "Ridiculously difficult class with clueless prof. Nice sandals though :D",
        "I took this class last year and I'm working in industry now. I wanted to come back and say how much I've referenced his course notes at my job - he works hard to build his lectures around what he think students will need to learn for the workforce, and I think he was very successful in doing that.",
        "Balamuta is the most passionate person about R that I've ever met. He was easily approachable and willingly answered questions outside of class.",
        "Ridiculously knowledgeable and enthusiastic about R. Helped me land an internship over the summer.",
        "This class is not organized at all, nothing is clear and he is really bad at teaching. This class also has unrealistically long homework, which are extremely boring and useless. Avoid this class!",
        "I know a lot of people did not James as a teacher. However, he has lots of R experience. I also had to take my final 2 months late because of a family emergency. He was very accommodating and even got me coffee for the exam. We had a nice talk afterwards about grad school and my future. He is an amazing teacher who is always there for his students.",
        "Best lecturer ever. I learned so much in this class from Github to real world industrially applicable R skillz. You keep doing you James.",
        "Talks about random stuff all the time. Not organized at all. Really starting to hate R!"
    ],
    "tags": [
        "Lecture heavy|Tough grader",
        "Test heavy|Group projects",
        "Accessible outside class|Inspirational|Clear grading criteria",
        "Lots of homework|Group projects|EXTRA CREDIT",
        "Test heavy|Lecture heavy|Tough grader",
        "Lecture heavy|Tough grader",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Hilarious|GROUP PROJECTS",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Tough Grader",
        "Skip class? You won't pass.|Caring|GROUP PROJECTS",
        "LOTS OF HOMEWORK|Inspirational|Clear grading criteria",
        "Tough Grader"
    ],
    "rating": 3.38,
    "initial": "Balamuta, J",
    "name": "James Balamuta"
}