{
    "comments": [
        "One of the best zoom classes I have taken! Excellent lectures and caring, famous professor!",
        "Enjoyable class and excellent professor.",
        "I have to say, this was one of my best classes. Research on intelligence is very interesting and the topics in the class apply to lots of fields and to lots of current topics in the media.",
        "Highly recommended and worked well online. Just make sure you are willing to attend lectures and write a 10-page term paper.",
        "Enjoyable class and I found it fairly easy (as long as you go to class and work on the term paper)!",
        "This class was hard (need to write a 10 page paper) but rewarding. The lectures are very good and the class content is interesting.",
        "Awesome class. Really. The guy is impressive. I thought I would hate it but he convinced me..... and this doesn't happen often. A class I will remember.",
        "Important class. Highly recommended for psychology majors.",
        "Awesome class. Barbey is excellent. Worked with the Director of National Intelligence and received the premier award in intelligence research from Mensa (after Google DeepMind). Take it if you can!",
        "Great class! Nice professor who is a real expert on the topic! Famous prof at Illinois and yet friendly and accessible.",
        "Intelligence and the brain. This guy is the expert. I liked him and the course. Definitely a good one!",
        "Famous professor, expert on intelligence. Definitely recommend it!",
        "I loved this class!",
        "The biology of intelligence is interesting. So I would take this class. The professor is good too!",
        "I liked this class! Approachable and actually interesting class discussion.",
        "The class is essentially very good lectures and a term paper. The term paper is 10 pages so only take this class if you are okay with that. I really enjoyed it!",
        "I liked this one and would suggest taking classes from this prof. smart, clear, and very interesting!",
        "One of the most enjoyable psychology classes I have taken! The term paper is a literature review and this can be on a topic of your choice. So it is not a mindless class with multiple choice exams! Highly recommended.",
        "This class is really good. Best one I have had so far. Dr. Barbey is an great. An expert in his field and very approachable. Highly recommended class.",
        "The class discussion is really good, spontaneous but organized and interesting. He goes beyond the readings and it is definitely a good, worthwhile class.",
        "Fun class and interesting lectures and course material.",
        "Great class lectures and discussion, especially for people interested in psychology, neuroscience, and computer science!",
        "Enjoyed this class a lot. The material and course discussion are great!",
        "He doesn't care for the class at all. The paper & project are doable w/o his help, yes, but he is impossible to reach outside of class (via email, which he tells us to use), he comes late to class and is the first to leave. Also no online gradebook, so had no clue how I was doing all semester. Very unclear syllabus as well. Don't take if you can.",
        "one of the best I've had so far at UIUC!",
        "I am grateful that he accepted my paper even when it was late!",
        "Take it if you can!",
        "Seriously, one of the best....",
        "Awesome class!",
        "Excellent professor!",
        "Excellent class!",
        "I am really curious about how he is going to grade each student. From my observation, he does not read our class tickets and he only takes a look at our term paper ...",
        "I don't know how to evaluate this professor... I am working on his final paper but I have no clues. I don't think he really cares about this class and really respects us students. There are plenty of great psych lectures at U of I, Barbey is definitely not your best option.",
        "The entire class is a discussion of the readings, 1/2 of which are his lesion research. 1 presentation, 1 10-page essay, >20 1-page hw assignments. Don't worry about the presentation - he will talk over you. He's inaccessible outside of class and doesn't answer emails. The class isn't online at all, so you won't know your grade until the very end.",
        "enjoyable class and excellent lectures!"
    ],
    "tags": [
        "Respected|Amazing lectures",
        "Respected|Inspirational",
        "Respected|Amazing lectures",
        "Respected|Amazing lectures",
        "Respected|Inspirational",
        "Respected",
        "Inspirational",
        "Respected",
        "Respected|Inspirational",
        "Respected|Inspirational",
        "Respected|Inspirational",
        "Respected|Amazing lectures",
        "Respected|Amazing lectures",
        "Inspirational",
        "Respected|Inspirational",
        "Respected|Amazing lectures",
        "Respected|Inspirational",
        "Respected|Amazing lectures",
        "Inspirational",
        "Participation matters|Inspirational",
        "Respected|Participation matters",
        "Participation matters|Inspirational",
        "Respected|Caring",
        "Lecture heavy|So many papers|Tough grader",
        "Respected",
        "Respected|Inspirational|Caring",
        "Inspirational",
        "Inspirational",
        "Gives good feedback|Respected|Inspirational",
        "Gives good feedback|Respected",
        "Gives good feedback|Respected|Participation matters",
        "Get ready to read|Participation matters|Skip class? You won't pass.",
        "Lecture heavy|Tough grader",
        "Lots of homework|Get ready to read|Participation matters",
        "Tough Grader|Participation matters|Amazing lectures"
    ],
    "rating": 4.49,
    "initial": "Barbey, A",
    "name": "Aron Barbey"
}