{
    "comments": [
        "Iryce really is a queen. She knows her stuff and is so passionate about english and has a passion for helping her students. All we do is read the texts and discuss them and that's about it. There are of course some papers but she's really helpful and offers great feedback. She's so funny and half the time we just talk about current events. 11/10.",
        "Iryce is one of the best professors on campus. She's extremely kind and intelligent and I learned a great amount in this class. You can tell that she cares about every student academically and personally. Words cannot explain how wonderful she is. If you love women's lit, heavy discussion, and a prof that cares, this is the class for you.",
        "Best English professor at this school. Take at least one of her classes while you're here, it's definitely an experience. She provides a lot of insight on texts you wouldn't think of! She cares so much for each of her students in and out of the classroom. The work load is pretty easy, 4 papers in total, each about 3-4 pages, and attendance.",
        "Hands down the best professor at the U of I. Genuinely loves her students and her subject and always is excited to hear from her students. Very kind, understanding, hilarious, and smart. Gives outstanding feedback on assignments. 100% would take this class again!",
        "I LOVE HER. I seriously cannot understand anyone who said even one bad thing, she's such a genuinely sweet person, cares about every student, and is sooo understanding. I took HP with her and learned so much and actually enjoy lessons. 3 essays, 1 presentation. Easy A on the essays if you take the time to formulate good ideas. TAKE HER !!",
        "Iryce is an amazing professor. Every class is a large discussion about the novels we've been reading. She is very passionate about the novels, and brings up such interesting points. She manages to connect all the novels to each other (especially to HP) and asks thought-provoking questions every day. Each student does a presentation on a topic.",
        "Iryce is an awesome teacher! She teaches a Harry Potter class and it is the most fun thing. We all just geek about HP and she leads discussions with extremely thought provoking questions. I really enjoyed her teaching style and how she relates to students. Definitely would take her again!",
        "Iryce was a great professor! She genuinely wanted all of her students to do well and understand the material. At first, I had trouble with the paper rubrics, but after attending her office hours, I started getting high grades on the papers. The discussion is always SUPER interesting! Also, we read five to six books for the course but it's worth it!",
        "Iryce is one of my favorite professors. She genuinely cares about her students and is the most understanding professor I ever had here. She is so funny and smart. Iryce engages students in interesting and relevant discussions. Her class is very comfortable and enjoyable. Take her any chance you get!"
    ],
    "tags": [
        "Gives good feedback|Hilarious|Amazing lectures",
        "Gives good feedback|Get ready to read|Inspirational",
        "Inspirational",
        "Gives good feedback|Inspirational|Caring",
        "Hilarious|Amazing lectures|Caring",
        "Respected|Participation matters|Hilarious",
        "Gives good feedback|Hilarious|Caring",
        "Get ready to read|SO MANY PAPERS|Caring",
        "Gives good feedback|Respected|Hilarious"
    ],
    "rating": 5.0,
    "initial": "Baron, I",
    "name": "Iryce Baron"
}