{
    "comments": [
        "Easy to communicate with but a lot of independent readings.",
        "My least favorite teacher ever. I think she comes off as very pretentious and puts unnecessary emphasis on words to make it seem as if she is saying something so profound when she is just reading what someone has written. Would never take a course taught by her again.",
        "Great professor! Incredibly intelligent without coming off as pretentious. If you're already a strong writer, the class will come as no challenge. If you're not quite as strong of a writer yet, expect to work and be willing to consider her feedback-- she gives very thoughtful feedback on papers and writing responses.",
        "As others have said, Manisha is a FANTASTIC professor and a brilliant person, but she is quite difficult. Grading is particular and makes a 200lvl feel at times like a more advanced class. However, her feedback is helpful and the particular nature of her grading WILL sharpen your writing skills. VERY worth it for the \"bootcamp\" quality.",
        "Manisha is one of the smartest professors I have ever had. She taught me so much. She can be a tough grader, but her feedback makes you a better writer and critical thinker. Her lectures always flew by and were of top notch quality. Our selected readings were interesting and fun, too - we used Sherlock Holmes and Dracula to discuss English theory.",
        "This class ruined my GPA. She's a brilliant lecturer, but there always seems to be a specific answer she's looking for. Every assignment is graded like a final and I don't think anyone in my class has ever gotten higher than a flat A on any assignment. I got an A or A- on everything and still got a B in the class."
    ],
    "tags": [
        "Get ready to read|Skip class? You won't pass.",
        "Participation matters",
        "Clear grading criteria",
        "Tough Grader|Respected|Participation matters",
        "Gives good feedback|Respected|Amazing lectures",
        "Tough Grader|Get ready to read|Participation matters"
    ],
    "rating": 3.33,
    "initial": "Basu, M",
    "name": "Manisha Basu"
}