{
    "comments": [
        "Professor Bohn is a good teacher and really cares about the material she's presenting. Definitely go to class because the notes are fill in the blank. There is a ton of extra credit options throughout the semester and the workload is a few big projects, weekly quizzes and assignments, and one final.",
        "Stopped going to class after the first few lectures after realizing everything you need is on Compass. Super easy A as long as you remember the deadlines. Just get everything done as soon as she opens it up and you'll be fine. There's only one exam at the end which is all online and open note and 2 sensory activities that require minimal effort.",
        "An amazing professor for FSHN 101. Nicest woman and really cares. If you put in a little energy into the class then you will be just fine as a 90% is a solid A.",
        "This class is a pretty easy A. Final is open note and open book so you dont even have to study. She posts her lecture slides online, but theyre usually missing some important notes that you have to go to lecture to get. Lectures arent mandatory, but if you dont go youre gonna have a bad time.",
        "She's easy when it comes to the homework and quizzes that are assigned, even on the few projects that are assigned she is lenient on grading. My biggest problem with her is the final, i went from a strong A to a B because the material was so unfamiliar.",
        "She rushes through a lot of the material, which sucks when there's math and chemistry involved. There's no textbook so if you miss the notes in class, you're basically screwed."
    ],
    "tags": [
        "Lots of homework|Skip class? You won't pass.|EXTRA CREDIT",
        "Graded by few things|Clear grading criteria|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Skip class? You won't pass.",
        "Skip class? You won't pass.|GRADED BY FEW THINGS|LECTURE HEAVY",
        "Skip class? You won't pass.|GRADED BY FEW THINGS|LECTURE HEAVY"
    ],
    "rating": 4.0,
    "initial": "Bohn, D",
    "name": "Dawn Bohn"
}