{
    "comments": [
        "Bronski is an amazing professor who truly wants you to learn the material. If you see him as an option for your math class, definitely choose him.",
        "The best professor that I have any seen. Organization at its finest, explains key concepts very easily, and gives feedback very fast.",
        "Fun and responsible professor. He has great lecture notes and decent videos. He holds accessible office hours multiple times every week. However, as many online classes tend to be, you need more motivation than in person, as the only synchronous component is the required discussion sessions.",
        "MATH 231 is a hard class, no matter who you take. That being said, I've never had a more attentive, knowledgeable, and caring instructor. Professor Bronski's lectures are excellent, the practice tests are great, and he tries to make it fun, adding little jokes in to make sure we don't go crazy. Bronski a real one, one of the best math profs at UIUC",
        "Great teacher, 10/10 recommend. Always available outside of class and constantly emails for questions to go over for help.",
        "Great asynchronous lectures and the office hours 2x a week are very helpful. You don't need the textbook because he writes you note sheets for each week and they're fantastic. Haven't received a grade yet because I have my final soon but it'll probably be decent. Prof. Bronski is really good and I would recommend him.",
        "Professor Bronski is easily one of the best professors I have had. As a freshman in Aerospace Engineering, I knew that Calc 2 was one of the harder courses but Prof Bronski makes a true effort to make sure everyone knows the material for the midterms. There are tons of opportunities to attend his office hours to succeed in the course.",
        "Professor Bronski is one of the best professors at UIUC. He knows his material in and out - and then some. Office hours with him are the best, he starts with random youtube videos and he gave all of his students free hot chocolate on the last day. He genuinely wants his students to succeed. I'd take another Math class just to be taught by him.",
        "Best math teacher Ive ever had. Im a freshman in aerospace. MATH 231 was a hard class but he made difficult material easier and fun to learn. He had tons of opportunities for your questions to get answered through office hours and campus wire. I had his class during COVID and he was still very accessible online.",
        "I Love Bronski.",
        "My calc 2 professor was the TA to Bronski, and I absolutely loved her. I knew Bronski was going to be a real gem. I heard so many good things about him and he did not disappoint one bit. Amazing professor, HILARIOUS, and very accessible. He delivers the material in such a well, concise manner. I would take him again in a heartbeat.",
        "This was my second course with him, and it was just as good as the first. He is very active in communicating with students via piazza, and he is very easily reached. He explains the material in a great way that is fairly easy to comprehend. I have friends that take other professors and I always make sure to rub it in that I am taking a great one!",
        "There are not a lot of professors I have taken that make me want to go to class, but he is one of them. He is a very funny character, but this does not take away from the fact that he knows his stuff. He is a very, very good teacher. I would take him again in a heartbeat, and I recommend everyone to take him if you can.",
        "Calc II is gonna be a bunch of work, but Bronski usually does a pretty good job of explaining concepts. Make sure you pay attention and don't get behind, it can go pretty quick.",
        "Great professor. He makes lectures interesting and usually starts class with a random calc related video that's hilarious. There's a lot of homework but its not hard at all and the midterms are pretty easy as well. The puzzlers are a great way to earn extra credit",
        "Wonderful professor it's so lucky to have this professor in my first college year!!!",
        "Great professor!! I took both his lectures and other prof's when he was away. His were the best. He is super clear and funny. (still remembers his joke about that thing at standford) I love diff eqs!",
        "Bronski was hilarious but dont let the tests make you think this class is easy. Final is brutal but he does curve if his averages are too low. Great professor all in all!",
        "Great professor! Very smart and funny, which makes you look forward to going to lecture. The class was very easy overall, and I felt like it didn't go much in depth, but if you wanna understand concepts with a greater depth you have to do it on your own.",
        "Hes absolutely hilarious, but more importantly, hes an amazing professor. He takes time to answer questions during lecture, through email, and on piazza. Made calculus bearable."
    ],
    "tags": [
        "Gives good feedback|Accessible outside class|Lecture heavy",
        "Gives good feedback|Respected|Inspirational",
        "Accessible outside class|Clear grading criteria|Hilarious",
        "Accessible outside class|Skip class? You won't pass.|Amazing lectures",
        "Respected|Accessible outside class|Amazing lectures",
        "Accessible outside class|Test heavy|Caring",
        "Respected|Hilarious|Amazing lectures",
        "Respected|Inspirational|Hilarious",
        "Gives good feedback|Respected|Accessible outside class",
        "Gives good feedback|Respected|Accessible outside class",
        "Respected|Accessible outside class|Hilarious",
        "Accessible outside class|Hilarious|Caring",
        "Gives good feedback|Hilarious|Caring",
        "Lots of homework",
        "Respected|LOTS OF HOMEWORK|Hilarious",
        "Caring|EXTRA CREDIT",
        "Respected|Inspirational|Amazing lectures",
        "Amazing lectures|Hilarious|Clear grading criteria",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|Hilarious",
        "LOTS OF HOMEWORK|Hilarious|Amazing lectures"
    ],
    "rating": 4.9,
    "initial": "Bronski, J",
    "name": "Jared Bronski"
}