{
    "comments": [
        "Dr. Brown explains difficult concepts in a way that makes sense. If you don't understand a concept, he takes the time to attempt to explain in a way that makes sense to you. Even throughout the pandemic, Dr. Brown remained one of, if not the best, science teachers I've ever had. Gives you all the tools you need to succeed. Always fair and kind.",
        "Dr. Brown is the most underrated professor on this campus. He genuinely cares for his students and is an amazing lecturer when you listen to him. Other students need to give him the same grace he has given us since the pandemic. This class is not an easy A, but I think that's to be expected. I enjoyed all of the content and his style of teaching.",
        "the amount of work for the class was insane. he ended up giving a generous curve at the end of the semester but Ive never stressed so much about a class before. Practicals were very tricky.",
        "A lot of students didnt like him because they thought he was really harsh with exams and threw a lot at us. However, I believe these students didnt understand that this was an anatomy course! Sometimes is a slow grader and not tech savvy but very sweet and tries! I think people didnt get the amount of work you need to put in to do well. Study!!",
        "Chester is a nightmare of a professor. Incoherent exams and lectures that leave you more confused waling out than when you walked in. He couldn't care less about his students and chooses to not reply to emails that might seem inconvenient. He refuses to put grades into the grade book until last minute. Stay away from his class at all costs.",
        "His slides can be unclear and I found it more helpful to read the textbook instead of trying to figure out what he meant. There were always some mistakes here and there in the slides making this whole class more confusing. He loves to play video clips that are somewhat \"relevant\" to the class which could be bad or good depending on your preference."
    ],
    "tags": [
        "Accessible outside class|Amazing lectures|Caring",
        "Amazing lectures|Lecture heavy|Caring",
        "Lots of homework|Skip class? You won't pass.|Tough grader",
        "Respected|Test heavy|Lecture heavy",
        "Get ready to read|Skip class? You won't pass.|Test heavy",
        "TEST HEAVY|GRADED BY FEW THINGS|LECTURE HEAVY"
    ],
    "rating": 3.17,
    "initial": "Brown, C",
    "name": "Chester Brown"
}