{
    "comments": [
        "Coming into this class I was scared of Dr. Brunner after reading some of these other reviews but he's honestly one of the nicest people I've had as a professor here. If you take the time to put effort into the class and learn, you'll be rewarded. Cool guy.",
        "The most horrible I have ever seen. Tons of homework and harsh grading, plus this professor's bad attitude. NEVER EVER CHOOSE HIM.",
        "Professor Brunner is very knowledgable about data science. If you are relatively new to python, you will learn a lot from this class. The people complaining about the high grade cutoffs have to understand that without them, everyone would get an A in the class.",
        "Don't pick him he is awful. He doesn't do anything and the cutoff is so high. I hate this professor so much.",
        "I am taking INFO 490 (Advanced Data Science) I don't understand the professor logic in grading. The cutoff for an A is 96% and we have 20 minutes to complete the quiz and 15 questions to answer 1.33 min to answer each question. I don't understand why the cutoff is so high. What's the logic behind making it impossible to get an A. I may drop",
        "Well organized class and a great class for python beginners. HOWEVER! The grading scale needs your extra attention. 96 for an A and 93 for a B: if you miss a single assignment, you will lower your grade by a whole level. Take the class with great caution ( don't miss any homework or quizzes), and it will be a good experience for you.",
        "after several weeks, I checked his grading scale to find out that 94.99 or something close to that was just a B+. Who gives 94.99 a B+? Then I decided to drop the course. Oh, and besides he is really demeaning to students. I have any seen a professor who answers \"If you don't like it drop the course.\" But I still think it's very useful course tho."
    ],
    "tags": [
        "Gives good feedback|Get ready to read|Caring",
        "Tough Grader|LOTS OF HOMEWORK",
        "Respected|Inspirational|ACCESSIBLE OUTSIDE CLASS",
        "Tough Grader|Get ready to read|LOTS OF HOMEWORK",
        "Tough Grader|Get ready to read|Skip class? You won't pass.",
        "Tough Grader",
        "Tough Grader"
    ],
    "rating": 2.29,
    "initial": "Brunner, R",
    "name": "Robert Brunner"
}