{
    "comments": [
        "DO NOT take this class if it is not required. If taking, be prepared to take weekly. quizzes. Also, lectures are him going over his slides, so feel free to miss. Exams are hard because they are all application problems . My advice is to study the definitions so you can easily apply them to problems. There is a lot of extra credit tho.",
        "Such a good professor. I took micro in hs and didnt do well, but I am passing this class with flying colors. My favorite professor. 10/10",
        "I took Econ 302 with Buckley last year and will be taking Environmental Economics this semester. One of the classes I'm looking forward to the most. Actually I look forward to all my Econ classes next semester :P",
        "The class is test heavy, every test (there are 3 plus a final) is about 20% of your overall grade. If you don't do good on the exams, don't expect to pass. You get graded on a few things: exams, math, *concepts, and *vocab. In the lecture we don't learn, we all just follow the examples on the slides. Lots of sleepers, he's truly boring. Never again",
        "Buckley is a great guy. His lectures can be dry but he does bring in interesting real-world examples. The class is very test-heavy but they aren't very difficult. Make sure to do all the extra credit and practice the math problems before the tests.",
        "Great guy, very passionate, go to lecture and get the workbook and you will do great as well as learn a lot about econ.",
        "He is clearly smart and knows what he is talking about, but his teaching style is just not very good for a large lecture. His powerpoints are endless and not very helpful. But the hardest part is that there is little homework and it does not correlate to the tests at all. The practice tests are somewhat helpful, but more practice is needed to prep.",
        "Lectures are very boring with a lot of extraneous info. There are a lot of materials to study and learn from. Definitely go to discussion and buy the work book and you'll do fine. Lectures as aren't totally necessary but at least study the slides",
        "exam is so hard",
        "If you buy the workbook, you'll basically be set for the course. You can study the practice tests in the workbook for the midterms and final. Overall, decent professor.",
        "ECON302,482,490 - One of my favorite econ professors at UIUC. The classes he teaches all follow a very similar format. The workbook(302) is very helpful as it has sample tests/exercises that resemble the exams in class. There was extra credit in all his classes. Lectures may sometimes be dry, but he is very passionate and is just an awesome guy.",
        "One of the best professors I have had. He gives so much material to get you ready for all the exams and the final exam as well.",
        "Excellent teacher!!!",
        "Do the extra credit each time you do a homework assignment so you don't have to cram it all in later. Went to class probably three times. Wasn't a good idea because I had to study for like 30 hours to have any idea what was going on on the practice final exams in the book. And the final was way harder than the other exams. Still got an A tho",
        "I thought this class would be an easy A, it wasn't. Buckley is good teacher, but the lectures are dry and hard to focus on. I 1000% recommend getting the notes packet and not slacking. Do as much of the extra credit as you can and study! Discussion was optional, but I advise that you go.",
        "He actually cares about students - there's just so many in this class that it's hard to really connect with him in any meaningful way. He makes economics fun. If you pay attention in class, do the extra credit, and use the study booklet you should have a fairly easy A.",
        "Professor Buckley is a fantastic lecturer. If you go to class and the discussion sections a majority of the time and do the workbook problems, you'll get an A. He's also accessible outside of class if you need any help. He genuinely cares about his students.",
        "Buckley is a great guy. In his class there are 4 exams (1 final). If you want you can skip all 3 exams except the final, it just puts all the weight on the final. If you are someone who skips lectures but is willing to study before the exam, do the practice exams they are just like the final. 100% on the homework is so easy, and its 30% of ur grade"
    ],
    "tags": [
        "Test heavy|Beware of pop quizzes|Lecture heavy",
        "Respected|Graded by few things|EXTRA CREDIT",
        "Respected|Amazing lectures|Caring",
        "Skip class? You won't pass.|Graded by few things|Test heavy",
        "Accessible outside class|Test heavy|Clear grading criteria",
        "Inspirational|Graded by few things|Lecture heavy",
        "Clear grading criteria|TEST HEAVY|LECTURE HEAVY",
        "GRADED BY FEW THINGS|EXTRA CREDIT|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|LECTURE HEAVY",
        "Respected|LECTURE HEAVY",
        "Respected|Clear grading criteria|EXTRA CREDIT",
        "Inspirational|Clear grading criteria|Hilarious",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "LECTURE HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|GRADED BY FEW THINGS",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Caring",
        "Respected|GRADED BY FEW THINGS|EXTRA CREDIT"
    ],
    "rating": 4.0,
    "initial": "Buckley, B",
    "name": "Bryan Buckley"
}