{
    "comments": [
        "DO NOT take ARTH 214. It is not worth satisfying the two gen ed categories with one class because this class is horrible. Anne is knowledgeable and pretty friendly, but she is an awful teacher. She is extremely disorganized and very unclear with what she wants in the many writing assignments you have to do and grades pretty randomly.",
        "If you're registered for her class, drop ASAP. She isn't clear about anything, I never knew what was assigned what was due or what grade I got. She locks you out of the room if you go to the bathroom because its \"disrespectful\" and she made us buy $67 worth of books and course packets that could've just been posted online. Never take a class w/ her",
        "I took a class of hers in 2011, it was a 100-level and it was miserable. As a senior I took ARTH403 and it was a perspective altering experience. Her ability to convey her vast knowledge is much more conducive to a small class size. She became my favorite professor from my time at Illinois!",
        "Although her lecture is fairly interesting and inspiring, she only grades students well if you follow HER SUBJECTIVE point of view. She tries to make herself looked open-minded but she is actually not. Also, she is Extremely hard to communicate with, both in terms of assignments and conversation. Just too stubborn and old for a teacher.",
        "Professor Burkus is an extraordinary professor. She is an expert in Chinese art, and her passion is truly contagious and inspirational. I was often moved by her lectures. She genuinely cares about her students, too.",
        "Professor Burkus is a highly sophisticated Asian Art scholar who genuinely cares about her students if they show respect and passion towards her and the work that she teaches. Be ready to show up and contribute to class discussion, then she will be the most helpful and caring professor ever!",
        "Horrible professor, drop out of her class PRONTO, I wish I had.",
        "Took GCL 129 but was nothing as advertised in the course explorer. The class required 5 books that weren't even widely used. The professor lacked the knowledge to connect the course to what she was trying to explain to the students. 4 main papers, one group project, and a heavy focus on sinology. Her grading is harsh but will negotiate.",
        "GCL129 was not what was advertised on course explorer -- focused on design as in art, not buildings and infrastructure (what I expected). However, had a good time in class. However, she really grades based on how much she likes you, not very subjective. If you participate and engage with her, you should have an easy time.",
        "Professor Burkus is genuine, kind, and extremely knowledgeable. She really cares about her students and her classes are very engaging."
    ],
    "tags": [
        "Lots of homework|So many papers|Tough grader",
        "Lots of homework|Graded by few things|Lecture heavy",
        "Participation matters|Amazing lectures",
        "Accessible outside class|Group projects|Tough grader",
        "Gives good feedback|Accessible outside class|Group projects",
        "Get ready to read|SO MANY PAPERS",
        "Tough Grader",
        "Get ready to read|SO MANY PAPERS|GROUP PROJECTS",
        "Get ready to read|Participation matters|SO MANY PAPERS",
        "Inspirational|Caring"
    ],
    "rating": 2.9,
    "initial": "Burkus-Chasson, A",
    "name": "Anne Burkus-Chasson"
}