{
    "comments": [
        "Do not take this class. I took it online so it may be better in person but the class was exclusively taught by the TA and Prof never said anything to us. The only thing he did was give us confusing grading. I know native speakers in the class that got D's on the first test. The class is super difficult online and grading is ridiculous.",
        "Class experience depends on TA because students never had one interaction with Brenden unless it was an email. Lack of communication about class expectations and grading criteria which makes it difficult to enjoy the class. Homework isn't bad just frequent.",
        "The absolute best class I have taken so far. Carollo is so helpful and does a great job at explaining things when the class is confused. Altough the class was on zoom (due to COVID) I still felt very connected and loved the participation aspect of the class. As long as you pay attention and do the work, you should get a good grade.",
        "Never saw Carollo. Class 100% TA taught meaning experience relies heavily on them. My TA was amazing, so the class was very easy. Can't speak to other sections yet this class is far easier than 142, given its vocab heavy, grammar light nature. Tests are very easy to study for, and there are no surprises as to what is on midterm/final.",
        "Absolutely loved Professor Carollo! He genuinely cared about his students and made sure they understood the material. Always responded to emails fairly quickly. Also, he is always available to help you during office hours!",
        "Prof. Carollo is an amazing professor for SPAN142! His method of the hybrid class, where you do preparation for the next class, really helped me learn. I took 3 years of Spanish in high school but a lot of it came back to me easily. It takes some work and can be long, but his classes are easy to understand and sometimes fun!",
        "Great professor. Learned a lot.",
        "I have no idea why this professor has such a bad rating; he's been one of my favorites. He encourages class participation, is excellent at explaining, and is really accommodating. He does NOT have an ego - in fact, he often makes fun of himself in class! Attend class, do the homework, and you'll pass.",
        "He explains the grammar questions I have pretty well, and he speaks slowly so that everyone can understand him."
    ],
    "tags": [
        "Participation matters|Test heavy|Tough grader",
        "Participation matters",
        "Gives good feedback|Participation matters|Caring",
        "Participation matters|LOTS OF HOMEWORK|Clear grading criteria",
        "Respected|Participation matters|Caring",
        "Gives good feedback|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Respected|Inspirational|Hilarious",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|Clear grading criteria",
        "Gives good feedback"
    ],
    "rating": 3.78,
    "initial": "Carollo, B",
    "name": "Brenden Carollo"
}