{
    "comments": [
        "Professor Challen know his stuff but is rude and condescending if you need help with anything. everyday the help site has over a 3 hour wait and even then you dont get the help you need. Professor Challen basically tells you to figure it out yourself and does not actually help anyone. Difficult class with hard quizzes and very hard MP.",
        "He's a pretty great teacher honestly and I've really enjoyed learning Java through his lectures. The HW and quizzes can be kinda tough so I recommend studying the past week's lessons to prepare. However, I can't recommend it enough if you're willing to put in the effort.",
        "Class is moderate hard and so as the quiz, but like this professor so much that this is actually the first time that I figure how to code.",
        "I've graded him once before and now my opinion has changed. Quizzes are practically hard and homework can be tough to decipher. Says that you can succeed even with no experience, but I strongly think that you must have extensive knowledge of computer science to pass this class. Do not take this course if you have no experience.",
        "One time I entered Professor Challen's Zoom office hours to get help setting up my MP, and he chastised me for interrupting his \"social hours\" with the students (I was the only one in the room). He teaches CS concepts very well and definitely knows his stuff, but I don't like him personally.",
        "Geoff is what I wish every instructor was. His lessons cover absolutely everything you need to succeed, replies instantly on the forum, cares about the success of the students, grants extensions, and encourages you every step of the way. The learning environment for CS 125 is set up extremely well to provide you with all the help you need to learn.",
        "The class website is good, but the quizzes are a little hard and the MPs are downright impossible for people who are beginners at coding and completely disconnected from what we are learning in regular lessons. Would most certainly not recommend for beginners despite the fact that this is an \"intro\" course. Getting an A is a struggle.",
        "Most people I know either love or hate Challen. I'm in the first camp. He's the best professor I've had at UIUC. Challen is extremely well organized. He is upbeat and intelligent. I'd never coded before taking CS125, and I'm getting an A. If you actually take the time to study the daily lessons then the homeworks and mps are pretty easy.",
        "Awesome class",
        "By far my favorite professor at UIUC so far! The daily lectures were perfectly paced and interactive! Having taken another CS class that isn't going as well, I really miss the structure of CS 125. Super easy to get feedback on MPs or general help with the content.",
        "I took this course because it was supposed to be an introduction to computer science. However this class expects you to already be experienced with thinking like a programmer beforehand. I ended up spending hours on homework that should have taken a few minutes at most. Quizzes are very difficult and MPs are even worse.",
        "Geoff doesn't like students sending him individual emails but it makes sense because you can literally get the same questions answered on the forum in 5 minutes or less by him or by the staff. His lectures are very thorough and helpful and he's very passionate and knowledgeable about CS. Great professor who's always got your back.",
        "He is the best professor I ever met, really. The daily practice is great. The Mp is a little bit hard, but if you work hard and spend enough time it would be great. However, the quizzs and exams are hard, if you want A, you need to pay more attention to the homework and Mps.",
        "He is the best. MPs and weekly quizs could be tough, but you'll be OK.",
        "He is a very good professor and he knows how to help his students very well. I was brand new to programming and this class really helped make me understand it more. The class is a lot of work and you need to watch the walkthroughs the Professor puts online to understand what is happening in the class.",
        "Geoff's teaching style is incredibly clear and concise. The daily lessons are structured well in content and also delivery. I admit, for someone truly coding for the first time - the course will take you 1-2 hours every day. If coding isn't for you, however - it's best you realize it as soon as possible. (class median: 93)",
        "I was definitely a beginner in CS, but Geoff is an extremely caring professor and does a really good job of explaining all of the material. The class is hard though, with homework due every day and five lectures a week. Luckily the class is well organized and has lots of office hours, but even still the quizzes and MP are a real pain.",
        "If I have to rate him in detail I would give a 4.8 for him, but there is no option for it. He's the one of the best instructors I have for fall 2020. The workload is really heavy since there are 5 lectures per week and also a HW followed after the lecture. The only bad thing about this course is the machine project. Would be better if he removes it",
        "The best CS prof to ever exist :-)",
        "Geoff is a great lecturer. He made you work for the class. Though the MPs are hard and extremely time-consuming, it was all worth the timeone of the best courses I have ever taken at UIUC. You would learn a great deal from the class. Take the class if you have time and are ready for some challenges.",
        "Excellent guy! He wants every student to succeed and will do whatever it takes for them to appreciate the subject. The class has a good mix of fun and hard work. Put some effort and I guarantee youll get an A and even pursue this field for life. Do take this class, even if you have nothing to do with CS.",
        "The class was straightforward. Go to lecture, do the daily homework, start MPs early, go to office hours and ask questions. This is not a low-time class, but it's very worth it. You definitely need to go to office hours to finish the MPs . The homework was incredible. Wish I still had access to the homework problems honestly.",
        "Fantastic teacher and human being. He really cares that students succeed and has organized CS 125 with daily homework assignments that really reinforce the concepts. Super innovative approach that I wish more of my other professors would take with the online forum and mobilizing such a large course staff. You will learn so much in this class!!",
        "Geoff is a super great teacher and really cares about his students. I had almost no prior coding experience coming into the course so the quizzes and MPs were very challenging to me. This class is definitely hard.",
        "The MPs are irrelevant to the lectures and the prof is not good at teaching. Either he has typos in the ppts or he would just mention sth and say that we would learn about that later and then never talks about it again.",
        "Great professor, very passionate about CS materials and thinks for his students. I was a beginner in programming and I did have a bad time in the first few weeks, but it's not hard once you get used to it.",
        "Geoff is really nice and he's passionate about computer science! This class requires a fair amount of work but it's an easy A as long as you do your work. The MP of this semester is harder than previous ones but he gave an extra drop for MP and apologize in class. I went to his office hour once and we had a really nice conversation.",
        "It is very easy to get an A/A+ in his class, but there is a decent amount of work to be done. HW problems everyday and MPs biweekly. If you put in the work, you will get an A guaranteed.",
        "This man is strong-minded, but won't act on impulse. We made an APP to recommend easy gen-eds, and while Geoff doesn't personally like the idea, he gave fair feedbacks of our project. He moves the class a bit fast, making the 4-credit-hour-class appearing like 6, but his lectures are decent. About MPs - beginners have to go to office hours!",
        "Genuinely cares about teaching and his students. Sometimes he went too fast and this was very frustrating for beginners. However, he responds and changes according to anonymous feedback forms, which I really appreciated. There is daily homework and mandatory attendance, but also a generous drop policy.",
        "His lectures were absolutely amazing, I know my stuff but I still learned a whole lot! His lectures are mandatory and you do have to keep up with the slides to get credit, but you also get 10 drop lecture attendances! His class isn't the easiest but he does his fair share to make an A worth what it is. If you work hard, A isn't an issue.",
        "Geoff's CS125 class is fantastic. He has improved it constantly through feedback, and it will only get better. The class is hard, and will be a huge challenge for beginners. However, towards the end of the course, you will know all the work was worth it. He really cares about every student and really made the 9 AM lectures bearable.",
        "Really good prof, seriously.",
        "Very good class. Everything is structured extremely well, and it's clear that Geoff has/is putting in a LOT of work towards improving the class. His lectures were very comprehensive, and whenever I didn't understand something, I could just look back into the lecture video. He cares a lot about his students, and the grading is very generous.",
        "I had no coding experience coming to this class. Not gonna lie. This class was tough. Spent more than 10 -12 hours a week alone on Machine Problems. However, Geoff take feedback pretty well and will hear his students out. Going to office hours consistently will help you do well on this class. Class doesn't get easier, but its gets better.",
        "Don't get me wrong, CS125 is hard even to the ones who have taken ap in high school. But I honestly think geoff tries to guide us to understand the concepts. Also his grading system is really generous. I absolutely bombed my first midterm(68) and still end up getting A( 96) overall, he also gives lots of extra credits",
        "There is no doubt that this is a hard course. Actually, it is the hardest course I have ever taken, even much harder than 400-level math courses. However, I do think Challen is a good professor. He is passionate about teaching, and always willing to give students help. The MPs are hard, but it turns out that we can learn a lot from this course!",
        "Super hard midterm. Hmmm. Proving Fermat's Last Theorem is much easier than his midterm.",
        "Geoff is awesome. He really cares about his students and is extremely helpful. I wasn't sure if I wanted to do CS but now I know I do. A word of caution: this class is hard and moves quickly. It's easy to get an A if you stay on top of it though.",
        "Geoff clearly really cares about his students. You can really tell that he has put in a lot of effort to make this class accessible to as many people as possible. Don't get me wrong, this is not an easy class, but there are many resources available to help you do well.",
        "He is patient and very good at explaining topics . There is a lot of work, but if you do it and study for quizzes/midterms, then you will get an A. He is very active at answering questions on the forum. The CAs/TAs are very helpful. There were few bugs in the assignments. The class was very well-organized.",
        "CS 125 is more time-consuming than other intro courses, but Geoff has put a lot of effort into making it accessible to anyone (I personally had a little Python and no Java experience before taking CS 125). Daily quizzes, weekly homework, and biweekly machine problems (MPs) prevents slacking, but it's ultimately rewarding.",
        "This is one of the most amazing courses I've ever taken. It's REALLY hard for a starter to surive this course, but after coming along a long, long adventure, you find yourself harvest a great deal. The grading for this course is also generous, as about 50% people can get A. Take this if you love CS, or leave the seat for those who loves it.",
        "For fall 2018 CS125, Indeed it's a little bit too hard even for people who have learned AP CS before, but it's worthwhile to work your ass off and learn a hell out. ECs were given. Geoff earns my respect at least. Really fantastic lecturer. :D",
        "I don't really understand the Geoff hate on here. The class is tough, no doubt about it. But coming from someone with very little previous experience, his class is doable. He's also super active on the forum and on reddit which can be really helpful.",
        "awfull",
        "I have never seen someone put so much effort in to teaching his students. Geoff really does care about teaching us and the amount of work he puts into it is reflective of that. Having a learned a little java prior to entering this class I thought I would be in for an easy A. Instead, I ended up learning SO MUCH. You will work for an A, but worth it",
        "If you go to class, follow the slides (to get participation points), do the daily hws, work on the MP early and get 100 for all MPs, then you will do well on quizes and midterms. Since the grading components are really nice, if you work hard, you will get an A. ps: MP are worth a lot, make sure to do them and get 100 on them.",
        "Explained things clearly and covered a lot of useful material. Only now that I'm at a different university do I realize how well taught CS 125 was. Some people love to hate on him because of the course difficulty, but it's worth it and you can definitely do it as long as you don't procrastinate.",
        "Geoff gets a lot of slack in this class but he actually works incredibly hard to make this a better CS class/school. Before this year 125 was a very easy class, especially for those with experience. Now, however, it is difficult, and extremely difficult if you don't have experience. Be prepared to sell your soul, but you will learn a HELL OF A LOT.",
        "Class is extremely difficult and not beginner level at all. MP's are almost never related to lecture and you have to use code he never taught you yet in order to complete them. If you have 4 years of programming experience or a really smart friend, this will be fine. But for everyone else, office hours everyday. Get out of this class if possible.",
        "I enjoyed his lecturing A LOT. I think he is pretty talented as a lecturer. He expresses things pretty clearly. EVERYTHING MAKES SENSE in this class. In Spring 2018, we had more than 100 CA to answer our questions and help with MPs But don't need to worry about grades that much, most people got A at last. There are several extra credit opportunitie",
        "Extremely arrogant.",
        "Awful experience overall.",
        "Challen is very passionate about teaching and he tries to make sure that help is always accessible. The grading is quite generous as 12% of students in Spring 2018 got 100% or higher in the class. However, the MPs are challenging and I would not recommend taking this class unless you are prepared to invest hours of work every week into the MPs.",
        "While the course has a bit of a learning curve at the start, it is COMPLETELY worth it to get over the hump. Professor Challen runs his class well, and I learnt a lot in the course (much more than if I had taken CS 101). I went from having no knowledge of CS, to making a working android app. Highly recommend CS125 with Geoff - makes class great!",
        "CS 125 was a challenging by rewarding class. I don't think the current rating of him (2.2) fits what I saw in my class (Spring 2018). Notes, quizzes, and MPs were all relevant. Everything was solvable, but not necessarily easy. You will learn a lot and have it be relevant knowledge in his classes. Put in the work and you will be fine.",
        "I got mental illness after taking his class. His class is funny but the homework tortures me a lot. I am a freshman and I hope my rest of the college life can be better.",
        "The professor writes bugs and sometimes make mistakes, but he never admits. He also talks a lot of useless words and forces you to listen during class, such as how many Android devices are around the world, and this is in the quiz! Not a introductory at all. If you are good at CS, take the proficiency, if not, take CS101 instead.",
        "It is indeed a tough class but when I come this far I feels good and get more adept at doing MPs and quizzes. As long as you devote enough time in and follow Prof's instruction carefully you would definitely achieve a desirable grade.",
        "Although his 125 class, as a introductory cs class, is little bit challenging, he is definitely doing a good job as a cs professor and designed so many online systems useful to students.",
        "This prof sucks.",
        "His CS125 is not beginner friendly at all.",
        "The worst professor in this university!!!!!!!!!",
        "This is the worst professor I've ever seen in my life. Worst course. Lowest grade.",
        "Yes the grading policy wasn't clear enough. But this is the first semester after he redesigned the course so it is understandable. He is definitely trying very hard to improve this course and he is doing perfectly fine. His lectures are very inspiring and this course has office hours running by CAs nearly 10 hours every day from Monday to Friday.",
        "Worst course.",
        "Honestly speaking Geoff is an awesome professor. He has been trying to redesign CS125 since fall 2017 and made great progress so far. I agree that this is class is hard and the workload is heavy, but this is necessary for CS students, especially those who don't have previous coding experience.",
        "This course is not that hard overall, but the problem is that nobody really gets attendance points. That is 5%, and no matter how well you do in other parts, an A is impossible.",
        "Now I know why everyone just chuckles when you say you have challen this semester. I'm not saying he is horrible, it's just the system. Attendance is absurd and nonfunctional. This is DEFINITELY NOT an INTRO to CS & MP is not related to lecture & office HR is crazy. The school says it is Intended as a first course with no prereq except math. LIES!",
        "The attendance system is really stupid. I attended every lecture but found the record showed that 8 lectures were missed. By the way, we are just at the half of this semester. I can't imagine what participation would I get at the end.",
        "Unorganized Office Hour, Unclear documentation, Buggy testcases, Poor infrastructure",
        "This course is too hard for beginners. I don't recommend students to take it without any background of cs. The lecture is never related to MP.",
        "Please, this is freshman level course. Don't make it too hard."
    ],
    "tags": [
        "Skip class? You won't pass.",
        "Lots of homework|Accessible outside class|Clear grading criteria",
        "Gives good feedback|Respected|Lots of homework",
        "EXTRA CREDIT",
        "Respected|Lots of homework",
        "Respected|Skip class? You won't pass.|Caring",
        "Lots of homework|Clear grading criteria",
        "Lots of homework|Get ready to read|Skip class? You won't pass.",
        "Respected|Inspirational|Amazing lectures",
        "Inspirational|Amazing lectures|Caring",
        "Lots of homework|Skip class? You won't pass.|Lecture heavy",
        "Lots of homework|Lecture heavy",
        "Respected",
        "Inspirational|Clear grading criteria|Amazing lectures",
        "Respected|Inspirational|Lecture heavy",
        "Lots of homework|Amazing lectures",
        "Lots of homework|Lecture heavy|Caring",
        "Lots of homework|Test heavy|Lecture heavy",
        "Respected|Inspirational|Amazing lectures",
        "Lots of homework|Inspirational|Clear grading criteria",
        "Inspirational|Clear grading criteria|Caring",
        "Lots of homework|Participation matters|Clear grading criteria",
        "Accessible outside class|Inspirational|Caring",
        "Lots of homework|Accessible outside class",
        "Lots of homework|Participation matters",
        "Respected|Accessible outside class",
        "Lots of homework|Participation matters|EXTRA CREDIT",
        "Respected|Lots of homework|Accessible outside class",
        "Respected|Inspirational|Group projects",
        "LOTS OF HOMEWORK|Clear grading criteria|Caring",
        "Skip class? You won't pass.|Amazing lectures|EXTRA CREDIT",
        "Skip class? You won't pass.|Amazing lectures|Caring",
        "Amazing lectures|EXTRA CREDIT|GROUP PROJECTS",
        "Skip class? You won't pass.",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Participation matters|LOTS OF HOMEWORK|EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT|GROUP PROJECTS",
        "LOTS OF HOMEWORK|TEST HEAVY|EXTRA CREDIT",
        "Gives good feedback|Respected|ACCESSIBLE OUTSIDE CLASS",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Caring",
        "LOTS OF HOMEWORK|Caring|EXTRA CREDIT",
        "Participation matters|LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS",
        "Skip class? You won't pass.|TEST HEAVY|EXTRA CREDIT",
        "Inspirational|Amazing lectures|EXTRA CREDIT",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS",
        "Skip class? You won't pass.|TEST HEAVY|LOTS OF HOMEWORK",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|Clear grading criteria",
        "Gives good feedback|Clear grading criteria|Amazing lectures",
        "Respected|Skip class? You won't pass.",
        "Tough Grader|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Tough Grader|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Inspirational|Clear grading criteria|Amazing lectures",
        "BEWARE OF POP QUIZZES",
        "Tough Grader|LOTS OF HOMEWORK|BEWARE OF POP QUIZZES",
        "Respected|Caring|EXTRA CREDIT",
        "Participation matters|Clear grading criteria|EXTRA CREDIT",
        "Participation matters|LOTS OF HOMEWORK|Inspirational",
        "Hilarious|TEST HEAVY|Amazing lectures",
        "Tough Grader|Skip class? You won't pass.|TEST HEAVY",
        "Tough Grader|Participation matters|Inspirational",
        "Respected",
        "Tough Grader|Participation matters|TEST HEAVY",
        "Tough Grader|Participation matters|Skip class? You won't pass.",
        "Participation matters|Skip class? You won't pass.|TEST HEAVY",
        "Tough Grader|Skip class? You won't pass.",
        "LOTS OF HOMEWORK|Inspirational|Amazing lectures",
        "Tough Grader|LOTS OF HOMEWORK|BEWARE OF POP QUIZZES",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Participation matters",
        "Participation matters|Skip class? You won't pass.",
        "Participation matters|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader",
        "Tough Grader|Skip class? You won't pass."
    ],
    "rating": 3.69,
    "initial": "Challen, G",
    "name": "Geoffrey Challen"
}