{
    "comments": [
        "The amount of info covered in this course is extensive and Dr. Chaplin is not very good at pacing her lectures based off it. It felt like her lectures were all over the place and she's not a very flexible professor during these times. I think she made the class harder than it needed to be. If you're taking this for a gen ed requirement, don't.",
        "Her lectures are interesting for the most part. There are some really boring lectures. In order to excel in this class, you're going to have to read the primary sources assigned each week and read the textbook. There are also >15 graded assignments. Get ready for a lot of writing. 98% of our assignments were writing assignments",
        "Coming in as a Freshman I took two history classes and this one was by far my favorite. The lectures are great, and the work is not heavy based. Overall, the class is very well organized and its easy to get the hang of what is asked to pass.",
        "Not even a history major, just took this class as an elective for fun. One of the most engaging/interesting lecturers I've had in college-- she made me want to come to class. You have to put in work and know your stuff to get good results, but she hand feeds you the information you need to know, so go to lecture.",
        "Dr. Chaplin has single-handedly become my favorite professor I have ever had. She is extremely knowledgeable on modern French history and it is evident in her lively lectures. It is imperative that you come prepared by doing all of the readings and assignments for the class as participation is key for your success. Amazing professor and class!",
        "As a lecturer, she is good and she covers the content pretty well. However, the assigned reading is just too much. There are required textbook and primary source readings every week, but after the first month, I just stopped cause there was too much. There is also no place to see your grade since the TA does all the grading.",
        "Honestly, the BEST professor I've encountered. I have had her for two different semesters now, and it's been thoroughly enjoyable. She expects a lot from her students so if you're looking to skimp through her class then maybe she's not the professor for you. Hilarious, engaging, CARING, honest. She will make you a better student.",
        "The exams are reasonable. If you attend class, you should be totally fine. Notes have to be taken by hand. Just a note though, if you're rude or annoy her in some way, she is not afraid to give you a taste of your own medicine (not my personal experience but my observation). In general, I would not take a class taught by this professor, again."
    ],
    "tags": [
        "Get ready to read|Graded by few things|Beware of pop quizzes",
        "Get ready to read|Skip class? You won't pass.|Graded by few things",
        "Amazing lectures|Graded by few things|Participation matters",
        "Respected|Get ready to read|Amazing lectures",
        "Get ready to read|Amazing lectures|Lecture heavy",
        "Beware of pop quizzes",
        "Respected|Participation matters|Caring",
        "Participation matters|Skip class? You won't pass.|SO MANY PAPERS"
    ],
    "rating": 4.0,
    "initial": "Chaplin, T",
    "name": "Tamara Chaplin"
}