{
    "comments": [
        "Fun class - was too easy and didn't learn as much as I'd hoped.",
        "Prof. Chapman was an awesome lecturer. He always made every effort to make his lectures as fun as possible, and his grasp of the material never outshone his ability to teach it well.",
        "Great professor. Class goes very quickly, so if you've never had any experience with Computer Science this may be difficult,  but go to lectures (they do in fact help keep you from getting behind) and don't be afraid to ask for help. By far one of the best professors I've had so far.",
        "Great professor for an intro class, and made it very easy to understand the concepts presented in class. He always explained things really well and did a fantastic job explaining difficult topics when students were confused.",
        "Really good professor and he is AWESOME! He present everything clearly in class.",
        "Outstanding professor, really cares about his students and a great lecturer. Very receptive to students and knowledgeable. Great professor for an introductory course",
        "CS125 is a great introductory course, but for those who do not have a lot of programming experience, a lot of the responsibility of learning how the code works is on your shoulders! But as long as you do the reading you should be well on track to do well in this course! Bill is a great lecturer and a very responsive and receptive professor.",
        "A lot of extra credit! Interesting course also.",
        "One of my favorite professors so far. I recently decided that I wanted to do a minor and struggled in the class a little, but he truly does want you to do well and if you go to his office hours, he is very helpful! If it's your first time coding, plan to put the work in, but it's very doable because there are plenty of resources available.",
        "Professor Chapman is easily the best professor I had as a freshman, he cares about his students and actually makes computer science  interesting. The class is not hard but it was a lot of work, make sure you go to lecture if you don't have prior programming knowledge or else you'll struggle in the course.",
        "If you don't already know CS, you will have to work for it."
    ],
    "tags": [
        "Respected|Inspirational|Caring",
        "Respected|Amazing lectures|Caring",
        "Respected|Clear grading criteria|LECTURE HEAVY",
        "Respected|Amazing lectures|Caring",
        "Participation matters|Inspirational|Clear grading criteria",
        "Gives good feedback|Respected|Participation matters",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "Respected|Inspirational|EXTRA CREDIT",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Respected|Amazing lectures|Caring",
        "Participation matters|Skip class? You won't pass.|LOTS OF HOMEWORK"
    ],
    "rating": 4.55,
    "initial": "Chapman, W",
    "name": "William Chapman"
}