{
    "comments": [
        "Dr. Chapman was one the best professors I have had! he's tough so try not to slack off but he's only hard because he's preparing you for your future courses, like MCB 450. He's passionate about what he does and that only makes him better. If you need help, go to his office hours. He's great!",
        "Hes very kind and means well but I think his passion for the class leaves him all over the place. Its very hard to follow along. I couldnt take notes he would just go way off topic and stop teaching altogether. I recommend renting the textbook , showing up to class, doing the extra credit + hw. But if u dont have to take it dont.",
        "He's a tough cookie",
        "Chapman is passionate but very scattered. His lectures are hard to follow because he rambles. The test are okay, its a lot of material to cover so study in advance. He doesnt respond to emails so you have to catch him after class. Make sure you study. His lectures are very boring because he doesnt stay on track.",
        "Chapman is a very kind professor and passionate about teaching. He gives a lot of extra credit for the exam. Be sure to go through all the materials and study hard for the exam. His exams are not that bad. You just need to work hard and prepare in advanced.",
        "How to do well: go through and memorize ALL lecture slides. Do NOT read the book page for page, only read sections that are confusing to you. Study in advance.. like 1-2 weeks  before each exam. You won't learn in class, so give yourself enough time to memorize 98% of material. Information isn't hard, just a very overwhelming, time consuming amount"
    ],
    "tags": [
        "Gives good feedback|Respected|Inspirational",
        "Participation matters|Skip class? You won't pass.|TEST HEAVY",
        "Tough Grader|Get ready to read|LECTURE HEAVY",
        "Participation matters|EXTRA CREDIT",
        "Participation matters|EXTRA CREDIT|LECTURE HEAVY",
        "Tough Grader|EXTRA CREDIT|LECTURE HEAVY"
    ],
    "rating": 2.5,
    "initial": "Chapman, K",
    "name": "Ken Chapman"
}