{
    "comments": [
        "Please dont let anyone away you from taking this course! You do have to pay attention in the course and show up to class. You also have to understand its only 2 exams and a paper for your entire grade. If you study and do your work youll be fine in the class. He answers all questions in and out of class. I learned a new respect for Chinas hist.",
        "I have no idea when things are due, the syllabus printed out for the first day was literally incorrect, causing me problems further into the year, I can't see my grades on anything, so I can't tell what's happening with my grades, and overall the organization of the class is nonexistent. Do not take this unless you are an EALC major or minor.",
        "Class was confusing and boring. There were no clear guidelines and the TAs never posted grades. When I asked what my grade was, my TA did not know. People dropped this class like flies, and I can't blame them.",
        "We have so much reading every week, and there is a quiz every week as well. They do not post your grades to compass so you have no idea what you are getting in the class. The papers are hard to write, and the TA does not help you through the class at all. If this was not a requirement for my minor, I would have dropped this class.",
        "He is a really harsh grader. No review for the exams. You will never know your quiz scores unless you email your TA. He takes attendance during class. Lots of reading.  Most of my Chinese friends got C's or D's in this class.",
        "Extremely difficult for a 200 level course. Paper expectations were not clear and there was little way to prep for the tests, since he doesn't hold review and the slides for lecture may as well be blank. Some really obscure details were tested on and an answer can't just be right, it also had to be the exact things he SPOKE in class"
    ],
    "tags": [
        "Gives good feedback|Participation matters|Lecture heavy",
        "Participation matters|Lecture heavy",
        "Get ready to read|TEST HEAVY|LECTURE HEAVY",
        "Get ready to read|Skip class? You won't pass.|TEST HEAVY",
        "Tough Grader|Skip class? You won't pass.|SO MANY PAPERS",
        "Tough Grader|TEST HEAVY|GRADED BY FEW THINGS"
    ],
    "rating": 1.83,
    "initial": "Chow, W",
    "name": "Wing Chow"
}