{
    "comments": [
        "You can tell how much Clegg cares about his students. The class would be better in person, but it is what it is. His review sessions last for hours, he answers questions until he physically can't stay awake. The only reason the class is not super easy is because it is online, but he still puts a lot of effort into his lectures. Nicest person.",
        "Clegg was AMAZING for IB150. Absolutely take! I didn't study for his tests at all and only went to his legendary review sessions the night before and got an A on all 3. I also did all 55 points worth of extra credit which is a ton considering the course is out of 1000 points. The man is legendary and is easily the nicest, most caring professor ever",
        "He focuses on your ability to apply your understanding of a concept so be prepared to come across examples you haven't discussed in class. Homework is harder than exams. He hosts long study sessions before the exams that are very helpful, he'll thoroughly talk about every concept. He gives out A LOT of extra credit so make sure to do it.",
        "This man is the most caring and helpful professor/teacher I've ever had. He's constantly encouraging and giving out advice. The exam info section saved my life. If you have the opportunity, do yourself a favor and take his class.",
        "Dr. Clegg is one of the best profs at UIUC. He puts so much time and effort to ensure that his students thoroughly comprehend concepts. He genuinely wants students to do well. He holds review sessions and office hours. He goes above and beyond! Tip: he is not a regurgitate prof, you NEED to understand concepts. Overall, I had a great experience!",
        "Professor Clegg is the best professor Ive had. He genuinely cares about the students, and is extremely friendly. He replies fast to emails, even with hundreds of students. He makes class very interesting and is a great lecturer. He takes the time to hand grade over 600 tests as well, so you see he really cares. I would absolutely recommend Clegg!",
        "Honestly one of the best teachers I have ever had. Goes out of his way in order for his students to not only succeed, but actually understand and learn the topics.",
        "Hands down the most caring, helpful, and kind professors at UIUC. I am so sad he only teaches this one class. The exams are very conceptual, this isn't a memorization based course. Cherish Clegg, you will never have another professor as amazing as him again!",
        "Every student deserves to have a professor like Dr. Clegg. I wish all professors were as dedicated and cared as much about their students as he does. His exam review sessions that go until 2 am are legendary. You have to put in the work to learn the material, but you truly do learn. I'd take another class with him in a heartbeat.",
        "Professor Clegg was one of the best teachers I have ever had. He wants you to do well and gives your opportunities to do so. He truly wants you to succeed and gives you great tips on how to do so! Loved this class so much IB is my major now!",
        "I wish this professor could teach all of my classes. His lectures and content are well put together, he plans ahead, and he goes out of his way for students. Although the class was a bit conceptually difficult, he was always able to explain things in multiple ways. Definitely attend his review sessions! He does the absolute most to benefit students",
        "prof clegg is super nice and really cares about his students. in review sessions on zoom he was funny as hell and stayed on until 3am just to make sure everyone had their questions answered. the lectures can be long but never too bad. they're pretty interesting. the online HW is really helpful. i didnt use the textbook once don't bother with it",
        "My favorite professor I have taken so far. His lecture videos tell you exactly what you need to know, and he makes learning the material easy. As for accessibility, he holds review sessions before each exam that last until all the questions are answers. I've stayed on a zoom session with this man from 6 pm to 2 am! Truly dedicated.",
        "Professor Clegg cares about his students by holding lots of office hours(OH) along with TAs. He even holds every OH before every exam until very late in the morning. Such a responsible and enthusiastic Professor as well as caring TAs! Offering lots of extra credits. Despite mandatory meeting in discussions, the material is fun and interacted.",
        "Clegg really cares for his students and wants them to do well. He's one of the best professors I've ever had and even though the information was difficult for me, I wish I could take the class again. He offers a lot of extra credit and hosts long review sessions before the exam. Highly recommend him :)",
        "Dr. Clegg is the most caring professor at UIUC. Before every test, he holds a review session to answer every single person's questions. The last review session lasted from 6pm to 2am. He obviously is passionate about teaching and about making sure every student has the chance to succeed. Truly one of a kind.",
        "Do EVERY SINGLE EXTRA CREDIT. This year, if you did all of the extra credit, you could raise your grade by 6.1%. Clegg WANTS you to succeed; I have never met a professor who goes above and beyond like him, and who does things like review sessions before tests until 3am. Also, tests contain a few qs from homework/practice tests.",
        "He is an amazing teacher. He cares about you and your place in his class. The best example of this: he hosts large exam review sections with up to 200 students on the weekend before a test. He will sit there and answer EVERY question until EVERYONE is satisfied and prepared. You will not find a better teacher.",
        "This class is supposed to be a joke but its not. The online lectures sometimes do not explain all the slides provided. Clegg is a great guy and cares for you. He gives a total of 55 points of extra credit total!! Make sure to read the textbook, do the homework BY YOURSELF, and do lots of practice problems. I didn't really need office hours.",
        "Prof Clegg made the class enjoyable and really taught how to understand the material, not just memorization of facts. He was funny and engaging in lectures. He explained concepts well. Office hours and exam prep were very helpful too.",
        "Ben genuinely cares about each of his students' development. He tests on overarching concepts (unlike MCB150 with is mostly memorizing details), and during lecture, he walks you through the thought process he wants you to have. Lectures are a must. He gives out a ton of extra credit points (nearly 4% of the entire course grade). Do them all.",
        "I had Clegg for IB 150 Merit, and I have to say he is one of the best lecturers/teachers/professors I've had. He cares for his students greatly and wants everyone to get an A, but, more importantly, he wants you to be successful later in life. You definitely need to work to do well, but he provides you with everything you need to do so.",
        "Ben is an extremely caring professor. He's here to support you and make sure you are doing everything to the best of your abilities. There is weekly homework which is often difficult, but between him and his TAs, they have office hours mon-fri which are very helpful. He gives a lot of extra credit and cares a lot about his students.",
        "Please make sure you know the learning goals! Very very important in order to pass the test. The TA's are phenomenal during office hours (please use them if you need help! highly recommended) There's online homework due every week and after each test, go to lecture bc he'll give out extra credit in a quiz format. Ben is super passionate",
        "I had him for IB 150 this year. The class itself wasn't too hard, but he offered lots of extra credit if your grade was low. He genuinely cared for his students and wanted them to succeed.",
        "Ben is an amazing professor and lecturer. He is very passionate about his students and what he is teaching. He tests are very application-based, but he never throws in any curveballs. He only expects you to understand what you were taught in class, or else he will give you background information on the question.",
        "The only thing I don't like about Clegg is that sometimes the lectures don't completely follow the given handouts in the course binder, and sometimes the homework is unnecessarily difficult. Otherwise, he is a great professor who explains concepts thoroughly and makes sure we actually understand the material. The tests are very straightforward.",
        "He really wants his students to succeed.",
        "This class was the hardest thing I've ever done and Dr. Clegg will make you work hard but in the end it's totally worth it. He has the grading scale set up in a way that you have room to make mistakes and learn - I came out with almost an A+ in the class, even after failing the first exam. Definitely my favorite class so far.",
        "Great guy who genuinely cares about and believes in his students. Lectures were always interesting to me and the binder keeps you involved. But decent amount of homework and tests can be kind of difficult. Best advice is redo the practice weekly homework a couple times and take the practice exam before the real exam. Its definitely doable!",
        "I LOVED going to class. He is so enthusiastic and loves to teach. He makes you love the class and content. 10/10 guy",
        "This class really is amazing! Ben knows how to teach and is really passionate about bio. When I am in lecture I genuinely stay focused and try to understand the material, not just memorize it. He is one of the very few teachers who cares about their students and more importantly believes that they can succeed. He is a fantastic professor!!!!!!",
        "Dr. Clegg is a very nice man, but an incredibly ineffective professor. His lectures are often incoherent, ambiguous and convoluted. He very frequently takes simple concepts and makes them very difficult to understand. The TAs in this class know almost nothing about the topic, and are incredibly difficult to work with.",
        "Dr. Clegg is an outstanding professor and a great person. His class is well run, and he prepares you well for his exams through his learning targets/ objectives. You can tell he is a genuine person, that cares about his students, and has a passion for education. He has really accessible office hours as well.",
        "Genuinely good professor and person overall. I only struggle in his class because my high school did a poor job of teaching me the material we were supposed to know prior to this class. However, he does provide you with plenty of resources if this is the case.",
        "Very knowledgable professor. Show up to lecture and do all assignments and you'll be fine. Seemed a little department driven, as if he were simply going off a script. He's very clear about what will be on exams, no curveballs",
        "Dr. Clegg is one of the best professors I have had. He is very passionate about teaching and biology, which made me excited to come to lectures. The way he structures his class allows you to actually understand the material, instead of just memorizing facts. Overall, Dr. Clegg genuinely cares about his students both academically and personally.",
        "Professor Clegg is one of those professors who really cares for your success. His lectures are mandatory but they help a lot. He talks fast sometimes but it's just because he is super passionate about biology. His course demands that you put work outside of class if you want to receive a good grade. He's also hard to catch during office hours.",
        "He's great one on one but he kind of sucks if you only go to lectures. If you meet him for office hours or take it JS like I did, you'll love him. He's very caring and wants to see you succeed, he's not just there for his own research.",
        "Dr. Clegg is an amazing professor who is really passionate about the course that he teaches. The course was very well structured. Although the course mainly covers basic biology topics taught in high school, lectures are still really interesting and the questions he asks in lectures makes you think about these topics from a different perspective.",
        "Clegg will be a professor I will remember forever because he genuinely cares about his students. IB 150 is a decently tough class but he makes it more bearable. He gives a lot of extra credit and gets excited when students do well on tests. Highly recommend taking any classes with Clegg",
        "Professor Clegg is a really great teacher, and it's obvious that he cares about all his students. He's super enthusiastic about biology, and can give good explanations to any questions you may have. The class isn't easy, but there is a lot of extra credit given, and you get a lot of points just for showing up to class. Overall, a solid professor.",
        "Professor Clegg is amazing, he takes time for every student that needs it. He is one of the rare few that actually cares about every single student's success. If you get a chance to take the James Scholar section, do it, because the Professor teaches your discussion section. I can't emphasize enough how good of a teacher he is.",
        "Great teacher and really shows that he cares about his students. Willing to meet with you outside of office hours if you need extra help. Gives tons of extra credit to help boost grades. Exams are hard but he makes it clear what he expects to be known. Be ready to put in work, though!",
        "Did not really learn anything new in this class. If you have an AP Bio background, you are basically set to breeze through the course. I did not particularly like the way lectures and discussions were set up, but they were not the death of me, either. Just be sure to do the practice exams and go over the learning objectives/goals before each exam.",
        "IB150 is in fact the easiest one comparing to all the other MCB courses I have taken. If you have taken AP biology or other bio courses in high school this course should not be a problem. Plus, even if you already know most of the knowledge you could still gain something new as he uses interesting examples. His learning strategies are great!",
        "IB 150 is supposed to be the easiest bio ever, but it did not feel that way. I put in so much work, did all the EC/HW/readings, and studied like crazy to end up with an A-. He was good, but his TA's aren't the best. The set-up of the course is also irritating. He himself is a good and knowledgable guy nonetheless.",
        "Professor Clegg is the most caring professor I have even had. He gives so many opportunities for success in his class. To get a good grade show up to lectures to receive clicker points, do all of the homework because it is a huge chunk of the grade, and go to TA office hours.",
        "Prof. Clegg is an excellent lecturer who tries to make learning the material as interesting as possible, but his lecture activities can sometimes be hard to follow. The exams are pretty difficult, but there is a lot of padding and extra credit and a nice resurrection policy. I got Cs on my first 2 exams and managed to get an A in the course.",
        "I'm really glad to have had him this semester, he's a pretty good professor. Despite the huge lecture size, he does a good job of making it seem smaller. Additionally, the exams for this class are application-based and can be somewhat difficult; however, there's lots of extra credit and resources to get help. Overall, I'd definitely recommend him.",
        "Super thankful to have had Ben as a professor. Hes super passionate and makes class very interesting. Anyone who likes bio will love this class. Defintely deserves more than one pepper on the hot scale.",
        "ben clegg is an amazing professor, very talented. kinda obsessed w him tbh. the class was difficult in my opinion as nothing is about reciting material when it comes to the test, you need a very strong basis in order to apply the information on exams. hopefully im praying for a c. requires access code to mastering bio",
        "He cares a lot about his students. However his lectures are kind of confusing. I never used the text book for this class but I heard he requires Mastering Biology now.",
        "Clegg talks really fast, and definitely deserves the spot to teach. Prepare to learn more about life than you thought you could, because this was the hardest class I had ever taken. If you work hard, and truly understand what you are learning, and do the extra credit, you should get an A. Prepare well for his exams and learn outside of class too.",
        "Ben is a really cool guy. Lectures can get a little boring, but he tries 100% to keep the giant class interested and connected to the class. He highly recommends the textbook, but personally I never touched it and still got an A- in the class. You can feel how passionate he is in the way he teaches and how he treats every student with respect.",
        "Large lecture consisting of near 600 students (Clegg teaches as to not leave ANY behind; very slow)",
        "Clegg is nice guy who is very passionate about biology and explains things very clearly.",
        "Best teacher I had this semester! He is very approachable, is generous with extra credit, holds review sessions for every exam (including final), and is passionate about the subject. There's a decent amount of busy work but it's well worth the easy points to buffer your grade. Just overall a solid professor.",
        "he knows the content really well. office hours are great for extra help.",
        "Amazing professor.  Can get a B average on all the midterms+final and still easily get an A with the hw and participation points.  ALSO DO THE EXTRA CREDIT.  He really cares about all of his students doing well and understanding the material.  Would Recommend for sure.",
        "Clegg is a great professor who makes bio fun and easy.  He also really cares about his students. One time, I accidentally overslept an exam and panicked so I immediately went to his office hour, but Clegg was understanding and let me take the take the exam at that moment.",
        "Really passionate about what he was teaching, made lecture really interesting. Not super difficult material, but he's one of those teachers who wants you to apply concepts on the test rather than just recite material, so you need a really strong foundation to do well. Pretty easy intro course though, not hugely challenging.",
        "A really great teacher. Made difficult concepts easy to understand for all levels of ability. He also holds 6 hour study sessions the weekend before the test, and stays until every last question is answered -- he's really committed to making sure students understand the material, not just get the grade."
    ],
    "tags": [
        "Respected|Inspirational",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Respected|Skip class? You won't pass.|EXTRA CREDIT",
        "Inspirational|Caring",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Gives good feedback|Inspirational|Caring",
        "Clear grading criteria|Amazing lectures|Caring",
        "Respected|Inspirational|Caring",
        "Respected|Inspirational|EXTRA CREDIT",
        "Caring|EXTRA CREDIT",
        "Gives good feedback|Clear grading criteria|EXTRA CREDIT",
        "Inspirational|Lecture heavy|Caring",
        "Accessible outside class|Inspirational|Caring",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Test heavy|Caring|EXTRA CREDIT",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Accessible outside class|EXTRA CREDIT",
        "Respected|Inspirational|Caring",
        "Lots of homework|Get ready to read|EXTRA CREDIT",
        "Respected|Inspirational|Hilarious",
        "Respected|Skip class? You won't pass.|EXTRA CREDIT",
        "Accessible outside class|Inspirational|Clear grading criteria",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Participation matters|Amazing lectures",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Inspirational|Caring|EXTRA CREDIT",
        "Group projects|Amazing lectures|Caring",
        "Skip class? You won't pass.|Test heavy|Caring",
        "Lots of homework|Lecture heavy|Caring",
        "Accessible outside class|Inspirational|Caring",
        "Inspirational|Amazing lectures|Caring",
        "Lots of homework|EXTRA CREDIT",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "Respected|Lots of homework|Skip class? You won't pass.",
        "Participation matters|EXTRA CREDIT",
        "Inspirational|Amazing lectures|Caring",
        "Skip class? You won't pass.|Caring|LECTURE HEAVY",
        "LOTS OF HOMEWORK|Caring|EXTRA CREDIT",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Inspirational|Amazing lectures|EXTRA CREDIT",
        "Skip class? You won't pass.|Inspirational|EXTRA CREDIT",
        "Inspirational|Hilarious|Caring",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "Caring|EXTRA CREDIT|LECTURE HEAVY",
        "Inspirational|Clear grading criteria|Caring",
        "Tough Grader|Skip class? You won't pass.|EXTRA CREDIT",
        "Respected|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Respected|ACCESSIBLE OUTSIDE CLASS|LECTURE HEAVY",
        "Hilarious|Caring|EXTRA CREDIT",
        "Inspirational|Hilarious|Would take again",
        "Participation matters|EXTRA CREDIT|LECTURE HEAVY",
        "Clear grading criteria|EXTRA CREDIT",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "Participation matters|Inspirational|EXTRA CREDIT",
        "EXTRA CREDIT|GROUP PROJECTS|LECTURE HEAVY",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Respected|Inspirational|ACCESSIBLE OUTSIDE CLASS",
        "Respected|Participation matters|Amazing lectures",
        "Respected|Amazing lectures|Caring",
        "Skip class? You won't pass.|Clear grading criteria|LECTURE HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|GROUP PROJECTS"
    ],
    "rating": 4.7,
    "initial": "Clegg, B",
    "name": "Ben Clegg"
}