{
    "comments": [
        "Lots of writing and discussion posts required every week",
        "She's a the toughest grader I've ever seen in my life. She even gave us more homework during the thanksgiving break. She's also a very mean professor that gives no understanding to her students.",
        "Not a very flexible instructor. Most of the teachings come from the assigned readings. What's the point of the lecture videos then? Not a hard course, but small mistakes (AKA not understanding the instructions in the beginning)will greatly affect your overall grade). I love what the readings had to offer though and the case studies. ugh. good luck",
        "I liked Dionne a lot. We zoomed a lot one on one this semester and she helped me through a really hard situation personally. I read some other person say the quizzes are not fair, but the TAs make and grade the quizzes. The TA is useless but if I had a problem I would just talk to her directly. I learned a lot in this class and it was easy.",
        "I learned a lot in this class and ended up doing really well in an interview by talking about the things I learned in this class.",
        "The class is easy but you have a lot of reading. Not too many assignments",
        "Took this course with a friend. We both got A+. Its very easy to get a good grade but you cant miss the assignments",
        "This class is online so you dont have to attend. There are weekly due dates you cant miss but not a lot of homework. The quizzes are fair and you dont have to read if you watch the lectures.",
        "I dont know how anyone does bad in this class. The quizzes are open note and easy if you watch the lecture videos. If you miss a question she will give you the points back if you explain. The case studies are kinda hard to read but I spent 2 days and finished all of them. Group project was bad because my was lazy, but overall the class was good.",
        "This class is not hard, but there is a lot of reading. Not too many papers due, only 5. Group project is kind of annoying but she let us pick our group. grading is slow, but she has a good personality and the class is fun and interesting.",
        "Dionne is a good professor. I learned a lot in this class and she helped me get a internship. You really do have to do the reading but it is not hard to get through. If you go to her office hours you will likely get more out of her and the class since its is all online.",
        "Dionne is probably the most unorganized and unmotivated teachers I've ever taken a class with. She pre records all of her content and reused all of it from 2017 when she first made them - even if they are inncurate! Every class with her is built exactly the same way, showing no creativity or effort. Rarely responds to emails, poor communication.",
        "Class is okay, material is very easy to get through and assignments arent too difficult. She isnt a very fair grader though. Myself and some of my group members didnt comment on other group projects at the end of the semester and she failed us on the entire project for it because she doesnt do partial credit.",
        "Not a hard class, but she's very unorganized. Case studies from the second week of class were not entered until last few days before grades were due. Hard to reach outside of classrooms. For her online class, she was always claiming that assignments and documents were open when they were not. Very unprofessional when answering email.",
        "No easier class on campus where you receive so much knowledge useful in the real world. Do not copy assignments from friends, you will get caught and get an F the case studies are so easy and Dionne is so chill but a little disorganized. She brings in awesome guest speakers and her MDIA370 (online) class is even easier. 1 big group project -- easy",
        "This class is basically the same as her 320 class: case studies, quizzes, online discussion forum, case papers, and a group project. Easy class if you do the readings & don't wait until Sunday night to do everything. If you just watch her lecture videos you can get by without reading the case studies.",
        "Easy online class if you do the readings (case studies) & stay on top of things. You usually have a quiz based on the readings & then a 1-page paper on them too. Only an 8-week course so the cases aren't too bad, but some can be long & a bit boring (the ones in 370 were more interesting to me). You have online discussion posts & a group project.",
        "1st yr teaching. Overall I liked the way the class was set up, really easy (average 95%). LOTS of case studies, guest assessments (people come in to talk about their experience in sales industry), & a group project/presentation (it was a big class too). I really like her I think the class will get better as she gets more experience. I recommend!"
    ],
    "tags": [
        "So many papers|Tough grader",
        "Lecture heavy|So many papers|Tough grader",
        "Tough grader",
        "Respected|Accessible outside class|Caring",
        "Gives good feedback|Respected|Inspirational",
        "Respected|Accessible outside class|Inspirational",
        "Respected|Participation matters|Caring",
        "Participation matters|Group projects|Caring",
        "Respected|Group projects|Clear grading criteria",
        "Graded by few things|Group projects|Amazing lectures",
        "Gives good feedback|Respected|Accessible outside class",
        "Group projects|Clear grading criteria|So many papers",
        "Group projects|Tough grader",
        "Group projects",
        "Gives good feedback|Respected|Group projects",
        "Get ready to read|SO MANY PAPERS|EXTRA CREDIT",
        "Get ready to read|Participation matters|SO MANY PAPERS",
        "Gives good feedback|Clear grading criteria|GROUP PROJECTS"
    ],
    "rating": 3.61,
    "initial": "Clifton, D",
    "name": "Dionne Clifton"
}