{
    "comments": [
        "Prof Cohen's lectures are extremely fascinating. He's incredibly knowledgeable in all aspects and tries to share as much wisdom as possible. If you reach out, he's always willing & happy to help. Interested in the course's content? Taking this course is a must. It is challenging but in a great way to help us grow as student and critical thinkers.",
        "Love psychology? Then take this course! Out of my four years in college, Ive never met a professor that was so good at teaching us how to think for ourselves! As long as you pay attention during his lectures and ask questions during lab, youll do fine! His lectures are super engaging and help with actually learning rather than memorizing!",
        "Professor Cohen conducts the worst lecture I have ever experienced. He does not use any lecture notes/slides, just talks AT you for 2 hours straight. His lectures make no sense and follow no guidelines. The exam questions are about specific examples he vaguely mentions in class. Thank god for the TA's during lab who try to teach us everything.",
        "He is so weird. His lecture make no sense and are incredibly unorganized. His tests come directly from his crazy lectures and he asks questions that have nothing to do with psychology at all. Even his TA's were confused about some of the test questions. Do not take him if you don't have to.",
        "This professor is respected by the department therefore, will probably never actually take any constructive feedback seriously. This professors teaching style is insulting. He does not speak clear or concisely. The midterm/final average this fall was between a 58-60 how is that okay? Tests are on lecture/reading which he RARELY explains during clas",
        "Great class. Super interesting. Would reccomend!",
        "There's 3 group projects in lab and 2 tests. The projects in lab are pretty easy and most of them are done in class, but the lectures are disorganized. He seems like he's very knowledgable on the subject but comes unprepared- he just talks the whole time. You basically have to try and write down every single thing he says. Tests are REALLYYY hard.",
        "He was never organized, never made clear points, and projected a 70% average on the first exam. Thanks for setting your students up for failure. Dude should be a philosophy professor or something but not a 4 credit lab course professsor. I don't even know what I learned in this class. Avoid him."
    ],
    "tags": [
        "Gives good feedback|Get ready to read|Inspirational",
        "Respected|Amazing lectures",
        "LECTURE HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Get ready to read|Skip class? You won't pass.|Tests are tough",
        "Gives good feedback|Skip class? You won't pass.|Hilarious",
        "Skip class? You won't pass.|GROUP PROJECTS|LECTURE HEAVY",
        "Tough Grader|BEWARE OF POP QUIZZES"
    ],
    "rating": 2.62,
    "initial": "Cohen, D",
    "name": "Dov Cohen"
}