{
    "comments": [
        "Fairly nice, but poor lecturer. Bad at explaining things. Goes too fast. Lecture material and homework is difficult. Thankfully, tests were rather easy. Somewhat reasonable. Odd sense of humor.",
        "His STAT410 is way much easier than I've expected. He has a good latex skill and makes super helpful slides. (Though I have to take 1pt off because of his lectures) Easy exams & homework (literally the same spirit.) If you are a good self-learner, definitely take his class.",
        "He decided to reschedule classes to evening despite normally meeting in the day. When addressed with the concern that people have conflicts, he made no effort to make the lecture content available anywhere else. He also gives attendance credit which students are missing just because they have a conflict they couldn't get out of in a week. Horrrible",
        "worse prof ever",
        "He seems very careless and nonchalant, to the point where the projector screen wasn't working the day before the exam and he decided we didn't have to cover that material and he would just answer questions instead. He also struggles to explain ANYthing, even the simplest of concepts, and went way out of logical order when teaching the class.",
        "Has a very \"I don't care\" attitude while lecturing. Weekly quizzes which seems a bit excessive. Material was difficult and he didn't take the time for everyone to grasp the difficult concepts. TA's were also useless and clueless",
        "Worst professor Ive met. He makes the tests so hard and yet is unable to explain the concepts properly. Its hard to pay attention in class as his voice is kinda soft and theres a lot of ummm in his sentences. There were some mistakes in his notes too. Youre better off just studying the textbook.",
        "Worst Professor Ever. There's never certainty in any of his lectures; expect a lot of \"umm... maybe... it looks like...\" so you naturally doubt anything that he says. Also, his answers to the students' questions are always vague so you may have been better off googling the answers. In fact, you'll be better off having google as your instructor.",
        "He makes STAT 420 the hardest and most useless statistic class I have ever taken. I am curious why he still cannot explain the content clearly even if he teaches the same class every year.",
        "He's bad at explaining things and the midterms were hard.",
        "Awful. 0/10. Would not recommend. Sounds boring when lecturing. Doesn't know how to explain difficult material to students. Terrible."
    ],
    "tags": [
        "Lots of homework",
        "Clear grading criteria|EXTRA CREDIT",
        "Clear grading criteria",
        "Get ready to read|Tough grader",
        "Test heavy|Tough grader",
        "Tough Grader|LOTS OF HOMEWORK|LECTURE HEAVY",
        "Get ready to read|TEST HEAVY|EXTRA CREDIT",
        "Get ready to read|TEST HEAVY|EXTRA CREDIT",
        "Tough Grader|Get ready to read|TEST HEAVY",
        "Tough Grader|TEST HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|LECTURE HEAVY"
    ],
    "rating": 1.36,
    "initial": "Culpepper, S",
    "name": "Steven Culpepper"
}