{
    "comments": [
        "Very disrespectful. Likes to cut students off while they are talking. Picky about using restroom in 2 hour class. Absolutely no phones aloud. Can go off track. Usually unclear of what is expected. Students tend to find her requirements and what she wants confusing.",
        "If you're sensitive to feedback, might not fit well, but her feedback and knowledge are good. Very unique personality. Can come off as abrupt and did ramble confusingly a few times in lecture. Had to get used to the style. Extremely interesting class, discussions, readings (lots), and topics. One of the most different & interesting classes I've had",
        "Please don't be swindled by the Disney tag. She means well and you will learn a lot of interesting stuff about Disney's darker past, but it basically ends there. Tedious and convoluted lectures every class. Doesn't value her students ideas unless they reflect her own, and will give you bad grades if your writing doesn't regurgitate her own opinions",
        "I expected a fun class analyzing films but had to watch many of them on our own time on top of all the readings which were long film reviews. Quizzes were specific and essays were graded hard. Rubrics were pages long and hard to follow. I had to form a study group to pass. She also held us late because she talks so much had a lot of tech problems.",
        "Professor Curry is very quirky and initially I found the class to be rather boring. However, after about a month I began to really like her and actually enjoy the class as well. She does give a lot of readings and is hard on grading papers, however there was 2% of extra credit. Definitely a caring professor who is respectful of all minorities."
    ],
    "tags": [
        "Tough Grader|Get ready to read|SO MANY PAPERS",
        "Get ready to read|LOTS OF HOMEWORK|EXTRA CREDIT",
        "Tough Grader|Get ready to read|LECTURE HEAVY",
        "Tough Grader|Get ready to read|EXTRA CREDIT",
        "Tough Grader|Get ready to read|EXTRA CREDIT"
    ],
    "rating": 2.4,
    "initial": "Curry, R",
    "name": "Ramona Curry"
}