{
    "comments": [
        "She is the best professor I meet in the university.",
        "Professor Curtis is one of the most unique and caring professors I have ever encountered. Yes, ACCY 302 covers managerial accounting, but, if you listen closely, Curtis discusses far more than just accounting. She always makes you laugh and brings a smile your face, even during the Pandemic! She is always accessible and more than happy to meet.",
        "Susan made accounting fun again! I never got any accy grades higher than B+, but she made it a fun class and I got an A-. She gives good tips, and genuinely cares about students. Highly recommend going to office hour and she will dedicate an entire hr helping you.",
        "Horrible. Make one mistake on the exams, you get the whole section wrong. The total online quizzes had a class average of 66%. She gives you only 15 minutes to answer 5 tricky questions, and you can't skip or go back. It's \"you know it, or you don't.\" Your best bet is to attend the TA discussions and form your own studying group!",
        "Curtis is disorganized. Forgets to show up to the first lecture of the semester because she is \"preparing for class\". Tricky pop quizzes and won't provide answers to homework questions. Quizzes should be given after we learn the material not before. Take somewhere else.",
        "Susan is definitely not the best professor if you didn't take accounting in high school. The textbooks are expensive and useless, the lecture notebook is probably the best thing to get even though it is optional. Be prepared to work, go to office hours, and study every day if you didn't take accounting in high school.",
        "She only teaches 20% of the time, but she does it really well. I did all the recommended practice problems, went to class, took notes, and did several practice exams before midterms and got an A+ in class. To do well in tests you have to understand accounting. This is where the practice problems and lectures helped me the most.",
        "feel really bad for this course",
        "Prof Curtis is such a nice and lively person but I just cannot learn from her. The class has minimal structure, there are literally no resources to use on your own except the notes you take in class. Textbook doesn't help at all because it doesn't demonstrate any of the math problems, which is like all she tests on. Tests don't match lecture at all",
        "Susan Curtis tells a lot of stories during lecture, which isn't  necessarily a bad thing, but it distracts from actually getting students to understand material. Online Mini-Tests are given, and you never know if you're getting questions wrong because you're completely wrong or because of calculator rounding errors. It doesn't show the right answer",
        "Very much a weed-out class. The professor allocates time poorly, often going off on tangents more appropriate for office hours than during a lecture where direct class material should be covered. Discussion sessions are the real chance to learn, and I am noticing the holes in my foundation while taking 202. Concepts are simple, delivery is weak."
    ],
    "tags": [
        "Gives good feedback|Respected|Inspirational",
        "Accessible outside class|Group projects|Caring",
        "Participation matters|Inspirational|Amazing lectures",
        "Tough Grader|Get ready to read|GRADED BY FEW THINGS",
        "Get ready to read|LOTS OF HOMEWORK",
        "Tough Grader|Skip class? You won't pass.|BEWARE OF POP QUIZZES",
        "Skip class? You won't pass.|TEST HEAVY|Would take again",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|Respected|Skip class? You won't pass.",
        "BEWARE OF POP QUIZZES|TEST HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY"
    ],
    "rating": 2.55,
    "initial": "Curtis, S",
    "name": "Susan Curtis"
}