{
    "comments": [
        "All of the really bad reviews from this semester are all from the same day on the day we got our final grades back. Just looks like someone is mad they didn't do well tbh. The class was hard but there were tons of examples in the lecture notes, but they are complicated problems so you have to spend a lot of time to understand them.",
        "-Dankowicz cons -His avg gpa is 2.57, avg for ME 340 is 3.41 -No solutions to quizzes, hws, or labs -No lectures, just in class worksheets -Picky grader -Entire class fails a quiz, he says ah yes this happens every semester, does nothing to fix it Dankowicz pros -Always available to degrade you -Office hours never crowded because no one likes him",
        "Worst Teacher that I have ever had. He is condescending and rude to his students. He says he cares about us yet gives very little feedback on everything that we do. Tests are so hard to complete. No partial credit on any of the regular tests. 5-10 minute online lectures over very complicated material and you only do worksheets during lecture time.",
        "Possibly the worst professor in the entirety of mechanical engineering at UIUC. Does not teach almost at all, and assessments are significantly more complex than homework. Avoid at all costs.",
        "Worst professor that I have ever had. Started this account just because he is so terrible. STAY AWAY FROM THIS GUY! He is demeaning, harsh, and gives as little of himself to the class as humanly possible. He doesn't care about the well-being of his students, and he certainly doesn't care if you learn the material. \"Teach? Pfft\" -H. Dankowicz",
        "This teacher has no desire to help his students succeed. Do not take this teacher. Its almost like he wants you to fail.",
        "This professor does not seem to care about his students. Do not take him unless you want to fail the class!",
        "A professor who knows a lot about the class, but chooses not to share any of his knowledge with students. Class uses partially completed notes with no clear explanations. Homework is extremely difficult, and has no solutions posted. Tests have no partial credit and are very hard. Dont take this professor if you value your mental health",
        "Class structure does not work online. Lectures are very uncomfortable discussions on Zoom (with silent breakout rooms). No solutions given to any homework, quiz, or lab. Students have to ask him to lecture, but Prof sometimes refuses.",
        "Worst professor I've had on campus",
        "Professor Dankowicz is a very easygoing guy, but expects you to work hard at the material. The homework assignments themselves are long and take a lot of time which turns a lot of people off from this class. Its really the nature of the material not the professor. If you work hard in his class you can learn a lot and get an A.",
        "That class was a nightmare. Professor does NOT explain material during lecture, instead he prefers to have students work on worksheets. You will have an in class quiz every two weeks which has around 7-9 multiple choice questions, which means no partial credit. Final was at a higher difficulty level than the quizzes. Avoid at all costs."
    ],
    "tags": [
        "Lots of homework|Get ready to read|Participation matters",
        "Lots of homework|Test heavy|Tough grader",
        "Skip class? You won't pass.|Tough grader",
        "Tough grader",
        "Lots of homework|Tough grader",
        "Tough grader",
        "Tough grader",
        "Lots of homework|Test heavy|Tough grader",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Tough Grader|Get ready to read|Skip class? You won't pass.",
        "Gives good feedback|LOTS OF HOMEWORK|Caring",
        "Skip class? You won't pass.|GRADED BY FEW THINGS"
    ],
    "rating": 1.5,
    "initial": "Dankowicz, H",
    "name": "Harry Dankowicz"
}