{
    "comments": [
        "An easy A if you do the homework, but I would highly recommend being proactive about everything for the first month or two of the course, otherwise the rest of the semester will not make sense.",
        "It was clear that Professor Davis worked hard to ensure a smooth semester for students given the unfavorable nature of an online semester. I definitely struggled at some points of this class because coding can get difficult. However Professor wrote clear lessons that helped me learned a lot. The HW can get hard but is helpful in the long run.",
        "Great professor! His online lectures are mostly text-based, so you won't see much of him, but the class is very well run. Labs are the highlight. TAs are great, and there is lots of help available. The CS dept really wants you to succeed and cares about your feedback. Easy A, and you'll learn a lot! I couldn't ask for a better intro to coding.",
        "Honestly, CS 101 is a very easy A if you just do the homework and work on the project. But python is taught very well in this class, and Davis does a good job teaching it. His blog posts on Campuswire are actually really informative and provide great takes on the content we learn. Labs are just okay, but they help you learn. Overall, I recommend!",
        "Truly special among profs",
        "CS101 is a very easy class so long as you keep up with the lessons and homework. Prof. Davis is very clear and makes programming easily understandable to beginners without overwhelming you. The course also has a lot of flexibility, so if you miss an assignment or lab you'll be totally fine.",
        "Class was an easy A. I remember going to office hours once and he was really nice and made sure to remember my name. However, his lectures were kind of pointless, but the participation points are a great portion of the grade. You don't have to do extremely well on all quizzes & you will still have an A. He constantly updated us through any decision",
        "I really liked him, and hes quite approachable and nice to talk to, really cares about his students",
        "A pretty good professor. As long as you do all the assignments you will almost certainly get an A. If you care about the class and put effort in, you can learn a lot from the class. Lectures can be kind of boring and it's so easy to not pay attention at all.",
        "Some labs and HWs are hard but since he drops a lot of assignments & the extra credit it's not hard to get an A once you put your effort in",
        "The class is pretty fair, there are a couple of drops for each category. Extra credit provided, and if quiz averages are low, he will release reflections so people can get some points back. Piazza can be helpful, lessons on relate are pretty good. Overall, great professor and dresses nice.",
        "Homework is nearly impossible. Having him for your first coding class ever is not advisable. He lectures to several hundreds of students and doesn't spend enough time on the basics. The tests, homeworks, and labs are all nearly impossible next to what is covered in lecture",
        "Professor is nice and the class is easy, the instructions are very clear and help is accessible. It is a great class to begin with if you have no prior experience with CS. That being said, if you have programmed a little bit before, there is very little to be learned in this class and your time would be better spend taking CS105 or CS125 instead.",
        "Professor Davis makes CS101 fun and the class is hilariously easy. This isn't a bad thing - if you try, you do well. The TAs and CAs in lab will help you through everything and the homeworks are largely solvable with ease if you work in a small group. Prof. Davis also drops a lot of stuff, so your worst grades won't matter. Lots of extra credit.",
        "Prof. Davis would sometimes give homeworks and tests that were way too hard for a 100-level class, (for example, one hw had an average of 61%, and one test average of 26%). However, he drops a couple homeworks/labs/tests so it isn't too hard to get a decent grade.",
        "Great professor. Would come to lecture just to see his outfit. Very clear. Very approachable.",
        "Knows his stuff. He listens to students, wants feedback on how the class is going. He gives good feedback. Lecture provided lots of info so attend, but slides are uploaded later. Labs and homework were kinda difficult towards the second half of the semester, make a friend in lab who's smarter than you and you should be fine.",
        "Has a deep understanding of programming. His class was very well structured. Each lecture was seemingly well-prepared with helpful examples, and slides were available for review. He's an approachable guy, but lectures were usually all business. His worst flaw is not realizing the low-level understanding of students in an intro course at times."
    ],
    "tags": [
        "Clear grading criteria",
        "Participation matters|Clear grading criteria",
        "Respected|Group projects|Lecture heavy",
        "Lots of homework|Group projects|Clear grading criteria",
        "Inspirational|Group projects|Caring",
        "Respected|Clear grading criteria|EXTRA CREDIT",
        "Respected|Lots of homework|Hilarious",
        "Gives good feedback|Respected|Caring",
        "EXTRA CREDIT",
        "Respected|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "Skip class? You won't pass.",
        "Gives good feedback|Respected|Clear grading criteria",
        "Gives good feedback|Clear grading criteria|Caring",
        "Skip class? You won't pass.|Clear grading criteria|Tests are tough",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Gives good feedback|EXTRA CREDIT|LECTURE HEAVY",
        "Skip class? You won't pass.|EXTRA CREDIT|LECTURE HEAVY"
    ],
    "rating": 4.39,
    "initial": "Davis, N",
    "name": "Neal Davis"
}