{
    "comments": [
        "This professor is semi-retired and should just fully retire. On multiple occasions, his TAs have graded down students for not answering questions completely despite never teaching what they were looking for in a complete answer. Not a lot of cohesiveness in course content either.",
        "Most of the course content is in the MOOC, and the live lecture session only repeat that material. He also spends the first 30 minutes of the live lecture discussing local weather, news, and the stock market. It would have been nice to have further discussion of the course topics instead of Illinois weather.",
        "Great real life examples and he connects the online students to campus",
        "Awesome course and great teaching skills.",
        "The class seemed like a disclaimer for Gies, so if graduates disregard laws, Gies can't take any blame. The message of the class could've been given in a single lecture, yet the coursework couldn't be done within a single month. I could tell even guest speakers knew the class was stupid.",
        "Good premise, but unnecessary class. Not necessarily the professor. I feel like I havent gained anything at all.",
        "Unnecessary course with unnecessary assignments...... Meant no disrespect for all instructors of this course.",
        "Not necessarily the professor, but BUS101 as a whole is a horrible class. They give way too many assignments and assume theyre the only class that matter when it is most likely the least important class youll have in your mind. The TAs are also told they cannot give higher than a certain average grade on each assignment, which punishes everyone.",
        "Business 101 is literally the worst class I have ever had to take IN MY ENTIRE LIFE. I can not stress enough how terrible the class was. The work load is so unnecessary the entire time. When you begin the capstone project at the end of the semester, you are forced to write 2 essays per week for 5 straight weeks - completely unnecessary. b101 sucks.",
        "I hated every single class I had to attend. EVERY SINGLE ONE. i also did not enjoy typing pointless papers every Thursday night. So glad I do not have to this anymore. Also, I have no idea how this class can be even considered useful. So funny that from now on it will be 3 credits, not 2. We did easy work, but for way more than 2 credits.",
        "Larry doesn't really do the majority of the teaching in this class. I'm only here to prepare the rising freshman who have to take this. This isn't a well run course, but you have to take it, so be prepared to type essay after essay. I wish we had a more engaging ethics course at UIUC.",
        "Lectures are mandatory and DeBrock always talks about the same things every lecture (there are guest speakers tho). But I loved my section leaders and they're very helpful with advice on classes, clubs, etc. You have to work for the Capstone group project but it's not hard because you can make things up and still do fine.",
        "Literally the most boring class. So rough that it's required. Just do the homework and make it though the lectures.",
        "One of the worst classes I've taken at UIUC. What a pathetic and insulting introduction to a great business school.",
        "Very boring, pointless class. The only thing I got out of it was how to build a professional looking resume. Treats transfer students like freshmen and the material is inapplicable in real world situations. Weekly papers, a HUGE group project. Really a waste of time but is now required for all Business students, not just freshmen but also transfers",
        "Most boring mandatory class COB's students need to take. The lecture is extremely boring. Grading depends on section leaders. So many homework. At first few weeks, one reading quiz and one paper for each week. After finishing the books, two papers for capstone team work, one for individual, one for group. Make sure you get your work done.",
        "The course is not that practical.  The grades in some way depend on the section you chose. Some of the section leaders are grading leniently but others are so harsh.",
        "One of the courses that I do not like the most!!! The knowledge in class is not practical. Grade is not as easy as people say so. The instructor is grading harsh."
    ],
    "tags": [
        "Lots of homework|Test heavy|Tough grader",
        "Test heavy|Tough grader",
        "Gives good feedback|Respected|Amazing lectures",
        "Gives good feedback|Amazing lectures|Caring",
        "Lots of homework",
        "Lots of homework|Skip class? You won't pass.|Group projects",
        "Lots of homework",
        "Tough Grader|Participation matters|LOTS OF HOMEWORK",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|SO MANY PAPERS",
        "Skip class? You won't pass.|SO MANY PAPERS|EXTRA CREDIT",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|Tests? Not many",
        "Clear grading criteria|EXTRA CREDIT|GROUP PROJECTS",
        "Skip class? You won't pass.|SO MANY PAPERS|GROUP PROJECTS",
        "Tough Grader|SO MANY PAPERS|GROUP PROJECTS",
        "Skip class? You won't pass.|Clear grading criteria|GROUP PROJECTS",
        "Tough Grader|Get ready to read|LOTS OF HOMEWORK",
        "Tough Grader|Get ready to read|EXTRA CREDIT",
        "LOTS OF HOMEWORK|EXTRA CREDIT|GROUP PROJECTS"
    ],
    "rating": 1.89,
    "initial": "DeBrock, L",
    "name": "Lawrence DeBrock"
}