{
    "comments": [
        "This man is so amazing.... I don't think I'll ever have a professor this great for the rest of my college career. He clearly cares about helping his students out and gives credit where credit is due. His demonstrations are super fun and also really educational. Awesome guy all around.",
        "I had Dr. DeCoste for CHEM 202/204 this year, and he is the most inspirational teacher I've had. Without AP Chem, I started out behind but caught up. Go to his office hours! He genuinely cares and wants to help. He's an amazing person, and teaches problem solving rather than memorization. I've never learned as much in a year as I did in his class.",
        "He is just beyond description, no words for complement in my mind could come up cuz they are not that enough to depict how amazing he is",
        "9000/10 the absolute best professor that I've ever had in my life. Ever. I had him for CHEM 202 and CHEM 204. Although it may seem like you shouldn't have taken the class if/when you don't get great grades, DeCoste challenges you to think in ways no other class you ever take will which will benefit you more than you think later on in life.",
        "Don Decoste is an absolute legend. If I could give more than five stars, I would. Thats not to say this is an easy class. Its very hard, but thats because he believes in the value of teaching skills like problem solving instead of memorizing random facts. Lectures are always engaging, informative, and very entertaining. 10/10 would take again!",
        "Go to his office hours so he knows your name. He really wants to help people. Don't worry about looking stupid or anything. His class is hard and the grades reflect that but the final is a lot easier than all of the unit tests so take that into account before dropping",
        "Dr. DeCoste explains everything so well and clearly. There is a great amount of work for this class, but if you know to how study smart and hard, you can succeed. Lectures aren't mandatory, but they're totally worth going to. Don't just read the textbook and watch the videos as if you have to, make sure you understand the material thoroughly.",
        "He's a very good lecturer. The tests are kind of hard but he curves the hell out of them, so it's fine",
        "Amazing lectures!! He really knows what he's talking about. He's funny at times and really makes sure we're understanding the material.",
        "I love him.",
        "Go to office hours, do all the homework provided and the practice tests. The grade is based primarily on exams, which test your ability to solve a lot of difficult problems relatively quickly. Knowing Decoste's methods help, and he works through problems during office hours. Take notes during lecture as he goes over problems he expects you to know.",
        "Dr. DeCoste is fine. Everyone makes him out to be some sort of chemistry education guru, but he is mediocre in my opinion. He's much much better than many other professors, but that is because of how bad all the other chemistry professors are not because of how good he is.",
        "Dr. DeCoste is a great professor and he gives clear lectures. Tests are not so hard and he curves a lot so the average should be around 85 or so. He is patient on answering students' questions during office hours and he really makes his student learn a lot from his instruction.",
        "Great explanations in class. Lots of material to go through, but he still takes the time to answer student questions and do demos at the end of most lectures. He has a dad's sense of humor (go figure) and genuinely cares about his students as if they were his own kids. Great professor to have, real pleasure to be in his class. Watch the videos!",
        "Prof. DeCoste is amazing, he clearly knows what hes doing and always willing to help. GO TO OFFICE HOURS!! Do not fall behind in this class. If you do, say goodbye to your GPA. This class is accelerated for a reason and it helps to know your stuff before hand. He is funny and understanding. Go to lecture, if anything, he blows stuff up.",
        "A fantastic professor. Good at speaking. So great.",
        "Lots of amazing experiments in lectures, but the lectures are not so organized. Office hours are super helpful. Tests are easy if you did all the homework and understood how to apply the concepts.",
        "DeCoste prepares his students for challenging material and critical thinking; he deserves his role as an education specialist. He is a perfect example of firm yet fair; his tests are challenging and make you relate concepts in nearly every way possible. At the same time, he is very caring and approachable. He's an outstanding undergrad instructor.",
        "Decoste is a great professor and super helpful in office hours. Pay attention in class and learn to use his methods, because that's the only way you'll survive his tests. He can speak quickly sometimes, but don't be afraid to ask questions because he's really nice.",
        "One of the best professors in the department. Read the textbook and study the challenge problems he assigns because those are similar to the level of difficulty as his test. Online quizzes are hard so work together with friends on them.",
        "Amazing professor that specializes in educational research!",
        "Decoste is a really great professor! He does fun experiments & cares for his students, so if you're struggling, talk to him. However, I wouldn't recommend taking this unless you have a solid chem background.  I had taken chem my sophomore year of hs and it's not enough for you to pass this class. If you're a ChemE, try the other sequence of classes",
        "Fun teacher but very hard  course without AP Chem.",
        "Dr. Decoste is a great guy that's willing to help whenever you need it! In the beginning, don't take that for granted! His tests are very conceptual consisting of FRQs and multiple choice. THIS IS NOT A MEMORIZING CLASS! be prepared to read, seek help, and go to office hours. Decoste is a great lecturer and answers all questions in class.",
        "This man is one of the greatest professors I have come across in my time at UIUC. It is evident that he cares enormously about his students, and wants the best for them. However, his class is tough as hell. You will not succeed if you are not willing to work for it. Being Decoste's student was worth every tear shed during the semester.",
        "Dr. DeCoste tries to keep the class interested by his practical examples. He literally blows the class up. He is really interested with the class and he loves his students. GO TO HIS OFFICE HOURS. It is like a free private lesson if you're lucky. Plan to go early because it tends to be full. Nonetheless, his exams are not easy, but still doable.",
        "He cares more about blowing up oxygen filled coke bottles and scaring you, than actually teaching you Chemistry. It's all self-taught. Most of my dissucsion class walked away with a D.",
        "Don is such a great professor!  You can tell how much he genuinely cares that his students are learning, and he is very enthusiastic about teaching.  He answers questions well and is always very organized.  However, exams are painfully difficult.  You need to study a lot to do well."
    ],
    "tags": [
        "Hilarious|Amazing lectures|Caring",
        "Accessible outside class|Inspirational|Amazing lectures",
        "Accessible outside class|Inspirational|Amazing lectures",
        "Accessible outside class|Inspirational|Amazing lectures",
        "Respected|Inspirational|Amazing lectures",
        "Tough Grader|Respected|ACCESSIBLE OUTSIDE CLASS",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Inspirational|Amazing lectures",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Gives good feedback|Respected|Inspirational",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Tests are tough",
        "Tough Grader|Respected|TEST HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Would take again",
        "Respected|Skip class? You won't pass.|Caring",
        "Gives good feedback|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Tough Grader|Respected|Hilarious",
        "Tough Grader|LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Amazing lectures|LECTURE HEAVY|ACCESSIBLE OUTSIDE CLASS",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "ACCESSIBLE OUTSIDE CLASS|TEST HEAVY|Amazing lectures",
        "Tough Grader|Respected|Caring",
        "Tough Grader|LOTS OF HOMEWORK|Hilarious",
        "Tough Grader|Respected|TEST HEAVY",
        "Respected|LOTS OF HOMEWORK|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Caring",
        "Tough Grader|TEST HEAVY",
        "Tough Grader|TEST HEAVY|Amazing lectures"
    ],
    "rating": 4.54,
    "initial": "Decoste, D",
    "name": "Don Decoste"
}