{
    "comments": [
        "Took this class FA20. Lectures were partially written, partially recorded, and concepts aren't too tricky, even as someone who has never taken an Econ course before. Discussions are helpful. Not mandatory, but I would still recommend as it's nice to ask questions/clarify some things. Overall a solid class.",
        "I took this SP21 online. Discussion is only for your benefit and you don't have to attend. All you have to do is read the weekly material and take the homeworks and quizzes. He seems to really love the material. You don't really have to have a good understanding of the material to do it. There are 3 exams and a final. None are proctored.",
        "He was a good professor. His lectures were all slides on Compass, but he explained the purpose and concepts in well detail and if you didn't understand, you could pop into office hours and he would explain it until you understood. He also offers extra credit opportunities here and there, including a syllabus quiz at the beginning of the semester.",
        "Easiest class I've ever taken. Probably could have finished the entire class in a day. Still, lectures were interesting and material was laid out well. Grading policies were very fair. Never showed up for discussion and still got A+ on all the midterms.",
        "This is my third time taking Isaac, but my first time taking him for an in-person. We had biweekly papers, seven in total. Not many people showed up to class but I found the lectures really interesting. He seemed really interested in what he was teaching and spent a good amount of time explaining underappreciated parts of American Economic History.",
        "Lectures are written out and you read the content each week. Not many communications from the professor other than the lecture intro videos. Discussion is optional.",
        "I had prof. dilanni for Econ 102 and 302 and he made both classes interesting and engaging without being too difficult and adapted the class well to the virtual environment.",
        "Three midterms and one final- plus weekly homework that was like six multiple-choice questions, as well as a ton of modules that had quizzes. I believe I did the weekly homework and the midterms, as well as the final which replaced all of the grades for the module based quizzes. Not much studying is necessary with a background in economics.",
        "Amazing",
        "His online course was very well structured and easy to follow. Granted it was an introductory course, it was still a smooth experience.",
        "DiIanni teaches this class so well. Econ is a breeze with him. He has his own typed up chapters to take notes from which are very clear and great for explaining the concepts. Each chapter has a HW & quiz that allow multiple attempts. 70% of grade is exams but they're not bad and give you more than enough time. A very caring and passionate prof!",
        "You can easily tell that this professor is passionate about what he is teaching. His lectures are easy to follow and he gives plenty of good analogies to help you understand difficult concepts. He is very fair in the types of questions he asks in homework and quizzes. I would definitely take a class with him again in the future!",
        "- Compared to Vasquez, yes, Diianni's class is much harder, but actually learning the content in ECON102 makes other classes much easier (good fundamentals) - BUY THE CUSTOM TEXTBOOK. Easily the best investment I have made in college, with tests from previous semesters (many repeated questions) and step-by-step solutions to walk through problems",
        "Diianni was an amazing professor for ECON102. His custom workbook was super helpful in preparing for his exams. Attendance isn't mandatory, but going to class made studying so much easier. He explains everything clearly and provides so many examples. I learned a lot and I definitely recommend taking his class!",
        "Prof. DiIanni teaches really well. He is prepared for each lecture, and he can explain clearly. Textbook is not really required, as no readings will be tested. But some discussion readings will be quizzed, and they're unrelated to lecture materials! Three midterms, not too hard, if you study for practice problems in the workbook. Buy the workbook!",
        "Amazing lecturer! One of the best profs at UIUC. He is so knowledgable and passionate about econ. Definitely buy the workbook, it's an absolute lifesaver! Tests are straightforward. You must go to every single lecture and pay attention to understand the material. Discussion sessions are useful. Don't miss the online quizzes!",
        "Best professor ever, he has some humor as well, the workbook helped a great deal. I wasn't that good at his class but it was interesting, I learned a lot and I would take it again!",
        "He is a great professor and is amazing at teaching econ. He is willing to help his students if they are struggling. Going to lecture and paying attention is #1 priority. Go to lecture, pay attention, write down definitions given, and get an easy A/B",
        "Prof. DiIanni is one of my favorite professors on this campus! I had him for 102 and then chose to take him again for 302. He's really great at explaining and is very approachable. You can tell he has a passion for teaching and economics. I wish I could take more classes with him!!",
        "Isaac is a great professor, I really enjoyed his lectures! Really cool guy go to office hours and I recommend getting the workbook for his class, super helpful!",
        "Amazing professor. Lectures clearly explain important concepts. Exams are very straight forward and based on completely on content reviewed in lectures or through online quizzes. Skip Vasquez and take Dilanni if you're a business major and actually need an adequate foundation in econ for upper-level classes.",
        "Dilanni is a great econ professor. Attendance was not mandatory for lectures but, you will not understand the material in discussions or during exams if you don't go. The optional workbook is an absolute lifesaver and definitely worth the money. The workbook has three practice exams for each test and are very similar to the ones he'll give you.",
        "DiIanni is awesome. He makes the material very easy to understand and provides tons of examples. As long as you attend lectures and do the practice problems, you'll be fine. I have heard for this class, though, Vazquez is much much easier but DiIanni is a better teacher. I would definitely take this class with him again.",
        "Easy class! Exams are simple if you retake the practice quizzes and buy the optional workbook (almost all the test questions come from these two sources). DiIanni is very knowledgeable and truly cares about whether his students understand the material or not. Lectures are interesting and his real-world examples help so much.",
        "Best Economics professor I've ever had. He explains concepts in such a crystal-clear way and is fun to talk to outside of class is well! The exams are tough but the quizzes are super easy (answers are online). 10/10 would take again.",
        "A wonderful person and even better professor. This class was so enjoyable not only because of the material, but the way in which it was delivered. You really can't go wrong with DiIanni.",
        "Best dressed professor on campus. Very relevant material, even though he's often outspoken. Very calm and well-prepared. Knows how to deal with a lot of nonsense.",
        "He's just awesome and very inspirational. Highly recommended if you want to learn.",
        "Econ-302 with him is neither the hardest nor the easiest class that I have taken. Professor Dianni is an excellent teacher and he is very knowledgeable about economic issues. He is also very approachable to students, but he has very strong opinions on economic issues, opinions with which some students might disagree.",
        "Very approachable. Gives a different insight into economic thinking than most professors offer. Challenges and expands your own thinking.",
        "Diianni is a great professor and clearly a great guy. He knows so much about the world of Economics and is great at giving real life examples to explain the material taught in class. The class, however, is quite difficult. The exams are similar to the previous exams, but a few questions tripped me up. The final exam my semester was extremely hard.",
        "ECON 102 was fairly easy, if you buy the workbook and do the old exams then the actual ones are very similar. You can tell that DiIanni is very passionate about the subject, however lectures could get a little boring. Basically as long as you do the work book then you should get an A, don't bother getting the actual textbook",
        "There's 3 midterms and a final. DiIanni is super chill, so you can skip any (or all) of the midterms, and the weight of that exam will be put on your final. He also gives past exams and how to do math problems in his workbook, so you don't really need to go to class (but graphs aren't provided). He offers a good amount of extra credit too!",
        "I thought his lectures drug on and on. While he certainly is brilliant, he has a tendency to over-explain simple topics to the point of confusing. The flip-side is that he loves to help students during office hours. A little pompous, but overall a good guy. Avoid him at the sub-400 level; take him for 400-level courses. He's much better there.",
        "Professor DiIanni is a gifted lecturer and knowledgeable on many economic topics. He explains concepts and answers questions clearly and effectively. ECON 102 is a breeze so long as you review the previous years' exam solutions, which are readily available in your course packet. His impeccable wardrobe is also a plus.",
        "Great professor lots of freedom of attendance, exams, quizzes, and discussions. Not boring at all so focusing won't be a problem. Should pass the class with an A or B anything less is just piss poor effort.",
        "Spends a bit of time debunking liberal myths ('There are more poor people in US than in Europe', 'labor unions are good' etc.). One point extra credit for taking a survey or something. Honestly most of it is just simple math, some intuition and definitions. You can skip midterms and get the weight shifted (beware). Use the workbook and pract. exams",
        "Great professor! Great lecturer! Make you interested in Econ!",
        "Have a lot of respect for this guy.  The class is't bad.  He provides a workbook which has everything you need to know and practice exams.  Its not a complete easy A, but if you do the workbook, you will be set.  Lectures are pretty important but he posts his power points online too.  Discussions don't matter- only good for extra points.",
        "Lectures can drag on some lessons, but does his best to make Economics interesting. You should still attend lecture even though they aren't mandatory and no iClickers. His optional workbook should be mandatory. Overall, the class is not difficult and becomes exceptionally easy when you use the workbook to study. Would recommend this class.",
        "He is really awesome lecturer. I hated economics before I took his class, but he just explains it so well that I plan to take more economics classes. He is really cool, great great lecturer. Exams are not at all difficult if you go to class and take notes. Take him instead of Vasquez if you truly want to learn economics."
    ],
    "tags": [
        "Clear grading criteria",
        "Get ready to read",
        "Respected|Clear grading criteria|Lecture heavy",
        "Respected|Get ready to read|Clear grading criteria",
        "Respected|Amazing lectures|So many papers",
        "Lots of homework|Get ready to read|Test heavy",
        "Gives good feedback",
        "Accessible outside class|Graded by few things|Caring",
        "Respected|Get ready to read|Caring",
        "Accessible outside class|Clear grading criteria",
        "Accessible outside class|Test heavy|Caring",
        "Respected|Inspirational|Amazing lectures",
        "Respected|Skip class? You won't pass.|Test heavy",
        "Skip class? You won't pass.|Test heavy|Amazing lectures",
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "Respected|Inspirational|Clear grading criteria",
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "Respected|Graded by few things|Caring",
        "Test heavy|Clear grading criteria",
        "Respected|Clear grading criteria|Amazing lectures",
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "Inspirational|Amazing lectures|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Amazing lectures",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Respected|Inspirational|EXTRA CREDIT",
        "Respected|Clear grading criteria|Caring",
        "Respected|Inspirational|Would take again",
        "Participation matters|Inspirational|TEST HEAVY",
        "Skip class? You won't pass.|Clear grading criteria|Gives good feedback",
        "TEST HEAVY|GRADED BY FEW THINGS|LECTURE HEAVY",
        "Clear grading criteria|TEST HEAVY|GRADED BY FEW THINGS",
        "Respected|Inspirational|Caring",
        "Skip class? You won't pass.|GRADED BY FEW THINGS|LECTURE HEAVY",
        "Respected|Clear grading criteria|LECTURE HEAVY",
        "Respected|Clear grading criteria|Amazing lectures",
        "Respected|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Gives good feedback|Respected|LECTURE HEAVY",
        "Respected|Clear grading criteria|LECTURE HEAVY",
        "Respected|Clear grading criteria|LECTURE HEAVY",
        "Participation matters|Skip class? You won't pass.|Amazing lectures"
    ],
    "rating": 4.73,
    "initial": "Dilanni, I",
    "name": "Isaac Dilanni"
}