{
    "comments": [
        "Took this past semester in the pandemic and she wasn't very lenient or understanding. Lectures are long, repetitive, messy, and she rambles a lot. Assignments are super vague yet graded meticulously. You won't know your grade the whole semester :) Nice and knowledgeable person, terrible professor.",
        "Took this class this past fall amidst the pandemic and she wasn't very lenient or understanding. Her lectures are long, repetitive, and she often rambles. The assignments are super vague, yet she grades very meticulously. Slides are a mess and your overall grade will be a mystery the whole semester. A very knowledgeable person but a bad professor.",
        "She will not clarify. She gives vague assignments and grades on stuff she never really asked for in the first place. Someone asked how we can find out our course grade before the final paper was due and she essentially told them \"what does it matter just do good on the final...\" she is knowledgeable and cheery but not a very good professor.",
        "Shes tough and if you dont go to lecture you will fail. Midterms and exams are based on class lectures so take notes. If you dont follow the directions on the papers and tests your grade will suffer. Good luck youll need it",
        "Having never taken Anthropology before, I knew I would most likely have to work a little harder than others. That being said, I worked incredibly hard to read the books, participate and still couldn't catch a break. The lectures are rambles and the papers are graded way too hard for a 200. Though content was interesting, the class was awful!",
        "Repetitive lectures",
        "VD is... interesting. As a human being, she's perfectly fun and natural and talking to her is always enjoyable! However, as others have noted below, she is a little over-eager for a 200 level course, and the workload is a little inappropriate.  The reading is fascinating, and she certainly makes you think, but there are better courses for that."
    ],
    "tags": [
        "Graded by few things|Lecture heavy|Tough grader",
        "Graded by few things|Lecture heavy|Tough grader",
        "Lots of homework|Lecture heavy|So many papers",
        "Tough Grader|Get ready to read|Skip class? You won't pass.",
        "Tough Grader|Get ready to read|SO MANY PAPERS",
        "Get ready to read",
        "Get ready to read|SO MANY PAPERS|GRADED BY FEW THINGS"
    ],
    "rating": 1.29,
    "initial": "Dominguez, V",
    "name": "Virginia Dominguez"
}