{
    "comments": [
        "Prof Dunfield was an amazing professor who taught the class really well. He really liked the concepts and had amazing drawing skills that are not to be messed with. The lectures were kind of awkward because he'd ask questions and wait for someone to answer and no one ever wanted to answer, so don't be afraid to talk. Office hours were very helpful",
        "Super nice and patient professor willing to explain everything until you understand. Hold several office hours per week, and willing to extend office hour when students' problems are not solved.",
        "Amazing lecturer. His lectures motivated me to get up at 8am.",
        "Great lectuer, though he goes a little fast sometimes. He really knows his stuff too, and is great to ask for help. Easily the best professor Ive had here so far",
        "Professor Dunfield is the best math teacher I've ever had in my life. His office hours are very useful and he takes the time to ensure that you understand the topic if you seek the help.",
        "Amazing professor. So many resources (online lecture notes that he hand-wrote, worksheets and exam solutions, course diary, practice exams, pdf of your graded exam, office hours, etc etc) that can help you achieve the grade you want. Also, I really enjoyed his subtle humor.",
        "Worksheets are harder than tests, but they are very good tool for me to get a big picture of new concepts. Practice exams are much like the real ones. The course is not easy, but u'll feel much easier if your professor is Nathan. The grading is fair. The overall grade will be curved. So dont worry. PS: Hes in suits every day! Like his beard : D",
        "Calc 3 isn't the easiest class but Dunfield is exceptional at teaching its many concepts. The lectures are very informative and easy to understand, and exams themselves are very fair, and you get adequate preparation with many practice exams. Additionally, they are graded very fairly and quickly, and you get to see exactly where you went wrong.",
        "Sometimes I think he is so talented and nice that he should teach sth much beyond Calc 3. If you can please take his class. He explains everything in lectures and hes very approachable outside class. He is patient and ready to every question. Hes also excellent at drawing 3D pictures to help you understand the geometry in calculus.",
        "Nathan Dunfield is amazing.",
        "Prof. Dunfield is by far one of the most talented professors I have had so far. He makes a effort to connect with students, especially in a large class like MATH 241. For example, I went to  his office hours once and he remembered my name. Additionally, his lectures are phenomenally clear and handles in class questions exceptionally well.",
        "Dunfield is one of the smartest people I have ever met in my entire life. He is an amazing lecture and while he lectures quickly, they are clear (he is amazing at drawing the 3D shapes). His tests are very difficult, but the practice exams are great prep. I am not great at math but I managed to get through.",
        "Professor Dunfield has very clear lectures and is always ready to answer any questions in a succinct manner. All of his drawings are incredible and make learning the concepts much more straightforward. Office hours can be quite helpful and he makes the effort to know you by name if you stop by and ask questions. Take this professor!!!!!",
        "He's so sweet! I took calc 3 as dual credit, didn't do so well, took it here with Nathan and he's a million times better than my prior instructor. Really helpful discussion worksheets and sends you a PDF of your exams so you can see your mistakes and how you are doing in calc 3.",
        "An awesome professor who is always enthuastic in the lecture. The lectures are instructed clearly and organized well . He's extremely helpful and accessible to students. The notes are really helpful.",
        "Very good prof, clear and insightful. one of the best ive had during my time at Uni",
        "Perfect sketching just make 3-D much easier"
    ],
    "tags": [
        "Accessible outside class|Hilarious|Amazing lectures",
        "Respected|Accessible outside class|Caring",
        "Respected|Accessible outside class|Inspirational",
        "Gives good feedback|Amazing lectures|LECTURE HEAVY",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Gives good feedback|Respected|Inspirational",
        "Clear grading criteria|Hilarious|Amazing lectures",
        "Respected|Clear grading criteria|Amazing lectures",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Respected|Inspirational|Amazing lectures",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Respected|Inspirational|Amazing lectures",
        "Respected|LOTS OF HOMEWORK|Clear grading criteria",
        "Inspirational|Clear grading criteria|Amazing lectures"
    ],
    "rating": 5.0,
    "initial": "Dunfield, N",
    "name": "Nathan Dunfield"
}