{
    "comments": [
        "Guy is interesting and knows what hes talking about. Class gets bogged down by requiring perusall though",
        "I love Prof Dunne, he is so sweet and genuinely loves teaching. I assume this class would be better in person, but online there are about 60 p of reading a week with required annotations. Lectures also take about 2 hours total. However, learned a lot and loved the class. As long as you take notes on the reading and lectures you'll do well.",
        "Clearly very passionate about astronomy and it rubs off. If you go through the readings and PowerPoint slides in the online lectures, you'll be fine. Clear study guides that really make tests much easier, and he doesn't use the camera for Proctorio which is so nice, we even get open notes. Sometimes long readings but the book isn't a challenge",
        "Great and interesting lectures, and as long as you read over the PowerPoint slides, you are sorted. His lectures and slides are very helpful for the homework and tests, and he gives you lots of extra credits in this class. Exams aren't difficult and he allows you an 8.5 by 11 piece of paper for cheat sheets on exams. Easy A+",
        "Dunne is very funny and chill. Quizzes are all online and you get to use one sheet of paper (front and back) on exams. He only assigns a few homework problems that can be tricky but can be figured out. There are observation sessions that you have to go to but those are easy points. Discussion sections is just working in groups on an assignment.",
        "I took Stars and Galaxies with Dunne and it was absolutely amazing. An easy A as long as you show up and do your work. I never once looked at the textbook. Dunne is great and if you have him for a discussion section youre guaranteed to get an A.",
        "Great lecturer, make funny jokes during the lectures. Although somtimes do not show up timely on his office hour, but still patiently explains everything. Homework usually takes more than 4 hours a week if you want extra credit.",
        "He is such a great professor, he is very passionate about astronomy and he always makes lectures interesting and makes the content easier to understand! He has great jokes! He is a great professor overall.",
        "He's such a dad, lots of dad jokes. He is VERY excited about the stuff he's teaching and does a good job of teaching it, he's very energetic and knowledgeable. it's pretty clear that he loves his job. He does give a few out of class activities and one off-campus that you have to attend.",
        "Very easy class and Prof. Dunne is a good lecturer who is passionate about what he teaches. If you are interested in astronomy, then you will simply love him, but for me, I found the lectures quite boring since it is not my forte. The classwork for ASTRO 150 is very easy and consists of simple writing for article summaries and packback.",
        "he good :)",
        "Professor Dunne is so nice & tries really hard to make lectures fun! 10/10 stand up guy",
        "This class was interesting. However, if you're not a math/ science person like me, you should probably find another Nat Sci & Quant. II class. Unless you plan weeks ahead, professor is ALWAYS busy. My TA is Cail Daley and he's the type of guy who know a lot but not how to explain. THE EXAMS ARE REALLY HARD even w/ a cheat sheet. Good luck :(",
        "He's such an awesome teacher even if you're interested or not about astronomy you should definitely take his class it's not hard and very easy to get an A+. There needs to be more teachers like Professor Dunne that are very passionate about what they are teaching about!",
        "he is amazing!! if you attend the lectures and pay attention, you are sorted.",
        "Lots of homework but they were spread out over the entire semester and were fairly easy so long as you show up and read the articles assigned.  There is no $100+ textbook to buy and the course material is fascinating.  Powerpoint presentations and NO TA section which is EXCELLENT.  Significant extra credit opportunity and lowest homework is dropped",
        "Tests were so hard for a 100 level class-even with a cheat sheet. The homework was so long and boring. Do not take!! :(",
        "Took ASTR 150 as a non-astro major, really enjoyed it! First project was a little math-heavy for my taste but Prof. Dunne is extremely approachable and up for adapting to students' needs, so definitely chat with him if you have any questions or concerns! Lectures are awesome; he's a lot of fun to listen to. Two thumbs up.",
        "He's very knowledgeable on the topics discussed and explains them well - doesn't just read off his power points. If you ask him a question, he almost always knows the answer off the top of his head. BONUS: HE LEAVES HIS SLIDES UP LONG ENOUGH FOR YOU TO TAKE NOTES AND NOT RUSH!!  Tests aren't easy but aren't impossible, and he allows a \"cheat sheet\""
    ],
    "tags": [
        "Lots of homework|Get ready to read|Lecture heavy",
        "Get ready to read|Test heavy|Caring",
        "Accessible outside class|Get ready to read|Amazing lectures",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Hilarious|Lecture heavy|Caring",
        "Gives good feedback|Clear grading criteria|Caring",
        "Gives good feedback|Lots of homework|EXTRA CREDIT",
        "Inspirational|Hilarious|Caring",
        "Hilarious|Amazing lectures|Caring",
        "Respected|Participation matters|Inspirational",
        "Respected|Hilarious|Amazing lectures",
        "Inspirational|Hilarious|Amazing lectures",
        "Skip class? You won't pass.|Test heavy|Lecture heavy",
        "Participation matters|Amazing lectures|Caring",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|Hilarious",
        "LOTS OF HOMEWORK|Amazing lectures|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Hilarious|Amazing lectures|Caring",
        "Amazing lectures"
    ],
    "rating": 4.32,
    "initial": "Dunne, B",
    "name": "Bryan Dunne"
}