{
    "comments": [
        "Live lectures were rough, with Icliker questions and his consistent Futurama and Simpsons references, but I very thankful for the lecture videos he provided that were easier to break down the content. Exams are pretty long but you get any equations you need. Helpful professor, but the TAs would often just drone over a powerpoint.",
        "Genuinely the worst class I have ever taken during my time at UIUC. Professor Dyer simply cannot teach. Unsure why he is a senior lecturer of finance when he just simply is unable to teach. Plain and simple. He forces you to read the textbook (which is hours on hours a week) and literally teaches nothing in lecture. Worst professor on this campus.",
        "Avoid this professor if possible. Heavy quantities of reading and videos are assigned every, but content in lectures and homework continue to not be mentioned at all before being introduced to students. Emails are answered lazily as well.",
        "Fin 221 isn't an easy class and Prof Dyer just makes it worse. It's difficult to understand what he says in his lectures since he mixes sentences together and doesn't really explain why he's doing something. He makes mistakes during his lectures which makes them even more confusing. Wouldn't recommend taking his class.",
        "So much homework and lecture and reading and there will still be things on the tests that you haven't heard of",
        "Dyer was easily my worst professor this semester. His lectures are not helpful, and you end up having to teach yourself a lot of the material. The excel projects are long and graded harshly. I was 2 points away from a B, and he refused to round my grade up.",
        "Lectures are not useful. Have to learn everything on your own.",
        "Dyer's 221 class is very content heavy. I wouldn't say that he's the best at teaching the information, but between his lectures and some hefty studying of the material on your own, you will do well in his class.",
        "The quizzes are extremely hard. You can take detailed notes on every chapter and still miss out on a few questions. They're an hour long, so 2 minutes per question, and there's a lot of reading involved for many of the problems too, so that just adds to the stress. The material itself isn't that bad, it's just the time constraints that really hurt.",
        "Love Dyer. Not very great at teaching but he's hilarious in class. He is very reasonable with his tests and makes sure that they are very similar to the practice tests. He is also super understanding with curves and curved the class multiple times when people did worse than expected.",
        "The class was outlined at the beginning as to what was expected. Dyer provided videos before each week which clarified everything that he went over in lecture. A lot of this class is teaching yourself outside of class so find a group of friends and it's an easy A.",
        "Some tips to be successful in this course: 1. Using Chegg while doing your homework 2. Make sure you understand the exam of previous semesters 3. Just ignore the professor and learn by yourself, it will be easy if you follow his lecture videos online 4. This course is not very tough as long as you are smart.",
        "Nice guy but terrible professor. His lectures are often just him repeating what is covered in his online pre-lectures videos. The online homework is just awful because it doesn't take the best score and the problems often ask about things that aren't covered in class. Tests are very difficult and you will probably need to teach yourself everything.",
        "BAD PROFESSOR.... TEST DIFFICULTY VARIES A LOT EACH SEMESTER",
        "This class is SO hard. Do not take it on campus if you are not going to be a finance major. We have pre-lecture videos that Dyer makes and they ultimately never make sense as someone who has never taken a finance class before. Exams arent curved and are decently difficult. UIUC needs to re-evaluate having this as a business core requirement.",
        "I think the biggest problem is that the professor does not pace the course very well. The first few weeks classes were canceled a lot and we have 50 or 0min lecture+50min discussion per week and we only went through 1-2 chapters, but still we had a major test and a group project. Now we'r going 2 chapters a week. I hope he could balance it out.",
        "Dyer is a genuinely nice person, but not an effective teacher. You will see when doing the homework how much he leaves out of lecture. And because the homework doesn't take the highest attempt, grades suffer. Much of the material is self-taught from the textbook, and the general consensus is that the TA's for this course are consistently unhelpful.",
        "His homework is a freaking nightmare. You will lose points easily, and once you lose points, you will never have the chance to get full score in your homework. The home work counts on average, and it is really time consuming. The class is useless, and the professor is hilarious.",
        "Dyer as a professor is fine. His tests and assignments are straightforward, though you don't learn much in lecture. The pre-flight videos and previous exams are the way to learn in this class. He's a very nice guy though. You can get an A as long as you do those things, though I didn't learn how to study until after the first exam.",
        "Definitely not a good professor. Pre Lecture videos are fine but you really need to learn on your own. In class he just makes jokes and doesn't really teach.",
        "Lectures and videos are somewhat helpful, but they go over the same material, leaving them pretty redundant. Also, exams are way more difficult than the lecture/homework material.",
        "His class was... not great. I mean, I was able to succeed, but still hated every single part of it. I stopped watching his videos since it did not help. Just do as many past exams as possible to succeed in the class. (especially if you do not read, conception is mostly drawn from couple of previous exams)",
        "Fin 221 was a mostly self taught class for me. Classes weren't very helpful and are self driven. The midterms are also challenging. Would take another professor if you can.",
        "I may have an unpopular opinion about Dyer, but I thought he did a great job explaining things in class. As long as you come to class actually ready to learn and pay attention every single time, the material is not difficult. However he has a ton of material to get through in this class, so he can't spoon feed every problem to you. Great guy.",
        "Really jolly guy, but can't teach. Lectures only go over very basic concepts and the exams are far more challenging than the material he teaches. Homework & online quizzes take a long time too. Hope you get a good TA because they're the only one that'll teach you. People that do really well in the class usually read the textbook.",
        "Maybe his lessons were changed for this semester, but he didn't use any old videos and actually, well, taught. There are still iclicker questions in lecture (which is twice a week) and two group projects, but overall I think he has improved a lot comparing to the other reviews. He's also humorous and makes the lectures interesting.",
        "Dyer doesn't teach in lecture. He makes you watch videos he made 8 years ago. The videos much like lecture are rarely on topic and can be over 20 minutes long. He talks more about the Simpsons than stocks and bonds. The iclicker questions are difficult if you have not watched his videos. The material isn't hard but you will have to teach yourself.",
        "Get ready to spend time learning on your own. He's a nice person, but when it comes to teaching his lectures were not quite relevant (yet you still have to go for iclickers). Exams are multiple choice, drops one. Use past exams and your book to study. Overall, really did not like the class."
    ],
    "tags": [
        "Gives good feedback|Get ready to read|Lecture heavy",
        "Get ready to read|Tough grader",
        "Lots of homework|Skip class? You won't pass.|Tough grader",
        "Lots of homework|Get ready to read|Skip class? You won't pass.",
        "Lots of homework|Test heavy|Lecture heavy",
        "Lots of homework|Tough grader",
        "Group projects",
        "Participation matters|Hilarious",
        "Lots of homework|Get ready to read|Test heavy",
        "Group projects|Clear grading criteria|Hilarious",
        "Skip class? You won't pass.|Clear grading criteria|Hilarious",
        "Lots of homework",
        "Get ready to read|Test heavy|Group projects",
        "Test heavy",
        "Lots of homework|Participation matters|Group projects",
        "Lots of homework|Get ready to read|Graded by few things",
        "Get ready to read",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Participation matters|Skip class? You won't pass.|LOTS OF HOMEWORK",
        "Get ready to read|TEST HEAVY|GROUP PROJECTS",
        "LOTS OF HOMEWORK|TEST HEAVY|GRADED BY FEW THINGS",
        "LOTS OF HOMEWORK|TEST HEAVY|Tests are tough",
        "Get ready to read|Tests are tough",
        "Hilarious|Caring|EXTRA CREDIT",
        "LOTS OF HOMEWORK|TEST HEAVY|LECTURE HEAVY",
        "Get ready to read|GROUP PROJECTS|LECTURE HEAVY",
        "Participation matters|TEST HEAVY|GROUP PROJECTS",
        "Get ready to read|Skip class? You won't pass."
    ],
    "rating": 2.14,
    "initial": "Dyer, M",
    "name": "Michael Dyer"
}