{
    "comments": [
        "(Fall 2019) Easily the best CS prof at UIUC. His lectures are by far the clearest among all of the theory CS professors. I also love his teaching style of writing scribbles simultaneously while he is teaching instead of just pointing at PowerPoints, this makes note taking and focus during class so much easier. Homework and exams are also reasonable",
        "Wonderful!",
        "Jeff is one of the most respected professors at the University of Illinois for a reason: he is the best teacher I have ever had. His lectures are amazing. He is the most reasonable, understanding, and approachable professor. Even though the course is hard, it is worth it. I would definitely recommend him to anyone taking an algorithms class.",
        "Best lectures I've ever had (along with the most difficult problem sets and exams)!",
        "Jeff's lectures are overall very helpful. He is a professor who both cares about lectures and is good at teaching. He is approachable outside of class. The office hours are usually very busy, so you need to wait for a while to talk to him. Besides, he is very supportive of his students. I would take his course again.",
        "I am so inspired, I cheated using a method that Jeff specifically created, but can only be found by students desperate to get a good grade using any possible means, which helped me score perfect on midterm 1, then I jumped into the river to get sick for midterm 2, then I aced final. I hope I can get a paid position in the course now.",
        "This class is so funny, all you have to do is take the conflict exam to bring your grade up. To further abuse the course policies, I purposely got sick for the second exam so I didn't have take it, and the first midterm and final were easier so I ended up with an A in the course. Can I be a hired course assistant now? I got an A in the course.",
        "Jeff loves to make fun of his students, his IDK policy is just a deterrent so that students won't try to actually learn. There's a super easy way to cheat in his ridiculous class since he didn't change his conflict final exam at all. Jeff has the lowest GPA of all professors because he's fully aware that his students are constantly cheating.",
        "Jeff is probably the best professor I've had at UIUC. He explains things clearly and concisely, and his lectures are very helpful. The online textbook he wrote is also great for reviewing the topics covered in lecture."
    ],
    "tags": [
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "Gives good feedback|Respected|Accessible outside class",
        "Respected|Lots of homework|Amazing lectures",
        "Test heavy|Amazing lectures|Tough grader",
        "Accessible outside class|Amazing lectures|Caring",
        "Inspirational|Hilarious",
        "Hilarious",
        "Tough Grader|TEST HEAVY|GRADED BY FEW THINGS",
        "Inspirational|Clear grading criteria|Amazing lectures"
    ],
    "rating": 3.67,
    "initial": "Erickson, J",
    "name": "Jeff Erickson"
}