{
    "comments": [
        "Decent lecturer who excels at course administration. Assignments for the most part are well structured and designed to set you up to succeed. Office hours have historically been awful for this class (a byproduct of how large it is), but he tries to mitigate this by being active on the class Discord. The class is very well run otherwise.",
        "CS225 is a great class but you could definitely learn all concepts online. Lectures were held on Twitch and were pointless tbh. Heavy work. If you're not dedicating at least 15-20 hours weekly, then it's very hard to pass. The MP's, Labs, and Exams are all challenging. It's a weed out class, so make sure to put lots of effort from Day 1. OH suck!",
        "A great professor for CS 225, did his best in Fall 2020 to keep things going smoothly at all times. A lot of people complained about office hours and other things that were hard for him to control, if you look past that he seemed like a really great guy and professor!",
        "I have to admit that this class sucked. The lectures didn't make sense and that there was so much work. Office hours is a hit and miss at times. Be prepared to wait in office hours for at least 5 hours and the TAs not be able to help you throughly with the issues with your code. I felt like this class didn't teach us proper debugging tools.",
        "Great professor who truly cares about his students! This was especially evident during the COVID-19 pandemic in which he went above and beyond to make himself available all the time and ensure fairness. Although his lectures may not be the best, they were pretty good and along with the amazing assignments, learning the content was never a struggle.",
        "Horrible- unnecessary discrepancies between local tests and online ones in POTDs. Quizzes are like all or nothing. Disorganized. Nightmare professor overall.",
        "Had Evans for CS173 and got an A but was really hoping not to have him again, hes unhelpful and kind of a jerk. Had him for CS225... Again, got an A because I taught myself everything, didnt go to a single lecture because I knew from 173 how terrible a professor he is.",
        "Pretty dreadful lecturer honestly, fortunately, the notes posted online are decent enough to help you through the labs and MPs if you're willing to put in the work to understand it. As with many CS classes, stackoverflow may be your best friend for this class",
        "Carl is incredibly nice and easy to talk to, so its a shame that hes such a bad lecturer. Had him for 126 and 225, he added almost nothing to the course that couldn't be found online or from previous semesters. Tries his very best to teach and is sincere about wanting feedback, but just can't get it right. Just very unclear and disorganized.",
        "CS225 is the ultimate easy A. And the contents have been taught really well.",
        "I had him for both 126 and 225. He isn't the best lecturer, but is decently understandable, unlike some professors. He is fairly reasonable . His courses were all well established, so they ran based more on how they were set up than based on his preferencese.",
        "Average lectures, although sometimes on interesting topics. Knows his stuff, doesn't teach it very well.",
        "His class was very funny, but the lectures weren't really worth the time it took to attend. The Maps weren't extremely easy, but definitely doable. The MP difficulty is really going to be based on your code moderator though, but you'll learn what they want quickly and ultimately it does help you improve your coding style.",
        "This class was managed extremely poorly. Nearly every MP assignment had a bug in it and Evans would acknowledge it and not do anything about it. He's a funny guy though. He misspelled the words \"peppermint\" and \"lettuce\" live in front of us and that's when I knew that I was in for a treat that semester. The class itself isn't difficult though.",
        "His lectures are fairly detailed and he's good at explaining confusing topics. The work load is extremely heavy in this course, with weekly projects ranging from 5 to 15 hours a week. The rubric for projects are not often explained well.",
        "Even though I haven't taken too many CS classes in UIUC, I believe that he is the single worst professor I'll meet. His lectures are boring, full of professional vocabs, no intention to explain things the easy way. His rubric is vague, but the TA can just take off points whenever they want. Homework load is HUGE. Expect at least 10 hours a week.",
        "Memorize Angrave's wiki and get an \"A\"",
        "I think Evans is a pretty new professor, and was teaching a course that changes a lot. Still, I think he did a great job teaching the course: his lectures were mostly clear and useful; he was funny, but not to the point that it detracted from his lecturing; and he made a HARD course interesting and doable. I HIGHLY suggest ATTENDING his lectures."
    ],
    "tags": [
        "Lots of homework|Accessible outside class|EXTRA CREDIT",
        "Skip class? You won't pass.|Test heavy|EXTRA CREDIT",
        "EXTRA CREDIT|Respected|Gives good feedback",
        "Lots of homework",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "EXTRA CREDIT",
        "Group projects",
        "Lots of homework|Test heavy|EXTRA CREDIT",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT",
        "EXTRA CREDIT",
        "Lots of homework|Tough grader",
        "Lots of homework|EXTRA CREDIT|Tough grader",
        "LOTS OF HOMEWORK|Hilarious|LECTURE HEAVY",
        "Participation matters|LOTS OF HOMEWORK",
        "Participation matters|LOTS OF HOMEWORK",
        "Tough Grader|Gives good feedback|LOTS OF HOMEWORK",
        "Hilarious|Amazing lectures"
    ],
    "rating": 2.89,
    "initial": "Evans, G",
    "name": "Graham Evans"
}