{
    "comments": [
        "Prof Wade is one of the best professors I've had at UIUC! While lectures weren't mandatory, they were extra credit. I still would've gone even without a grade incentive, since he makes learning fun. Great at explaining coding in simple terms- even to beginners. He ties data science to other disciplines like business, statistics, economics, etc.",
        "Best lecturer ever.",
        "Wade is the best lecturer I've had during my time at UIUC.",
        "My favorite person in the department.",
        "Wade is an incredible professor and human being. CS 225 is by far the best course I've taken at Illinois. Not only did I learn a lot of about data structures, but also about their applications and uses in the industry. Highly recommend taking the course.",
        "Wade is a not only a great teacher but a great person. He came up with many ways to improve the course like opening up lecture-question portals, updating TA notes for us, and grading our work when the TA were on strike. I love love love his lectures, never skips them. He encourages us to be creative using the code and share our work.",
        "Wade is very passionate about all things CS. He does a stellar job explaining concepts and relating them to real world examples. You will be in good hands.",
        "Wade is passionate about teaching. He carefully prepared every lecture. He is happy to help his students in many ways. He is a professor who is very popular among his students.",
        "He is super passionate and excited about computer science. He shows great care for his students and really wants everyone to do well. I would highly recommend him.",
        "Wade is such a caring and encouraging professor. Loved this class. He's an amazing lecturer and he's also quite accessible and helping. Would highly recommend.",
        "Wade is an amazing lecturer. His class atmosphere is very lax, yet he has very good control over the lecture hall. He really shows passion in the things he teaches, and he cares a lot about students. For example, he's had open office hours where you can talk to him about anything like career choices. That's a first I've heard of here from a cs prof"
    ],
    "tags": [
        "Inspirational|Amazing lectures|EXTRA CREDIT",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Gives good feedback|Inspirational|EXTRA CREDIT",
        "Inspirational|Clear grading criteria|Amazing lectures",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|EXTRA CREDIT",
        "Respected|Inspirational|Amazing lectures",
        "Respected|Inspirational|Would take again",
        "Respected|Hilarious|Amazing lectures",
        "Hilarious|EXTRA CREDIT|Would take again",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Amazing lectures|Caring|Would take again"
    ],
    "rating": 4.91,
    "initial": "Fagen, W",
    "name": "Wade Fagen"
}