{
    "comments": [
        "very helpful preparation for higher level stats classes. great teacher and course",
        "Great professor! I took her Stat 200 class. She gives lots of extra credits and almost every problems in the homework you can find simliar examples in her lectures.",
        "I took STAT100 with Karle and LOVED it and got an A+ easily. Thought I would enjoy STAT200 as well but I was mistaken. Fireman's teaching style is completely different. She does not speak clearly and her thoughts are all over the place. Definitely not as easy as stat100 but it is still overall a fine class. Same extra credit policies as 100.",
        "Online lectures were good and very clear. Caring and a funny professor, if possible, take online with her rather than in person with a TA, the videos are clutch.",
        "Great course and teacher. Covers lots of material, well organized, clear lectures.",
        "I can't stand how sloooooooooowly she explains concepts, by the time she finishes talking I forget what she was even saying in the first place. The lectures could easily be 50 minutes, but she takes 80. I also frequently wonder whether she fully understands these concepts during her lectures, or is just reading off the book...",
        "Taking Fireman's STAT200 this semester, and I'm pretty sure I would like to take her classes again. She is organized in explaining stuffs, and provides detailed study guides for each exam. It should be a fun class even if you didn't have fun with math in the previous, and it prepares me well for stat400/410.",
        "Online lectures are very clear and easy to follow. Class itself covers a lot of material and can be a little difficult but she prepares you for the exams really well and provides lots of resources for studying. Require work to do well but I learned a lot in this class.",
        "Wonderful and kind",
        "Highly recommend! Great class, very well structured and interesting.",
        "Hated this class as an online class. You just watch lecture videos that were actually done by Karle Flanagan (who is great). Homework is extensive and tests aren't that hard, but just overall boring and I forgot I was in it most of the time.",
        "Fireman is okay at best. Just pay attention and you can get a good grade.",
        "Awesome!",
        "This class was easy as long as the lectures were watched and the homework was done.  If you do what's required it's an easy A.",
        "I think she is a fairly good lecturer. Sometimes, it gets really boring and tiring going to class, she is really funny and makes Statistics interesting. It is worth taking the course. I recommend it. You can just watch videos at home if you just want to take a nap.",
        "The class is easy; I managed to get an A without much effort. That being said, Fireman is an absolutely dreadful lecturer and her speaking style often contains a great many words and little content. She tends to dawdle on examples and I often fall asleep during the class. However shes a funny lady and very relatable. Gives lots of bonus credit."
    ],
    "tags": [
        "Respected|Amazing lectures|Caring",
        "Respected|Amazing lectures",
        "Clear grading criteria|Lecture heavy|EXTRA CREDIT",
        "Lots of homework|Accessible outside class|Amazing lectures",
        "Inspirational|Amazing lectures|EXTRA CREDIT",
        "Lecture heavy|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Amazing lectures|EXTRA CREDIT|LECTURE HEAVY",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Would take again",
        "LOTS OF HOMEWORK|TEST HEAVY",
        "Skip class? You won't pass.|EXTRA CREDIT|LECTURE HEAVY",
        "Respected|Hilarious|Amazing lectures",
        "Clear grading criteria|EXTRA CREDIT",
        "Clear grading criteria|Hilarious|EXTRA CREDIT",
        "Get ready to read|Hilarious|EXTRA CREDIT"
    ],
    "rating": 3.94,
    "initial": "Fireman, E",
    "name": "Ellen Fireman"
}