{
    "comments": [
        "Mitch is a pretty good professor for ACCY201, but the course itself is very lecture heavy. If you don't come in with prior financial or managerial accounting knowledge, be prepared to practice the different kinds of problems a lot! There is some extra credit available so take advantage of it. Lectures are mandatory because of iClicker questions.",
        "Professor Fisher is one of the best professor Ive ever had. He truly cared about his students and spent a lot of time making sure that we understand the content. He replied to his emails in a timely matter. I had him during the covid19 semester and his transition to online class was very smooth without any interruptions on our learning at all.",
        "Mitch is great, he was very considerate during the pandemic. You just need to do all the work to get an A. It is really easy to get all your points from homework, lectures, etc. Study really hard for exams using past activities and exams and you will be fine!",
        "Arrogant unexperienced professor. Very obvious that it is his second year here. Don't know how people can say his lecture slides were helpful bc he doesn't know how to explain basic concepts and instead goes into way too much irrelevant details that just make you more confused than before. Tests are bs, take any other accy professor if u can",
        "This guy is honestly amazing. It's not too hard of a class if you actually pay attention and don't get behind on work/bs it. Pretty basic accounting tbh so it's a moderately easy A. Fisher is great tho. Im taking his class during the pandemic and the amount of care and consideration he's giving is great. He really loves his job, students and field.",
        "Professor Fisher is great- he has REALLY good lecture slides and is good at breaking things down to make sense to people who don't understand ACCY- he really cares about his students. The only negative thing I'd have to say is there is sometimes too much content covered & the exams are so difficult (coming from a student who studies a lot)",
        "Mitch is a great guy and has pretty interesting lectures. He's funny and tries his best to keep lectures engaging, even though accounting itself is boring. Attendance is optional but going to class prepares you really well for the midterms, which are a large percent of your grade.",
        "Professor Fisher is very caring! He posted a lot of stuff on compass and is very patient with teaching. However, the class is a bit boring. Too many materials are introduced at the same time so it could be challenging. Other than this, an overall great class.",
        "I literally love this man, he cares so much about his students and puts so much time and effort into making sure we understand the course material whether in lecture or at office hours. I took his class last semester when it was his first year here and he was already on top of everything, hats off to my boy Mitch, would definitely recommend him.",
        "He really takes the time to work through and explain problems in class. If you show up to lecture and do all the homework you shouldn't have issues. Overall friendly guy. Take advantage of all the extra credit",
        "This was Mitch's first year as a UIUC professor, and I think he killed it. It is obvious he cares so much about his students. I think there are kinks in the format of the class to be worked out, but nonetheless, great professor. Mitch, if youre reading this, keep it up. Also, dont make the test worth 40% please.",
        "Mitch is an awesome professor! He is new, so it took him a while to figure his stuff out but he is a very effective teacher that listens to feedback. He made ACCY 201 super informative and easy. Yes, the final is a lot of points and he is kind of a goofy guy, but he has given us really great opportunities to earn easy points.",
        "Professor Fisher is a very good teacher. He cares about students very much by providing every week videos and prepared well for every class. Every homework is useful for the course and you can truly learn things from him.",
        "He is very organized and provides a lot of examples and problems, so students could constantly practice. He truly cares. He puts so much work into his course, posting all the solutions and walk-through videos online. The grading is very fair. Overall, a great professor. Take him for this course.",
        "Great guy",
        "Does not seem very prepared when planning ahead. A lot of the grade is towards tests. Also, seems to try to hard to be funny, which has the opposite effect.",
        "I've found Mitch to be a quality professor. His lectures are very thorough, allowing his students to understand all of the topics. He currently teaches an introductory class, so some may find it a bit slow, but it the pace is reflective of the level. Only negative is how test heavy the class is, which the midterm worth 30% and final worth 40%.",
        "Lots of not very good T.V./movie references. Also, for the first several weeks the class moves very slowly, continually repeating the exact same stuff."
    ],
    "tags": [
        "Participation matters|Test heavy|EXTRA CREDIT",
        "Caring|Participation matters|Accessible outside class",
        "Lots of homework|Caring|EXTRA CREDIT",
        "Test heavy",
        "Get ready to read|Participation matters|Caring",
        "Amazing lectures|Caring|Tough grader",
        "Accessible outside class|Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Respected",
        "Gives good feedback|Accessible outside class|Caring",
        "Respected|Lots of homework|Test heavy",
        "Gives good feedback|TEST HEAVY|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Caring",
        "Respected|Caring|EXTRA CREDIT",
        "LOTS OF HOMEWORK|Clear grading criteria|TEST HEAVY",
        "Skip class? You won't pass.|Caring",
        "Participation matters|TEST HEAVY|LECTURE HEAVY",
        "TEST HEAVY|LECTURE HEAVY",
        "Participation matters|LOTS OF HOMEWORK"
    ],
    "rating": 4.22,
    "initial": "Fisher, M",
    "name": "Mitchell Fisher"
}