{
    "comments": [
        "Amazing professor. Really wants to see her students succeed. She really made me feel comfortable about college especially this being my very first semester. She also makes statistics really easy to understand and explains very well. 100% recommend her course!",
        "Awesome!",
        "Karle truly wants all of her students to succeed!",
        "Karle is so sweet! Honestly, as a freshman just starting out in college, Karle has really helped me adjust. Her class is amazing. It is taught very well and follows a guided notes format. I havent actually been to a lecture since August. I took statistics in high school so I may be biased, but you dont need to show up if you understand it.",
        "I would highly recommend Karle. You can tell she is very passionate about what she does and cares about her students. As long as you go to class or watch the lecture videos and do the homework, it's not a hard class. She offers lots of extra credit opportunities as well as practice exams to help prepare for tests. She is always available to help.",
        "I literally love Karle and I was an online STAT 100 student. She is so nice and accessible outside of class. She offers so much extra credit and gives 3 practice exams to do if you choose. Not only does she explain how to do the problem, but HOW to do the problem. She is amazing. My favorite so far. Exams aren't too bad if you watch lectures!!",
        "She is really sweet and gives lots of ways to learn things. I was online, so im not sure how she is in person but her class is really easy if you watch the lectures. She is really caring and you can tell she cares about the success of her students. Definitely one of the better explanatory teachers I have had. Just make sure you watch lectures!!:)",
        "Karle has to be one of the best professors I have ever had. She explains everything so well and knows what she is saying. Karle is very caring towards her students as well. I hope she is having a great day for being the best professor! :) <3",
        "Karle is such a sweet prof. Amazing teacher, gives out so much extra credit. The hw is easy and notebook is a great tool. Her twitch reviews were a great way to prepare. The exams are exactly like the practice exams. She even replaced our lowest exam with our final exam grade this semester!",
        "Karle is amazing! I honestly never watched one of her lectures but I still did well in this class because of her twitch reviews before each exam and her 100 points worth of extra credit. Best instructor I have ever had!",
        "Karle has a great personality, awesome lectures, and gives 100s of points of extra credit. If you suck at math you can still get an A in this class. Taking this online wasn't hard at all and a time saver",
        "I hardly ever enjoy math or statistics but she made it worthwhile.",
        "Karle is the best! I had to take this class online because of COVID and it was still such a fun class to take only because of her. There's so much extra credit, her lectures are super helpful, and her notebook makes studying for exams so much easier. She's super helpful and understanding and just overall the best. Would definitely recommend!!",
        "Karle is the best professor I've ever had. I DESPISE math but had to take stat100 for my major, and this is the first math class I have ever enjoyed. I love Karle and love this class - she is very clear in her lectures and you can tell she genuinely loves her students and her job. 10/10 would take this class again.",
        "Love her!! I had her for stat 100 completely online. Math has never been my strongest subject but she made it so easy! I felt extremely prepared for the tests.",
        "Best professor I have ever had. THE greatest!",
        "Flanagan was absolutely great. Lots of videos to watch, but pretty easy concepts. Super accessible outside of class. Easy A if you do the work and try.",
        "Honestly my favorite college class I've taken! Karle seems to really care about her students and is the most generous professor I've had in the covid era. As long as you watch the lectures and take good notes, you should be able to get an A.",
        "She really cares about your mental health and is willing to give extra points if you have good intentions. Easy extra credit, if you don't pass, that's on you.",
        "Karle is the BEST! Her lectures aren't too long, she gives LOTS of extra credit (do it), and she makes learning the material easy, fun, and applicable. I was concerned because I don't have a strong math background, but she made it easy to learn even during the pandemic. She always answered my emails and even had a live exam reviews for her students",
        "Absolutely amazing professor! Due to the pandemic our class was online. Lecture videos are recordings of her actual lectures so you still get what you paid for. You use Lon Capa, and she gives easy extra credit opportunities that will boost your grade up to 5%! You are told to buy the workbook but I just took notes instead. Class was open note!",
        "Wow! This pandemic has been terrible, but Karle has been the best. Im terrible at math, but she made everything so easy. She makes me want to minor in stats, despite my background. Shes so understanding, caring, and overall a good teacher. Theres discipline but also caring, which creates a balance with Karle. Take this class !",
        "Karle is one of the best professors you will ever have. She makes her expectations known and the grading criteria is clear. For this course, you get a notebook where you take guided notes in. It is super helpful. She offers tons of extra credit that really boosts your grade. She is always available to help and is super nice. Take her class!",
        "Best professor I have ever had. She explains things so well and is such a nice person. 11/10 professor.",
        "Super nice professor! She was always ready to help even with courses completely online this semester. She made stats fun!",
        "AMAZING! Hands down the best professor I've ever had - concise criteria and compassion with clear communication skills. Always quick to respond with support: all questions or problems addressed, answered, and resolved. A genuinely nice woman trying to help her students reach potential & improve her class for future students. 10/10 would recommend.",
        "An amazing professor! Extra credit twice a week and very accessible office hours. Lectures make statistics easy!",
        "As someone who isn't good at math, Karle is great! I thought this class was very fair and offered a ton of extra credit. There were 3 exams which were pretty fair too.",
        "Karle is one of the best educators I have ever had the chance to be taught by. She is not here because she needs to be but because she wants to be.",
        "Karle is an awesome professor. I have never been a math person, but Karle explains everything so easy to understand! She also is so funny during lectures and you can tell she is passionate about teaching. She is also accessible outside of class (even during COVID) and gives lots of extra credit.",
        "AMAZING!!!! She is literally the best most clear and concise professor ever. This is my second time taking stats and I understood every single thing thanks to her. She is truly masterful at teaching this class, anyone that needs to take statistics needs to have her! Gave so much mind to students and how to make things better for us.",
        "I went into this class nervous about it, but Prof Flanagan was so good at explaining things, she made the concepts easy to understand. Very genuine and warm. Provided lots of available office hours.",
        "Karle is so sweet, and she is very well-spoken. She makes the information extremely easy to understand.",
        "I would die for Karle Flanagan. If you are someone who needs to take a gen-ed but never wants to take a math class ever again, show up to this class, get an easy A, and enjoy the experience of learning from hands down one of the best professors at UIUC. Karle is such a gem; amazing lectures, always present at office hours. I will miss having her!",
        "Flanagan is HANDS DOWN one of the best teachers that I have ever had. I was really nervous to take a math course online, but she made it incredibly easy to learn and understand. As long as you followed along with the lecture, theres little to no way you could fail the class. Also, she is very understanding and gives opportunities for extra credit!",
        "I wish every professor was like her",
        "Karle is awesome!!!!",
        "Karles the best. An absolute gem.",
        "Karle was a great professor for STAT100. I took online and her lecture videos were very easy to follow as they went directly along with the notes. Lots of extra credit opportunities and the exams are not too difficult.",
        "Her lectures are incredibly thorough and make the homework easy to do. Her subject isn't the easiest, but she's just that great of a professor. She makes sure that students are ready for her exams, and easily fluctuates to accommodate uncommon situations (COVID-19). I've never seen a teacher care as much about education as she does her subject.",
        "Literally the best prof I've taken class with at uiuc. Actually cares about the students and makes the class so easy to pass.",
        "She is easily the best professor I've had on campus. She writes the workbook herself and knows stats well & can explain it well. Follow along with her notes and the class is an easy A!",
        "Karle is awesome! She replies quickly to emails, and is so kind and bubbly! Stats 100 is super easy even if you are bad at math. There is so much extra credit, that even if you do bad homework (which you won't because it is so easy) you can easily make up those points! Tests are a breeze and straightforward!!",
        "Lots of extra credits and the materials are easy. Karle and the whole STAT100 team work well!",
        "Fantastic prof teaching this course.",
        "karle is a great professor, she makes lectures interesting, offers a lot of EC. however she grades the notebook strict; missing even 1 question on 3+ pages gets a 0. this shouldnt be a problem if you fill it out completely in class, but most likely you will have to grind on it a bit out of class, so make sure its 100% done or its not worth the work",
        "Best professor I've ever had, also I am not that good at math but she managed to make me hate it a little less. Would take again if I could.",
        "Karle is a wonderful teacher. I took STAT 100 online and she records the lectures each week and makes it easily accessible to me. The exams are very very similar to the practice exams. She makes it hard for you to fail the class. Love her!!",
        "Prof Flanagan is the greatest math teacher I've ever had. She is extremely helpful in office hours which really impacts your understanding of the course material. She dumbs down the material in the nicest way ever.",
        "Funniest professor ever. Dont be afraid of this class when you have Karle. Shes hilarious, nice, straightforward, and knows what shes doing. Fantastic person and great class",
        "Love Karle with my whole heart. She is so great at explaining things and kept my hour and a half lectures fun and interesting. She wants her students to succeed and cares for people. I would 100% suggest taking this class with the wonderful Karle!!!",
        "Karle is the best prof Ive ever had! I wish all of my profs were more like Karle. She is always thorough, organized, fair, and kind. She is an amazing professor and person. Would highly recommend taking a class with Karle if you get the opportunity!",
        "Probably, if not, one of the best proffessors I have ever had. She makes the class so easy and has office hours everyday. So much extra credit, including the notebook you fill out and even attending class.",
        "Amazing teacher. Makes the class easy to understand even if you think youre horrible at math. She is super funny and does the workbook with you In class. Her tests arent bad as long as you go to class and do the homework.",
        "Karle was a great teacher for Stat 100 and taught everything in a clear and understandable way.",
        "She is a great teacher. She explains the concepts extremely clearly and is always ready to help after class or at office hours. Her tests are based on the homework and practice tests and she offers lots of extra credit. Would definitely recommend.",
        "Karle is a sweetheart, she came to class everyday excited to teach and do her job! I am TERRIBLE at math, like scary bad so I struggled a bit. However, her office hours are SUPER helpful you have to go if you are struggling. Attendance is obviously crucial. 30 extra credit points for a filled in notebook. You will honestly love her!",
        "Very sweet! Cares about her students and is always available to talk with you. Lectures are recorded and posted online and lecture attendance is for EC, so you honestly dont need to go if you dont need the EC. Exams are very easy and have basically the same questions as the practice exams. Lots of EC opportunities.",
        "I LOVED Karle and her class! Keep in mind: I am absolutely the WORST at math or anything related to numbers (like statistics), but she explains things so well and is super sweet! I wound up with an A in the class, but I don't think I could have done it without her! Made me hate math a little less :) Thanks Karle!",
        "Shes super nice & understanding. Good at teaching & explaining. Taking notes is easy bc you use a fill in the blank notebook. TONS OF EXTRA CREDIT.",
        "I loved Karle! She seemed so genuine and passionate about helping her students learn. Was always in a better mood every time I went to lecture :)",
        "Karle is an excellent teacher, I would definitely take another class with her if she was teaching any higher level statistics courses in the future. Her methods of teaching introductory stats is more effective than that of previous intro to stats professors I had at other schools. She uses a nice custom workbook with the course that is helpful.",
        "Karle Flanagan is the best math professor I have ever had. I HATE math classes but her class made me consider picking up a Stats minor. Attendance in class is extra credit, filling out notes is 30 points extra credit, taking surveys is extra credit, there is basically no way to fail unless you forget you're taking the class. Highly recommend.",
        "Best math teacher I have ever had. Passionate. Caring. Amazing. 11/10",
        "She was wonderful to have. She explains everything clearly and is super nice.",
        "Karle is incredible and one of my favorite professors at UIUC! Though stats is a difficult subject for me, her lectures were clear and really made the class easy to get an A in. She's a great teacher and she's funny and super engaging even in a huge lecture hall. She also offers tons of extra credit.",
        "Karle makes the best jokes during class I love her",
        "Hands down, one of the best professors on campus. Her bubbly personality and her willingness to teach has definitely motivated me to come to every session. She explains all concepts so well that as long as you copy her notes in class, you will definitely get an A.",
        "Pretty easy class. Only Professor I've ever had that seems to enjoy every second of every day. Tons of extra credit and easy iclicker points.",
        "Karle was great! interesting lectures, great reviews before every exam!",
        "STAT100 is an incredibly easy class. By attending lecture and participating via I-Clicker there are many extra credit opportunities. The old exams are very similar to the actual exams, so make sure you know how to do all the problems on them before going into the exam.",
        "Karle is AMAZING. Seriously the sweetest professor ever. She cares so much about her students and their success! Lectures are so easy to understand and all you need to do is just listen and read the notebook. Not a hard class at all and Karle makes it fun. Shes the best.",
        "Karle is great, and gives a ton of extra credit. Attendance counts for bonus points, but starts to add up if you dont go. Its also important to go to fill in the notebook. Take advantage of the bonus it can really help your grade!",
        "One of the best teachers I've ever taken! Class was very put together and she offered 100 pts extra credit, which equaled a test. Show up, fill the workbook out, and study a bit and you can get an A no problem! Also made class more fun with creative polls. iClickers were also used daily. Would take again!",
        "Karle is a great professor. She has the perfect pace for lectures and she makes the material easy. There is a lot of extra credit opportunities. As long as you do all of the work you should get a good grade in the course.",
        "Stat100 is one of the best and most organized classes at UIUC. Karle Flanagan is the most hardworking professor and she is really inspiring. To do well in this class you should attend lecture, finish the homework, and view the pre-lectures. Professor Flanagan is the best, funniest, most relatable professor who really goes the extra mile. Best Prof!",
        "Prof. Flanagan is amazing. The way she talks in lectures are always so fun and interesting, she makes her lectures feel like you're talking to a friend! And she does an awesome job at dumbing things down to make everything really easy to understand. She's extremely helpful at office hours AND TONS OF EXTRA CREDIT!!!!! She's hilarious and caring.",
        "Karle is honestly a literally angel who has never done anything wrong. She's super upbeat and always engaged, love her!",
        "I took the online section of this class and I felt like all the materials were very detailed and I didn't miss out on anything by not showing up in person.",
        "She is nothing less than AMAZING. She is nice, she loves what she does. She is ALWAYS willing to help. I went to her with problems from another math class and she was excited to help me. It is obvious that she really cares about her students and wants everyone to succeed. She radiates positivity and that made the class 1000x better. You rock, Karle",
        "She's a really good teacher! She's always available for a student in need and not only does she clearly know what she's talking about, but she's really good at explaining it all too. If you have to get stuck taking a stats class, be sure to take it with her.",
        "I literally love her so much! she made the class so enjoyable and fun. Would defiantly recommend! Lots of extra credit and the tests are easy as long as you do the homework.",
        "Karle is a really great professor. Shes easy to understand and extremely approachable. Theres so much extra credit, its unlikely to get a bad grade. I honestly may have gotten an A had I done more of the bonus. And attend class if you want extra credit. Stats seems hard to most people, but Karle makes it so simple almost like common sense.",
        "Karle is a gem. The online class is the exact same as the in-person class, as she uploads the lectures that she gave. Content can be dry, but Karle will literally run out of breath when excitingly lecturing about stats.",
        "Professor Flanagan is the best! I took her for stat 100 and if I needed help with anything, she would always be available for office hours! Her class really helped me better my math and statistic skills! She is so sweet, understanding, and really cares for her students. Plus she gives out extra credit!! She is probably one of the best prof at UIUC!",
        "BEST PROFESSOR AT UIUC HANDS DOWN. Karle cares about you and about stats and never puts you in a position to fail. Show up, take notes, do the extra credit and its an EASY A. She wants you to succeed but she also knows how to teach.",
        "She seems extremely passionate about teaching Stat 100 and keeps what many would consider a boring topic quite engaging and interesting.",
        "Karle is the best professor I had here so by far. She's literally always happy and smiling, ALWAYS. She's great at explaining in detail and she even answer questions in lectures. This course is easy if you go to class and do all of the bonus. The exams are exactly are like the practice exams that are in the book.",
        "She is so awesome! Learned a lot in her class.",
        "Karle was very nice. She gave extra credit opportunities every week through pre-lecture videos, iClicker points, and surveys. If you go to class and fill out the notebook you'll get an easy a",
        "So nice, fill out the workbook its so helpful and do the practice exams, the practice exams prepare you well for the real exam",
        "The only way anyone should learn math is through Karle Flanagan. Karle is absolutely adorable and sweet as can be. I suck at math, but she makes concepts so easy to understand and always has really helpful test review sessions. She is everything that anybody could ever hope for in a professor. Not to be dramatic, but I would die for Karle Flanagan",
        "Karle is an amazing professor who makes statistics both understandable and enjoyable. Her love for statistics is so evident in her lectures, which is rare to have in a teacher. I can't recommend enough!",
        "I absolutely LOVE Karle! One of the best professors at UIUC hands down. Her class isn't really hard, I ended up getting an A. However, don't underestimate it. I did have to study and look over some things. Plus, she gives bonus points which really help in the end.",
        "Karle is, and I've used this phrase before I started this review, a real gem. I heard horror stories from my older sister about Stat 100 at a different school, and now I'm trying to become a TA for Karle's Stat 100 class. She's such a fun teacher, the class is easy if you go to lecture and pay attention, and office hours are great for more learning",
        "STATS 100 is the best choice you can make if you'd like to take more math but aren't ready for something like Calculus. Karle is a fantastic teacher. I took her class online (which I highly recommend!) and go to her office hours semi-frequently. She is super helpful and sweet.",
        "Karle is an amazing professors! She makes Statistics interesting and easy to learn. All the tools that are needed in order to get an A+ in the class are given to you. Take Karle's advice and take the practice exams prior to the real exam without your notes. If you put in the time by going to lecture and reviewing for exams, the class is an easy A.",
        "A super nice lady. She is so passionate about statistics which is awesome because I hate math, but she makes me at least wish I loved it :)",
        "You can take this from someone who hates math-karle is freaking amazing! She made class interesting and fun and is willing to meet with you bacially whenever she is free. All you have to do is show up and copy her markings in her book into yours and you are set.",
        "Karle was fantastic! Frankly, the best math-related class I've ever taken. She makes stats easy to understand and even fun/funny. She's very accessible, sweet, and driven to see her students succeed. There are a ton of practice problems/exams and extra credit opportunities -- it's almost impossible to fail unless you don't take advantage of it all.",
        "Karle made the subject of stats way less intimidating and was able to explain things really well. She is available all the time for office hours and is extremely helpful! Even if you're not confident in your math abilities, I'd say take this class because it's not as math based as you'd think.",
        "Bubbly and sweet. Karle's stats class is insanely easy as long as you dont forget the assignments.",
        "Karle is the best teacher i've had not only in college but ever. She's so sweet and makes it clear what you need to do well. It's easy because she makes statistics easy to understand but you still have a put work in to if you want to do really well. If you struggle at all go to office hours Karle and the TAs are so helpful there!",
        "Karle is a great women.  She cares about the students, and really takes time to make sure she is understood.  Awesome teacher, if you have to take stat 100 make sure you get her because she is awesome.  Homework before every class (twice a week), but that's nothing.  Definitely an easy A, and you'll learn some useful stuff",
        "Best teacher I've ever had, explains material so well.  Catch her at TRL on occasion.",
        "STATS100 is known to be an easy class, but if you don't keep up with the homework your grade will suffer (2 assignments (mandatory) & 2 prelectures (bonus points) per week).  It's easy to tune out in class because Karle repeats concepts and goes slowly through content, but if you pay attention it makes it easy to memorize concepts for testing.",
        "Great teacher! !",
        "Super easygoing, funny, and explains things in a simple manner. STAT100 is an easy class, even for someone like me who doesn't like math at all. You have to buy the notebook but it will be your holy grail. DO NOT buy the textbook, waste of money (she said so herself). So much extra credit, it would be hard not to get an A or B.",
        "The content is easy and Karle is good at explaining it. If you go to lecture, you will most likely get a B or higher.",
        "Karle is the best! You only need one book that you fill in with her during lecture, but if you don't go get the notes from a friend. Lots of extra credit in lecture (iclicker) and online. Homework isn't too bad, it's on lon-capa and if you get stuck read the comments or ask for help. 3 exams and a cumulative final. Fun and easy class overall!",
        "Karle is super bubbly and keeps the class's attention even though the class is super long. She does a great job of explaining but if for some reason you don't understand something, she offers a ton of office hours!",
        "Karle Laska is my favorite professor so far. She is genuine and loves teaching. It's easy to pass as long as you follow along during lecture and study up a little before the exams. Literal favorite part is looking at survey results in class. Best. Ever. She's just great. Recommend her class highly! She posts lecture videos as well in case you miss.",
        "This class was pretty easy. Show up to lecture, do the homework, and study for the exams and you should be good. I suck at math and got an A. Her and her TAs will always answer your questions. She is super sweet too and tries to make lectures interesting.",
        "She is a  good lecturer. Stat 100 was an easy course, but it is easy because she is so good at explaining the concept.",
        "Great teacher that cares about the students",
        "Great"
    ],
    "tags": [
        "Gives good feedback|Respected|Amazing lectures",
        "Skip class? You won't pass.|Amazing lectures|Caring",
        "Gives good feedback|Respected|Hilarious",
        "Inspirational|Caring|EXTRA CREDIT",
        "Respected|Accessible outside class|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Skip class? You won't pass.|Amazing lectures|Caring",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Respected|EXTRA CREDIT",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Inspirational|Caring",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Gives good feedback|Respected|Accessible outside class",
        "Accessible outside class|Lecture heavy",
        "Caring|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Skip class? You won't pass.|Clear grading criteria|Caring",
        "Respected|Accessible outside class|Inspirational",
        "Accessible outside class|Clear grading criteria|EXTRA CREDIT",
        "Amazing lectures|Caring",
        "Respected|Caring",
        "Inspirational|Caring",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Lots of homework|Clear grading criteria|Amazing lectures",
        "Caring|EXTRA CREDIT",
        "Respected|Accessible outside class|EXTRA CREDIT",
        "Respected|Accessible outside class|Caring",
        "Gives good feedback|Inspirational|Amazing lectures",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Gives good feedback|Clear grading criteria|Amazing lectures",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "EXTRA CREDIT|Clear grading criteria|Caring",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Inspirational|Amazing lectures|Caring",
        "Hilarious|Amazing lectures|Caring",
        "EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT",
        "Clear grading criteria|Hilarious|Caring",
        "Graded by few things|Hilarious|EXTRA CREDIT",
        "Lots of homework|Clear grading criteria|Amazing lectures",
        "Gives good feedback|Accessible outside class|Caring",
        "Accessible outside class|Amazing lectures|Caring",
        "Accessible outside class|Hilarious|Amazing lectures",
        "Accessible outside class|Hilarious|Caring",
        "Respected|Hilarious|Amazing lectures",
        "Respected|Accessible outside class|Amazing lectures",
        "Respected|Clear grading criteria|Hilarious",
        "Skip class? You won't pass.|Amazing lectures|Lots of homework",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Skip class? You won't pass.|EXTRA CREDIT|Clear grading criteria",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Respected|Hilarious|EXTRA CREDIT",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Gives good feedback|Respected|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Caring",
        "Clear grading criteria|Amazing lectures|Caring",
        "Respected|Caring|EXTRA CREDIT",
        "LOTS OF HOMEWORK|Hilarious|EXTRA CREDIT",
        "Respected|Amazing lectures|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "Participation matters|Amazing lectures|Caring",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "TEST HEAVY|Caring|EXTRA CREDIT",
        "Participation matters|Hilarious|EXTRA CREDIT",
        "Respected|Clear grading criteria|EXTRA CREDIT",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Hilarious|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Respected|Inspirational|Caring",
        "Gives good feedback|Participation matters|ACCESSIBLE OUTSIDE CLASS",
        "ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT|Would take again",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT|LECTURE HEAVY",
        "Respected|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Would take again",
        "Caring|EXTRA CREDIT|Would take again",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Caring|Would take again",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Hilarious|Amazing lectures|Caring",
        "Respected|Amazing lectures|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Caring",
        "Respected|Clear grading criteria|EXTRA CREDIT",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Amazing lectures|Caring|LECTURE HEAVY",
        "Hilarious|Caring|EXTRA CREDIT",
        "LOTS OF HOMEWORK|Caring|EXTRA CREDIT",
        "Respected|LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS",
        "Hilarious|Caring|EXTRA CREDIT",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Hilarious|Caring|EXTRA CREDIT",
        "Caring",
        "LOTS OF HOMEWORK|Caring|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "Caring|EXTRA CREDIT",
        "Gives good feedback|Hilarious|Caring",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|Caring",
        "Gives good feedback|LOTS OF HOMEWORK|Clear grading criteria",
        "Respected|Hilarious|EXTRA CREDIT",
        "Respected|Participation matters|Clear grading criteria"
    ],
    "rating": 4.97,
    "initial": "Flanagan, K",
    "name": "Karle Flanagan"
}