{
    "comments": [
        "Prof Fleck is very enthusiastic about teaching the content of this class and it makes the lecture videos enjoyable! The content can be difficult at times, but the free textbook is very useful and it's easy to get answers on the forum.",
        "The way she does lectures on the chalk board in my opinion give it a really unique experience that makes you get up at 9AM. She's extremely caring and reachable. But, the class could be better structured. Having tests every week only allow for basically no mistakes at all because the exams are so short, if you want an A.",
        "One of my favourite professor at UIUC. Really admire her teaching style. She really cares about students and put their learning on first priority above anything else in the course. Was very helpful with the assignment and strike right balance between giving small hints rather than the answer itself.",
        "Extremely helpful (but not required) lectures. Mini tests every week but lots of online material to prepare. Textbook is a free pdf. Easy to make mistakes however so be careful.",
        "Margaret is fine but I think how this course works isn't fine. We have every exams every single week and we are expected to be taken at most 2 points off for every one of them. They also make the questions on exams vague sometimes. The materials are not hard but they make it hard and a bit sick. I would take prof instead of taking this class.",
        "She's a great teacher and clearly cares about her students. Her textbook (posted online for free) is excellent at explaining things; many students get through the course with no issues without going to any lectures just by reading the textbook."
    ],
    "tags": [
        "Get ready to read|Hilarious|Amazing lectures",
        "Respected|Inspirational|Test heavy",
        "Respected|Inspirational|Amazing lectures",
        "Tough Grader|TEST HEAVY|Amazing lectures",
        "Tough Grader|TEST HEAVY",
        "Respected|TEST HEAVY|Caring"
    ],
    "rating": 4.67,
    "initial": "Fleck, M",
    "name": "Margaret Fleck"
}