{
    "comments": [
        "I paid for a full course and I got a self learning program. The lecture are basically useless, The homework is way too much for the points it worth. Will not come again",
        "The online semester under Lena for Spring 2021 was horrendous. Her lectures are unclear. She doesn't explain the content very well. I relied on other online sources to learn instead. She also disappeared and ignored Campuswire forum questions. She, however, allowed retakes, which was helpful for me and allowed me to improve on my proctored exams.",
        "Lena is possibly the worst professor, or teacher in general, I've ever had. Her lectures, if they can even be called that, are short, uninformative, and often incomplete. The TAs carry this class. She also NEVER responds to emails. Biweekly exams suck. Practice exams don't reflect exams. Frequently makes mistakes in explanations and never fixes.",
        "Had her for Math231 this past semester; she's impossible to get ahold of in general and is basically a nonexistent resource for getting any kind of questions answered. Her lectures were also not very informative most of the time. Also had about 5-8 hours worth of work every week. Offered terrible support to students for such a hard class.",
        "Absolutely horrible. Never responds to cries for help. Basically YouTube taught me this semester. Seems very lazy and apathetic towards students even though she says things like ask me if you have any questions. You can ask, shell just never respond. Im someone who usually does well in math and this semester has been extremely frustrating.",
        "I'm someone who's gotten As in math classes all their life, this class being no exception. That being said, this has been the worst class I've ever taken. Please take the proficiency test or something. Material is constantly posted late, questions are never answered, and lectures are unclear and inadequate. Basically taught myself the entire class.",
        "Lena is quite literally the worst math teacher i've ever had. she's so unorganized, doesn't answer emails, her pre-recorded lecture videos often include \"finish this problem yourself,\" and doesnt enter grades for weeks on end. you're lucky if you know your final grade before its time to drop a class.",
        "Doesn't respond to ANY emails. Even my TA has trouble reaching her. Lectures are brief, incomplete, and don't cover the exam content. Our TA constantly has to fill us in on important material. Also, she sniffles and sneezes every minute or so in EVERY lecture. It's incredibly irritating. Finally, why is every lecture video in portrait mode?!",
        "By far worst prof i've ever had. I had to teach myself this whole semester. Never responds to anyone's emails. Its like she disappeared or doesn't care. Basically the TA's are your only help.",
        "Hard to believe she is the professor when she is never present for office hours and relies on her TA's to teach the entire class. She gives lazy lecture videos which are unhelpful and tons of work. Not to mention we have 6 exams in total. Probably the worst professor I've ever had, she just doesn't care",
        "Randomly disappeared from the class for a few weeks mid semester, no communication even with TAs with no explanation. I did like the option to retake midterms untimed to get some points back, but not much else. Lecture videos were a little clumsy, posted notes where sometimes helpful, sometimes not.",
        "Does not respond to any emails, with a fully online class it is impossible to learn. \"Lectures\" are a collection of sub 10 minute videos that are just straight up worse than some outside material such as khan academy. Class isn't the hardest class in existence, but she just does not try to help anyone at all.",
        "She sucks. Horrible lectures that don't teach, and then throws you tons of homework and bi-weekly tests unlike any lecture content. She never responds to emails or campusboard posts (in a COVID semester, nonetheless), leaving you out to dry. Luckily, the TAs help, but they're doing her job bc she's lazy and refuses to properly teach. DON'T TAKE HER",
        "Extremely hard to do well if you aren't staying on track with her many, many lectures, which move too quickly to understand most of the time anyway. Also an unnecessarily large amount of HW which is really difficult, & even when I've tried to ask for help, she's basically impossible to reach. Only the TA's help, and even then it takes 12+ hours.",
        "What she does in her online lecture is just to show you endless examples. She never explains any theories and the logic behind them. She just solve a question with her knowledge and left you alone, wondering \"what the hell?\" She is such a terrible professor. No one should take her class!",
        "Lectures are 5-10 minutes long each. After 4 weeks, she decided to stop teaching and now just presents \"example questions\" and doesn't complete them. This week, we had two lectures. Both of them refused to explain the theorem being covered and only provided incomplete example problems and told us to read the TB. She also doesn't respond to emails!",
        "Her short lecture videos are no where near detailed enough to complete the homework. We have about 6 assignments due each week. We get 2 lecture quizzes, 2 group worksheets, and 2 homework assignments to complete each week. The class would have less complaints if her lecture videos were detailed instead of 5 minute short clips with little effort.",
        "Online lectures were often posted late, and videos were under 10 minutes while lacking all material we needed to know. Often our TA's would have to spend our discussion time teaching what she failed to teach. Theres a midterm every other week and she never responds to her emails. Get ready to self teach your course through youtube.",
        "I took Math231 this fall semester, and I really think that she is a good teacher. The lectures of each lesson posted online were all very clear. For those struggling reading the textbook, I really recommend you to watch the lecture videos. The points she taught in the video are all very clear and helpful. The grading criteria was also clear.",
        "She is a really bad professor and she never responds to emails. Her lectures are not helpful and you never understand what is happening in the class. I had to look up YouTube videos in order to understand what was going on in the class.",
        "She is a terrible professor and I had to learn most of the videos from Youtube as her lectures would not reflect Webassign or other homework. The nice thing is quiz retakes, but even then I had to put in hours of extra time in the class because she would not teach.",
        "Terrible professor. Lacks the ability to properly teach the important basics of crucial topics. shes nice and seems to love Calculus but her teaching is just not a good way to learn in this class. Her lectures are very confusing and often times are incomplete. Does not respond to emails and does not prepare you for exams.",
        "Don't take this class. I studied for over 20 hours for the final and ended up getting a 40%. This class caused me to much stress and anxiety I can't even explain it in words. The amount of midterms is ridiculous and the instructor doesn't know how to lecture AT ALL. The TA's do most of the job.",
        "zoom proctored tests. no notes and no calculator",
        "Fall 2020, COVID semester. SO unorganized!! Always late with posting assignments. Grades are made up mostly of exams and she won't upload answer keys until literally an hour before. Don't expect her to email back EVER. Mostly learning from Discussion (your TA) or on your own. Didn't watch lectures rlly ever, learning from outside is more useful.",
        "I'm sure she's a sweet in person, but taking calc 2 online has been awful with Lena. She doesn't post material when she says she will, leaving students to scramble when she posts homework less than 24 hours before its due, or posting worksheets after the synchronous zoom, or practice exams less than 2.5 hours before the exam. Easy A but STRESSFUL A",
        "Had her for MATH221 as well, but this semester she made a lot more mistakes and was less enthusiastic. After the transition from covid, she ignored all emails & attempts at communication. She also had another prof give a lot of the lectures. Overall, she is caring and answers as many questions as possible. You MUST study a lot for this course",
        "She is honestly so nice, like I can't even explain. Her lectures are pretty good, even online. Calc 2 sucks, but she makes it do-able. Go with Lena!",
        "Had her for Calc I, and that was fine. But nope. In Calc II she is a mess. I've never seen a teacher or professor make so much mistakes before ( during lectures, homework, tests, etc.). The only perk is that everyone else fails too so there's a great curve.",
        "She was my professor for math at the university. She provides extra chances for the homework if you go to her office hours. She might speak fast for some people during lecture, but it is easy to get used to. The second midterm was hard but she curved it. You MUST go to lecture and discussion to do well.",
        "I took calc in hs, and this class is bad. Exams are 80% of the grade, but generous curves. Awful lectures (copies from another sheet and goes too fast) Also, I've never seen a teacher make so many mistakes (everywhere in hw, wkshts, practice tests) Most kids here know calc 2, but still struggle. Anything I learned was done by myself or from my TA.",
        "Her review papers match her test format so there aren't many surprises in the exam. Her lectures are fun and easy to follow. You do have to do the homework in order to understand the material more throughly but thats for every class.",
        "Horrible as a teacher, has no idea how to teach a class and has no idea about the material whatsoever. Do not take, your other option is probably Guzman, she is horrible as well, but still better than her.",
        "Ok, so I couldnt focus during her lectures 1) I had it at 8 am. 2) she talked very fast and her back is always towards you. 3) she never really explained how to do the examples she just wrote the answers beneath them which made the quizzes hard to do. I mainly used Khan academy to teach myself.",
        "You know somethings wrong with the professor if the class avg is 50-60%",
        "If you can learn by watching someone scribble nonsense on the board this is the class for you.",
        "1. Terrible lecturer. Spends the majority of time writing out the solutions to problems but scarcely explaining the material. You're better off just going on Khan Academy everyday to understand how to solve problems. 2. Rushes and speeds through the material while somehow barely teaching. 3. Don't get her as a TA. She just solves problems FOR you.",
        "Calc 1 was difficult, but if you put effort into solving the homework problems, show up to every lecture and discussion, and do all of the practice tests and quizzes you'll be fine. She did make the exams more difficult than previous years, but if you really know your trig and exponential rules you can figure out any problem. Exams are curved too.",
        "Take this test at your community college because it is really hard at uiuc. The test averages are 55%-65% for each test with no curve and make up 75% of your grade. The other 15% being quizzes and hw which is extremely tedious. I've never gotten below B in any class in college except now and I deem myself a fairly good math student.",
        "She made a lot of mistakes and wasn't good at explaining the material. However, the TAs were solid sources of help and there are a ton of resources for this class outside of class. DO THE PRACTICE QUIZZES AND EXAMS! They are EXACTLY like the actual exams that she gives. Also do the hw, it really helps but its only 2% of your grade.",
        "Guaranteed nightmare. If you take this class, you will have to learn all the material by yourself. Stopped going to class because all Lena does is scribble incoherently on the board rapid quick. My hands got cramps from trying to write so fast lol. A Jackson Pollock painting makes more sense than her lectures. Asking her for help? You're dreaming.",
        "Her lectures are a hot mess. They are extremely unhelpful. Calc 220 is a standard class for many majors and should not be impossible but the way her class is structured is set up for student failure. I do not reckoned taking! There is also and extreme amount of WebAssigns! Her tests are also impossible and no matter how many practice exams you do!",
        "Lena is a great professor in MATH220!! She and her notes are so well-prepared and well-organized! She is also easy to communicate with during class. :)",
        "She is extremely difficult and not helpful. Her lectures are not helpful. All of the test and quizzes are much more difficult than the previous years. She gives a large amount of homework that take a lot of time to complete and doesn't help you better understand the topic. 3 web assigns per week with about 25 questions and weekly quizes.",
        "Just an awful teacher! She barely explains the problem when she is doing it on the board, only repeating what she is writing and not explaining it. She makes the quizzes and exams much harder versions of the previous ones. She should not be the ONLY 220 teacher available (shouldn't be one at all), we need Bob Murphy to teach, not Lena!",
        "Worst professor I've had by far. Hasn't taught 220 much so all of her practice exams and quizzes are clearly those of other professors yet she makes her tests and quizzes much harder instead of making them a similar difficulty to the practice she gives students. All the averages on her tests so far have been pretty low (D's) with no curves.",
        "The average for every test has either been a solid F or a D which is really frustrating since there's no curve (not sure why). Lectures are pretty painful, so I taught everything to myself in this class. Never receive the appropriate preparation for each midterm and the tests always include stuff we've never seen / reviewed. Most frustrating class.",
        "Her tests are much harder than past exam. Never take her lecture again.",
        "Hard grader with more difficult exams and quizzes than the examples she provided. Plenty of homework and quizzes every week. No extra credits at all. Never sign grade with ranking.",
        "WORST calc teacher out there. She fails a majority of her students, probably so you have to pay to take it again. She also has a voice that sounds like when you squeegee glass, but don't be fooled she's not nice. Went in to go over my test (the avg was a 56) and she told me I wasn't trying hard enough when I had studied for a week straight.",
        "The test's count for the majority of the grade and she doesn't curve. The tests are long and there is a time constraint so you need to know how to go quickly. WORST CLASS EVER WORST PROFESSOR!! DO NOT TAKE THIS CLASS, DON'T HAVE HER.",
        "Really sweet, straight-forward, and clear. There's weekly homework, but if you do it and go to office hours for anything you don't understand it's easy. The exams are pretty much all the homework problems from the previous weeks put together.",
        "Thought this class would be hard- it wasn't. She is super nice and the tests are straight out of lecture. Paying attention in class is key- she makes a lot of mistakes but they are very easy to catch if you pay attention. Can get an A pretty easy by going to lecture, doing homework, and studying for 2 hours for each test.",
        "This is a very easy class to skip.  Missing one day will not be the end of the world, and she has video lectures online if you want to go back and look it back up. It would be hard to get a C in this class.",
        "Pretty easy class if you put in the work, but be thorough on the tests because she puts some curveballs if you don't check carefully. Fortunately she gives partial credit but I rather prefer 100 rather than a 98. Grades depend on tests so if you don't study, you won't pass. Study her online notes and past tests to pass",
        "Takes the entire class to get through one practice problem. She is nice, and her tests throw no curveballs. Her teaching is organized and makes sense, and is very nice about people asking questions. She has a mistake about once a week at least but if you pay attention you'll notice when it happens. Make sure to practice the word problem.",
        "The worst teacher I have ever had. puts things on the test that were not once gone over in any lecture or discussion"
    ],
    "tags": [
        "Lots of homework|Participation matters|Group projects",
        "Tough grader",
        "Lots of homework|Test heavy",
        "Lots of homework|Lecture heavy|Tough grader",
        "Lots of homework|Test heavy|Tough grader",
        "Lots of homework|Test heavy|Lecture heavy",
        "Group projects|Skip class? You won't pass.|Lots of homework",
        "Lots of homework|Get ready to read|Lecture heavy",
        "Lots of homework|Skip class? You won't pass.|Test heavy",
        "Lots of homework|Test heavy|Tough grader",
        "Beware of pop quizzes|EXTRA CREDIT",
        "Test heavy",
        "Lots of homework|Graded by few things|Test heavy",
        "Lots of homework|Skip class? You won't pass.|Test heavy",
        "Lots of homework|Participation matters",
        "Lots of homework|Get ready to read|Test heavy",
        "Lots of homework|Tough grader",
        "Lots of homework|Get ready to read|Test heavy",
        "Gives good feedback|Respected|Accessible outside class",
        "Lots of homework|Test heavy|So many papers",
        "Graded by few things",
        "Lots of homework|Test heavy",
        "Test heavy",
        "Test heavy",
        "Graded by few things|Test heavy",
        "Lots of homework|Get ready to read",
        "Graded by few things|Caring|Tough grader",
        "Skip class? You won't pass.|Gives good feedback|Test heavy",
        "Graded by few things|Test heavy",
        "Accessible outside class|Test heavy|Amazing lectures",
        "Graded by few things|Test heavy",
        "Respected|Lecture heavy|Caring",
        "LOTS OF HOMEWORK|Clear grading criteria|GRADED BY FEW THINGS",
        "LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader|TEST HEAVY",
        "TEST HEAVY|GRADED BY FEW THINGS",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Skip class? You won't pass.|Clear grading criteria|TEST HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Respected|Inspirational|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader|Tests are tough",
        "TEST HEAVY|GRADED BY FEW THINGS|Tests are tough",
        "Tough Grader|LOTS OF HOMEWORK|Tests are tough",
        "Tough Grader|LOTS OF HOMEWORK|Tests are tough",
        "Tough Grader|LOTS OF HOMEWORK|TEST HEAVY",
        "Tough Grader|TEST HEAVY|Tests are tough",
        "LOTS OF HOMEWORK|Tests are tough|LECTURE HEAVY",
        "LOTS OF HOMEWORK|TEST HEAVY|LECTURE HEAVY",
        "Clear grading criteria|TEST HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|TEST HEAVY",
        "Respected|LOTS OF HOMEWORK|LECTURE HEAVY",
        "Participation matters|Hilarious|Caring",
        "Tough Grader"
    ],
    "rating": 1.86,
    "initial": "Folwaczny, L",
    "name": "Lena Folwaczny"
}