{
    "comments": [
        "Amazing professor who is an expert in his field. Lectures are interesting and the homeworks are nontrivial but very doable. You learn a lot (especially if you try extra-credit problems) and the professor is very reachable. Exams are easy if you did the HWs.",
        "His Intro to Combinatorics class is amazing! The topics are super fun and interesting, and the homeworks are challenging but fun; not a single problem felt like a waste of time, and the concepts are built upon each other very naturally. He responds in a timely manner if you email him outside of class, and his office hours are very helpful as well.",
        "Very good lecturer. Well-paced, well explained concepts. He also encourages participation. Homework and exams are very manageable. If ever get stuck on homework, go to office hours. Exams are often variations of the same questions on homework (or those in lectures).",
        "Go to lecture and pay attention and you'll do fine. Solid lecturer, material is fairly easy to understand. He goes at a very manageable pace, homework and tests are never overwhelming. Overall does a good job of explaining everything and answering questions. Grading is fair, make sure you are able to write clear proofs.",
        "Tough Exams for 347H.",
        "Take Professor Ford for a class on material he likes: Number theory, proof writting, analysis, etc. Homework will be tough, but exams would be easy but little bit too long. Once in a while he will throw a tough exam at you, but he curves pretty generously. He is inspirational and cares about the student if you go to office hours."
    ],
    "tags": [
        "Lots of homework|Inspirational|Amazing lectures",
        "Respected|Accessible outside class|Skip class? You won't pass.",
        "Respected",
        "Respected|Skip class? You won't pass.|LECTURE HEAVY",
        "Tough Grader|Respected|Skip class? You won't pass.",
        "Inspirational|Clear grading criteria|Amazing lectures"
    ],
    "rating": 4.0,
    "initial": "Ford, K",
    "name": "Kevin Ford"
}