{
    "comments": [
        "Great Professor! This class is extremely well taught and coherent. He makes sure that each new section fits into the big picture of synoptic meteorology. I learned a ton and appreciated that he learns everyone's name and has great/awful puns for every lecture. Definitely recommend!",
        "Jeff was a really nice guy and teacher. If you aren't a science person, he really explains well and gives a lot of real-life examples to help you understand. There are also a lot of super easy assignments to boost your grades which helps a lot. Overall good guy.",
        "Highly recommend this class if you aren't a science person. You can find the answers to all the reading assignments on Quizlet. He really did care about helping students to do well in the course.",
        "Dr. Frame is an awesome professor and is really nice. Meteorology 100 is a pretty easy class and each of the 3 test are only 45% of your grade. The final isn't cumulative, it's just \"exam 3,\" whereas lab and reading assignments found on quizlet are worth 20%+ of your grade which is amazing.",
        "Jeff is the man! His puns be fire and he speaks well so you won't fall asleep (of course there are days you are tired) and you'll be interested. Jeff is the bee's knees and one day you might at least think what it'll be like to an Atmos major. \"What is the answer\" is basically his trademark.",
        "Solid, easy gen-ed. If you are even a little curious about the weather, take this class! I learned a lot and had to study very little to get an A. If you like puns and dad jokes, you'll like Professor Frame.",
        "Frame is a good professor. He is sarcastic and seems to think everyone in the class is an idiot, but it helps because he explains material very well. Exams are easy as long as you study. Go to labs, I found them to be the most beneficial part of the course to prepare for exams. Lots of easy points/extra credit to make sure you get the A.",
        "Prof Frame is great! His class is very, very easy and each lecture has clear explanations and so many puns. He can be snarky/sarcastic. TA review sessions can be VERY helpful if you go to the right one. Reading assignments/iClickers/Labs are easy points. Exams are not cumulative. Easy and interesting class! I highly recommend.",
        "I love Professor Frame. He is so funny and a great lecturer. He keeps it interesting. You need to show up for I-Clicker point and go to lab but if you actually go to everything and pay attention, its an easy A. I suck at math/science and got an A so you can do it!"
    ],
    "tags": [
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Respected|Clear grading criteria|EXTRA CREDIT",
        "Skip class? You won't pass.",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|Amazing lectures",
        "Respected|Clear grading criteria|Hilarious",
        "Tests? Not many|Clear grading criteria|EXTRA CREDIT",
        "Hilarious|Clear grading criteria",
        "Caring",
        "Get ready to read|LOTS OF HOMEWORK|Hilarious"
    ],
    "rating": 4.67,
    "initial": "Frame, J",
    "name": "Jeffrey Frame"
}