{
    "comments": [
        "At first, Freeburg is hard to understand. He rambles, goes off in many directions, and asks very vague questions. But once you get it, you see the connections he is trying to make, it gets very interesting. He pushed me in ways no other prof has before. He is not as scary as these reviews make him - pls give him a try. He is actually a genius.",
        "Rambles on FOREVER. When he's done you sit there wondering if he was even speaking English. We read MAYBE one of the books on the syllabus after he emphasized that we purchase all of them. Hes not afraid to let you know when your questions are stupid and although he asks for your opinion, he will cut you off and make it clear that its irrelevant.",
        "He goes on forever and ever in class. His questions are extremely vague, but somehow he grades as if the prompts were specific. You will not get through all the books he lists in the syllabus because he spends forever in class talking about things completely irrelevant to the book or course. No rubric for grading, he makes things up as he goes.",
        "Along with most other reviewers i agree that this dude rambles a lot. He just goes on tangents and then brings it back and you are left to wonder what the hell just happened. That being said he is a really nice guy and will challenge you. I do feel as if my writing has improved from him. It is definitely not an easy class, but not extremely hard",
        "Freeburg is pretty hard to follow, will give vague prompts and sometimes will jump on you if you ask a dumb question. That being said, he always emphasizes what he'll be grading on, etc. so you're prepared. He's willing to work with you. These classes are tough but you actually LEARN and grow. Always bring your book and do the reading. Recommend"
    ],
    "tags": [
        "Inspirational|Lecture heavy|Tough grader",
        "Skip class? You won't pass.|Lecture heavy|So many papers",
        "Get ready to read|Participation matters|GRADED BY FEW THINGS",
        "Get ready to read|Participation matters|Caring",
        "Participation matters|Skip class? You won't pass.|Clear grading criteria"
    ],
    "rating": 3.0,
    "initial": "Freeburg, C",
    "name": "Christopher Freeburg"
}