{
    "comments": [
        "Fritzsche is a difficult professor. Very educated, but does not instruct well. He has high expectations for papers/analysis but doesnt teach how. He expects the students to know, & if they dont, he is not the most patient or understanding. Denied request for a paper deadline extension, and really tears you apart if he thinks your writing is bad.",
        "Did not know I was signing up for a literature class. Get ready to read nearly a book a week and cry over the lack of cohesiveness of his lectures.",
        "In the context of COVID, he was extremely accommodating and had the class vote on whether or not we wanted synchronous lectures. Other than that, the uploaded lectures/slides aren't cohesive and are difficult to follow, plus we only got graded on our papers, participation, and the final exam.",
        "GOOD LUCK! Fritzsche teaches 498 on the Holocaust in which he is very knowledgable but wayyyyyy to knowledgeable for his own good. He is extremely hard to please and is very unhelpful if you take a little longer to comprehend. Unless you have a doctorate in history or were born during the Holocaust I would STAY AWAY!",
        "Fritzsche should consider being a professor of literature instead of history because he makes you read a novel and write an essay on it about every week. I got lucky to have a great TA, Marco, in 142, since Fritzsche cannot reinforce actual history on his own. I wish he wasn't the only professor for the period I'm interested in.",
        "Prof Fritzsche was the hardest lecturer I've ever had. He is nearly impossible to follow because his lectures are scripted and unnecessarily poetic during class. He talks very fast with a voice that is different than his conversational tone. He seems like a nice guy who is passionate about the material, but he makes it impossible to learn.",
        "I thought Ralphie was bad and then I had Fritzsche. His lectures are extremely hard to follow and sound rehearsed--plus he sounds like he is preaching. He will never stay on a slide long enough for anyone to even read what is on it and he doesn't put slides online or tell you anything about what the midterm/final will be one. TA's are no help.",
        "I took this as my \"easy\" class and the workload was. However, sometimes the subject matter was very heavy (emotionally), but Fritzsche knows how to teach the intense subject matter. It's a very impersonal class and I doubt Fritzsche knew even 1 student;s name, but I recommend it anyways. A lot of mandatory reading.",
        "Professor Fritzsche has a passion for teaching about the Holocaust. He often shares personal stories and gives insight on touchy subjects. The subject matter is not to be taken lightly. Some classes he has cried showing pictures. I can honestly say that I loved his lectures. He has a very dry sense of humor that is very funny if you can sense it.",
        "He is very passionate about The Holocaust and gives his personal opinion every chance he gets. His lectures seem incredibly useless. The only thing that matters is reading the novels assigned and writing genuine papers. Seriously read. I didn't and I struggled big time. Discussions are kinda awkward but attendance is taken in discussion."
    ],
    "tags": [
        "Get ready to read|Graded by few things|Tough grader",
        "Get ready to read|Lecture heavy|So many papers",
        "Get ready to read|Graded by few things|So many papers",
        "Get ready to read|So many papers|Tough grader",
        "Get ready to read|So many papers",
        "GRADED BY FEW THINGS|LECTURE HEAVY",
        "SO MANY PAPERS|LECTURE HEAVY",
        "Respected|Get ready to read|LECTURE HEAVY",
        "Respected|Get ready to read|Amazing lectures",
        "Tough Grader|Get ready to read|SO MANY PAPERS"
    ],
    "rating": 2.1,
    "initial": "Fritzsche, P",
    "name": "Peter Fritzsche"
}