{
    "comments": [
        "He has two faces and couldn't be reasoned with.",
        "Really understanding. 2y ago my class was taught so a movie would connect to the history theme. While yes movie days are fun, these were well thought out, fun, and relevant. I learned SO much in this class. TA's were also smart. He's a caring person & a smart teacher. You do have to read/pay attention though because he expects you to study and work",
        "Stop hating of professor Fu. He is a very generous professor. If you have perfect attendance he will give you 5 EX points. the whole class is based on watching 3 movies, writing (3 seperate) 1 page movie review and then taking a take home final (30% of final grade) and determining if China is developed or not. there are also 2 easy midterms",
        "Prof Fu is a very nice and helpful, though his lecture could be hard to understand if you do not know about Chinese. He is generous in grades, but usually change assignments and forget things. Take this class if you are really interesting in China, and you will learn a lot from this class.",
        "Probably the least organized professor I've had. Changes the grading criteria and the projects assigned seemingly on the fly but they rarely if ever get harder. Lectures are pretty dull but you aren't tested on them, all the grading comes from short papers based on movies we watch in class or the dull books read.",
        "Honestly, this is a super easy history class. We watched six movies for the whole semester. And for each movie, we only need to write for a one-page feedback of the movie. I will definitely take his classes again!",
        "Dr. Fu is legit. He knows so much about the subject and makes the lectures very fun. When I took the class, he changed it up to include more movies and less lecturing, which was awesome. There are a LOT of readings to do, but they are usually not that bad. I liked him so much that I am taking Hist300 this semester, which is  history of  HK cinema."
    ],
    "tags": [
        "GRADED BY FEW THINGS",
        "Respected|Get ready to read|Caring",
        "Respected|Get ready to read|EXTRA CREDIT",
        "Gives good feedback|Get ready to read|Caring",
        "Get ready to read|Participation matters|EXTRA CREDIT",
        "EXTRA CREDIT",
        "Respected|Get ready to read|ACCESSIBLE OUTSIDE CLASS"
    ],
    "rating": 3.71,
    "initial": "Fu, P",
    "name": "Poshek Fu"
}