{
    "comments": [
        "You need to watch the lectures do well on exams, but the content is usually pretty engaging. There's a ton of extra credit opportunities and some quizzes and homework get dropped, so it's not hard to get an A in this class.",
        "Many extra credit opportunities and no need to study very hard, just follow lecture material and you will be fine pretty much fine.",
        "I think the class is really fun and engaging. It also offers a lot of extra credit opportunity which I think is really helpful. This class uses a student notes packet which I like because I learn by writing.",
        "Gist is a professor who wants all of her students to succeed! Her lectures were easy to follow, very stimulating, and she offered many extra credit opportunities. She would also take the time to email each student on their progress throughout the semester, and to root them on. I would definitely recommend taking FSHN 120 with Toni Gist!",
        "This class was structured super clearly. The lectures and material were engaging and relevant to life. If you put in the work, its an easy A. So much extra credit and the lowest grades are dropped. Would recommend to everyone to take!",
        "Toni is such an enthusiastic teacher. If anyone needs a gen ed, this subject is a must! Plus, the knowledge is very applicable and useful for our daily life.",
        "Easy A if you keep on top of your work! Shes one of the best professors ive had at UIUC. She teaches well and gives out so much extra credit. If your able to take this do it.",
        "I currently have Professor Gist and think that she is a solid teacher. Attending her lectures which are not mandatory really help and she is very accessible outside the class. Get your homework done and you should be fine!",
        "Professor Gist is a great professor! She is very caring about her students and goes above and beyond to meet her students needs. She's passionate about her work and cares about what she teaches. I'm not sure why there is a bad rating for her since most of her students don't even have to take the final (I didn't have to) because they did so well.",
        "Professor Gist is the best professor's I have had at UIUC. She is very caring about her students and goes above and beyond to meet her students needs. She is very passionate about her work and does a fantastic job at teaching lectures. If anyone is interested about learning useful things about nutrition and completing a GenEd, take her class.",
        "She is amazing!!!",
        "Great professor. Really passionate about her work and super caring/ understanding.",
        "really good at story telling and making information stick!",
        "Great Person",
        "Loved the class, super easy gen ed! Very accessible and friendly, lectures are interesting and exams are open note. The only required textbook is the notes packet and you just take notes in there during lectures. You don't even need to study to do well as long as you pay attention and come to lecture!",
        "Toni is a very caring professor and the course is honestly super interesting and helpful if you are interested in nutrition. The class is not \"easy\", you do have to do some work to get an A, but it is definitely not super difficult. I recommend this class as a science gen ed course.",
        "Great class. Easy A and interesting information.",
        "Toni is such an awesome instructor, she makes you really enjoy her class and makes going to lectures fun.",
        "Professor Gist is awesome and the material discussed in class is very interesting and applicable. She makes learning really fun and provides countless opportunities to ensure students understand everything. Im not a science or math person, but this class is pretty enjoyable. There are also a lot of easy opportunities to get extra credit as well.",
        "Great class with a great teacher :) loved it and learned lots!",
        "There are really only a handful of things you have to worry about in this class. A weekly assignment based on a video/quiz, a weekly quiz based on a prelecture, 3 exams throughout the semester, and pre-exam reflections. All of the assignments are simple and easy to do with little time. Attendance is extra credit and the notes packet is sufficient",
        "This is one of the best classes I have taken at UIUC! I love the professor as she is always willing to help and answer questions. She makes her online lectures very interesting and relates what you are leaning to real life examples. The course content isn't too difficult to understand as long as you complete the lectures and online modules.",
        "This class is honestly one of the favorite ones I've taken at UIUC. Professor Gist is honestly so accessible and helpful. She genuinely wants you to succeed so she gives you so many extra credit opportunities that help you! Do all of the homework, take notes, watch lecture videos, attend tutoring sessions, and you'll succeed in the class!",
        "I loved Toni! She was amazing! This class offers so much extra credit that allows you not to stress about your grade. The lectures are very interactive and keep you engaged! The class is interesting and I would recommend it to anyone who wants to learn a little more about nutrition and their own health.",
        "She is an amazing professor and gives plenty of opportunities to earn extra credit. Lectures are optional, but you earn extra credit for going to them and they do help to learn the material. The exams are open-book, so if you purchase the workbook created by her, this class is an easy A!",
        "This was a pretty easy class as long as you watched the lectures and filled out the notes packet. Professor Gist is a phenomenal instructor and this class is a breeze. It has a ton of extra credit and multiple dropped assignments and exams! I definitely recommend and as long as you do the mock exams the real ones will be much easier",
        "Take this class!",
        "Professor Gist is an amazing lecturer who entices students whether they study nutrition or not. The material is quite applicable to everyday life as she correlates subject material to practical, everyday experiences. Overall, the course material is quite easy to pick up on, but in order to get an A you need to study and be attentive to lecture.",
        "Very good professor! Easy Gen Ed. Online course was easy with lots a points to help receive an A.",
        "Take this class!!!",
        "She's clearly very passionate about the subject and her class. The class is very well run and the assignments are easy. Easy gen-ed",
        "This is an amazing class! 10/10 would recommend The workbook is required, but you takes notes in it just like you did in high school. If you are satisfied with your grade at the end of the semester (like an A or B) you can skip the final because she drops one of your exams. I took it online but from the videos I could tell Toni is super caring",
        "She was my discussion section leader and she is amazing. She helps so much with the transition to college, and really cares about her students. Even though she wasn't my academic advisor, I feel like I asked her more questions than my academic advisor. She is really helpful with all aspects of college and I definitely recommend her as a teacher.",
        "Toni is a great instructor. She is super nice and caring to all her students. If you need help please don't be afraid to ask her during office hours. Additionally, the class is super helpful to take because it is very applicable to everyday life. Toni and the FSHN 120 teaching team are very sweet people! Definitely recommend taking this class.",
        "Toni is very passionate about nutrition and is always willing to help. I loved attending lecture. I also liked that she emphasized nutrition is not always about being the skinniest person.",
        "I loved taking FSHN 120 with Toni!! She is seriously one of the best professors at UIUC. She gives clear and thorough lectures, and she genuinely wants her students to succeed! As long as you take your notes in the packet and study what is in there, you will be good. 10/10 would recommend this class to anyone (especially as an asynchronous class).",
        "Toni was amazing. She sent out emails regularly to remind of upcoming deadlines, extra credit opportunities, virtual office hours, etc. She responds to emails promptly and truly wants to help her students learn. The class has a weekly video quiz (easy) and a 10 question mini-assignment with information from a video/lecture, and a midterm project.",
        "Toni is by far my favorite professor at UIUC! For her in person course, you got an extra credit point for being in attendance and 0.5 extra credit if you participated. There is a lot of dropped assignments and a dropped exam, so getting an A is very feasible. Lectures are interesting & engaging too! Very clear expectations on the assignments too.",
        "Toni is an amazing professor and anyone who has had her has been literally blessed! Shes funny, caring, and super passionate about what she teaches! Shes always there for you if you need any help! Toni also gave out extra credit for attending class and extra credit for participating. Tests are open student handbook.",
        "Toni is an amazing professor! Her communication is very clear and straightforward and she's always there for students. She is truly one of the nicest and most caring professors I have known. Gives out plenty of extra credit and the lecture material follows the test material so that there are no surprises. Watch the lectures & take notes!",
        "Toni is amazing and one of the best instructors at U of I. She cares about her students so much and would do anything for every single one of them. I am so thankful to have had Toni as an instructor this semester. TAKE THIS CLASS! You wont regret it. She also offers an in person section and I highly recommend it if you are on campus.",
        "100% take this class!! Toni was great and you can tell how much she wants her students to be successful. Tests were open-note, there was plenty of extra credit, and I had enough points that I didnt even have to complete the last unit or take the final to end with an A.",
        "The syllabus is clear, student expectations don't change throughout the semester, and Toni makes it easy and doable for all to succeed in the course given the accessibility of the online format. Great teaching team and instruction delivery!",
        "Honestly one of the best professors I've ever had. I loved going to lecture and was lucky to be in person during the pandemic. She is so sweet and very knowledgeable about nutrition. It's an easy course as long as you do the short quizzes (unlimited tries), assignments, and study for tests. Tons of extra credit opportunities. Very manageable class",
        "As an incoming freshman I was very overwhelmed and Toni made me feel at home instantly. She was always so kind and gave great feedback. Since I was in the online portion, there were no mandatory zooms which I appreciated as the rest of the week was chaotic with other events. She let you utilize notes to take exams and always offered extra credit.",
        "She really just wants people to come out of her class with more nutrition knowledge and makes it really easy to get an A in her class because she wants kids to do well. I am HORRIBLE at science and landed an easy A. Taking it online actually enhanced my class experience rather than weakened it. 100% recommend this class. #ToniStanForLife",
        "A fantastic professor. One of the professors where you can tell she has passion just by listening to a single lecture. Very knowledgeable, and makes attending class fun.",
        "She is the best person I have met in my entire life.",
        "Toni was very sincere and worked very hard to help me get the best grade I possibly could. She is very fun to listen to and follow along with during lectures. There are a lot of extra credit opportunities and as long as you pay attention to deadlines and instructions, it can be super fun and not very hard! I very highly recommend this class!",
        "Very nice. Class fairly easy, but I learned some stuff about nutrition and food safety. Tests were fair.",
        "One of my favorite classes I've taken!",
        "She's a phenomenal instructor who really values feedback. She's also passionate about what she teaches and, because of that, the course is one of the best offered at UIUC. If you want to learn how to be your own nutrition detective, take this course! The knowledge you gain is life changing. Though, its intro so don't expect workout supplement info.",
        "She is amazing and so supportive!",
        "By far one of the most caring profs Ive ever come across. Gives you plenty of ec opportunities and is clear on what you'll be tested on. Class can be a little tough for online kids if you cant go to her in class lectures for ec, but getting an A is doable as long as youre on top of it. Super helpful and approachable and if you need help ask her!",
        "Toni was a great professor who truly cares about her students and makes learning the material very easy. FSHN 120 was an easy A, and she gives the opportunity for lots of extra credit and multiple dropped assignments.",
        "Toni offers text reminders, quizlets, two different study guides per exam, mock exams (my personal favorite), a discussion page, generous office hours... On top of all these resources she is extremely charismatic, shares personal stories, has a sense of humor, and is always reminding us to reach out if we need any help. I highly recommend.",
        "I took FSHN120 online and I can honestly say if you listen and take notes from the powerpoints she posts every week with her talking, you shouldn't worry about not getting an \"A\". There are generous amounts of extra credit given out, which helps make the class easier. Just be sure to stay on top and do the reflection papers before each exam.",
        "Her class was by far my favorite class I've ever taken at UIUC. I took it over the summer, but the time commitment was not that bad. You have to make sure you watch/go to her lectures and do the homework. That's pretty much it. She explains everything really well and is willing to help. Honestly my favorite professor.",
        "She's a very good professor and the class is very easy. I didn't spend much time towards it and learned some useful stuff along the way. Definitely would recommend.",
        "I NEVER write reviews but I had to for Toni. She makes quizlets for the class and even offers her number if we ever need any help. Shes kind and is passionate about the class so its easy to learn from her! Assignments are straight-forward.",
        "The course and professor have met my expectations, even though as a exchange student the topics were easy to understand. Good job, keep it up",
        "Toni has been an amazing professor and super helpful all semester. She is very understanding and respectful of her students.",
        "Loved Toni. She WANTS her students to succeed. I wish I could take this class again. There are few that actually care about their students, but she does. A real gem.",
        "This class is easy, informative, and applicable to real life situations. Attendance is extra credit, so there isn't pressure to attend. I personally rarely went to lecture and got an A in the class (I did have to work a little harder than those who showed up regularly). There are many extra credit opportunities and most don't have to take the final",
        "SHE IS ABSOLUTELY AMAZING! please take this class if youre given the option to. Lectures are amazing and she cares and loves all of her students",
        "She's literally amazing",
        "Great professor. Cares a lot about her students. Extra credit for going to class. I didn't have to take the final or go to class the last two weeks because I already had the A. (: PLEASE take this class! I learned so much too!",
        "Great professor for FSHN 120. Extra credit for going to class and a lot of extra credit chances. Easy content. Will be done after exam 3 if you just turn stuff in. Did not have to take final or go to last 2 weeks of class as I already had an A. No difference between A- and A.",
        "She is such a bubbly teacher who cares a lot for our success. She cares for each of the hundreds of students enrolled in her classes and gives you so many opportunities to get an A in the class. She gives you a lot of extra credit opportunities so take advantage of them! She even personally emails students if she notices them struggling on tests!",
        "Toni is the best professor I've had. She is really enthusiastic during her lectures and makes the material interesting to learn. She really cares about her students and is an easy person to talk to. Class is pretty easy, small workload.",
        "Professor Burkhalter is one of the best professors at the university. As a history major, I really loved this class. This class has so many safety nets that the only way you can fail is by never doing anything. Despite the huge size of the class, Toni works really hard to get to know her students and make it work. Take it for an easy Gen Ed!",
        "Toni is a great lecturer and cares about her students. Class is extremely well organized!",
        "To pass basically you just have to do EVERY single homework assignment (three assingments every week) and then go to EVERY single lecture. You don't even have to do well on the tests. I didn't go to her class the last two weeks of school because apparently I'd already gotten an A. Show up and pass.",
        "Toni was a great professor, but she sometimes treats her class like they are not mature enough to be in college. Besides that, the class was really interesting and an easy A. There is also a doable amount of homework. Toni constantly invites students to meet with her outside of class.",
        "Toni is a great professor! Her lectures are very engaging and she does an amazing job breaking down the concepts so it's easier for students to understand. The tests are super easy if you study the iClicker questions, notes from class, online quizzes, and online mini assignments. I highly recommend taking this class!",
        "Toni is the best! She is so helpful both in and outside of class, and actually makes lecture interesting and go by fast. The workload for this class is light (about 30 min a week), and test questions come straight from her PowerPoint slides. Would totally recommend this class if you need a life science credit, or just an easy class to take.",
        "This class is a great class to take for a science gen-ed. Toni sets you up to do well in the class and she makes sure everyone has the ability to get an A. If you do well on the assignments each week, go to class and actually listen and study for tests you're sure to do well and actually get something out of the class that will impact your health.",
        "I am so glad I I took this class my freshman year. Toni does everything she can to make sure that all of her students succeed- this includes offering a lot of extra credit. If you are looking for a easy and fun life sciences GedEd then this is the perfect option. Just pay attention in lecture and go over some notes and you will be just fine.",
        "If you are looking for an easy class to take this summer/upcoming semesters, I would really recommend taking FSHN 120. It is an interesting class that teaches you about human nutrition. Even if you aren't going into healthcare, it is still a class that is applicable to anyone's life. The workload is not 'too much' at all! Everything i",
        "Her lectures were super interesting and she was very nice. I would take the class again if I could.",
        "I loved Toni. I took FSHN 120 as a blowoff gen-ed, but she made me love nutrition and food sciences. She's an amazing lecturer and the content is actually very interesting. I hope she teaches more in-person classes, so that I can be her student again.",
        "I absolutely loved professor Burkhalter's class. As a humanities major, I found FSHN 120 to be not only incredibly interesting but also very helpful. Professor Burkhalter gives interesting lectures and is beyond fair when it comes to grading. If you are looking to fulfill a gen-ed requirement with a great professor, take FSHN 120.",
        "FSHN 120 is a great class to take! Toni is great at helping students understand content. She is very accessible and uses real-life examples and analogies in class. The work is very manageable and the exams are not hard as long as you study. Toni works hard to create and organize course content on Compass which is great!",
        "I recommend taking this class if you need credit for a life science. Toni, the professor, makes the class enjoyable and lectures are easy to understand. She is very informative on food science and nutrition and a very good professor. If you do the work, it is easy to get an A.",
        "Toni is super passionate and makes learning nutrition enjoyable. Theres a lot of points in the class and you don't have to work too hard to get an A.",
        "I LOVED Toni. The course has 3 assignments every week, they're kinda busy work but they're easy points. She gave out a decent amount of extra credit and she's really fun so lectures were never boring. Exams were moderately difficult, but if you read the book you'll do just fine."
    ],
    "tags": [
        "EXTRA CREDIT",
        "Accessible outside class|Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Clear grading criteria|Amazing lectures",
        "Gives good feedback|Caring|EXTRA CREDIT",
        "Inspirational|Clear grading criteria|Amazing lectures",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Gives good feedback|Lots of homework|EXTRA CREDIT",
        "Respected|Amazing lectures|Caring",
        "Accessible outside class|Inspirational|Amazing lectures",
        "Gives good feedback|Respected|Inspirational",
        "Inspirational|Clear grading criteria|Caring",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Respected|Amazing lectures|Caring",
        "Amazing lectures|EXTRA CREDIT",
        "Respected",
        "Inspirational|Caring|EXTRA CREDIT",
        "Gives good feedback|Respected|Hilarious",
        "Respected|Get ready to read|EXTRA CREDIT",
        "Gives good feedback|Respected|Accessible outside class",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Hilarious|EXTRA CREDIT",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Accessible outside class|Amazing lectures",
        "Gives good feedback|Respected|Accessible outside class",
        "Inspirational|Amazing lectures|EXTRA CREDIT",
        "Respected|Accessible outside class|Clear grading criteria",
        "Inspirational|Clear grading criteria|Caring",
        "Accessible outside class|Amazing lectures|Caring",
        "Respected|Accessible outside class|Amazing lectures",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Gives good feedback|Accessible outside class|Clear grading criteria",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Respected|Accessible outside class|Caring",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "Inspirational|Clear grading criteria|Amazing lectures",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Accessible outside class|Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Inspirational|Amazing lectures",
        "Gives good feedback|Amazing lectures|EXTRA CREDIT",
        "Respected|Clear grading criteria",
        "Respected|Hilarious|Caring",
        "Gives good feedback|Inspirational|EXTRA CREDIT",
        "Respected|Caring|EXTRA CREDIT",
        "Accessible outside class|Participation matters|Test heavy",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Respected|Accessible outside class|Inspirational",
        "EXTRA CREDIT|Amazing lectures|Gives good feedback",
        "Respected|Clear grading criteria|Caring",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Respected|Participation matters|Amazing lectures",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Clear grading criteria|EXTRA CREDIT",
        "Gives good feedback|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Amazing lectures|EXTRA CREDIT",
        "Accessible outside class|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|EXTRA CREDIT",
        "Respected|Hilarious|Amazing lectures",
        "Gives good feedback|Amazing lectures|Caring",
        "Clear grading criteria|Hilarious|Caring",
        "Clear grading criteria|Amazing lectures|EXTRA CREDIT",
        "Gives good feedback|Respected|EXTRA CREDIT",
        "Clear grading criteria|Hilarious|Caring",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Skip class? You won't pass.|Caring|EXTRA CREDIT",
        "Participation matters|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|EXTRA CREDIT",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Amazing lectures|Caring",
        "Amazing lectures|Caring|EXTRA CREDIT",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Would take again",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|Clear grading criteria",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "Gives good feedback|Hilarious|Caring"
    ],
    "rating": 4.98,
    "initial": "Gist, T",
    "name": "Toni Gist"
}