{
    "comments": [
        "This man serves a mentor to many students in the department and runs several classes of his own. The exams aren't tricky and he is always willing to give students the time they need to finish. I can not speak highly enough for this professor. If you don't understand his method,however, good luck, it's all you get and his clarifications are looong.",
        "Professor Gollin extremely available outside of lecture and is very helpful in office hours. However, his lectures veer of track at times. He is also pretty unforgiving and sends terse reply emails that show a lack of respect. The class is designed pretty well but is more work that normal for 2 credit hours. He is a pretty cool guy though.",
        "Prof. Gollin was very good.",
        "Prof. Gollin is a great professor",
        "The class has exams that are pretty much like the practice exams. The grading, although vague, ends up being pretty student friendly. If physics has only been plug-and-chug to you at this point, find time to make his office hours and work on the material! You'll be fine.",
        "Professor Gollin is a wonderful person; he clearly cares about his students more than I've ever seen in a professor. But I cannot stand the way he teaches physics. One can only spend so many hours calculating the relativistic speeds of intergalactic trash compactors before wondering why you're wasting so much time solving such nonsensical problems.",
        "Prof. Gollin cares a lot about his students. If you are struggling, ask to meet with him one-on-one. He will do his best to help you. Homework and discussions are difficult, but the tests are generally manageable and he genuinely tries to give as many As as possible. Super nice guy and probably a genius.",
        "He is very accessible and is willing to answer your questions. Definitely go to his office hours and he'll help you with anything. He might not be the best lecturer, but I really enjoyed having him this semester.",
        "Go to office hours. He is very willing to help students. Awesome guy and has many great stories.",
        "Professor Golling is one of best and more interesting teachers I've ever had. He trully cares abut the student's understainding. Go to office hours and he will help you a lot. He is inspirational, and his exams are easy but require you to know the concepts like the back of your hand.",
        "Professor: Great and caring! Course material: It is easy to pass, but really hard to understand.  The problems lie at the syllabus itself, not with Prof Gollin, 225 is not any better when other professors teaching it.",
        "Course content is not easy but every problems in exam contains  no more than two steps of math.  Awesome professor!"
    ],
    "tags": [
        "Respected|ACCESSIBLE OUTSIDE CLASS|Hilarious",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS",
        "Gives good feedback|Respected|Clear grading criteria",
        "Gives good feedback|Respected|LECTURE HEAVY",
        "Respected|ACCESSIBLE OUTSIDE CLASS",
        "Inspirational|ACCESSIBLE OUTSIDE CLASS|Caring",
        "ACCESSIBLE OUTSIDE CLASS|Hilarious|Caring",
        "Gives good feedback|Respected|Inspirational",
        "Gives good feedback|Inspirational|Hilarious",
        "Participation matters|Hilarious|LECTURE HEAVY",
        "Respected|Inspirational",
        "ACCESSIBLE OUTSIDE CLASS|Hilarious"
    ],
    "rating": 4.58,
    "initial": "Gollin, G",
    "name": "George Gollin"
}