{
    "comments": [
        "Professor Gulley is a tough but fair professor. He gives plenty of opportunities to earn a good grade in his class which would otherwise be insanely difficult. He posted lecture slides online, but arriving to class will benefit you. He's known to give extra credit randomly in class. Wouldn't have passed with any other professor.",
        "This class was super interesting BUT I DO NOT recommend this course!! because it was just too much stress for no reason. The professor was also super intimidating idek maybe it was the pandemic. Do not recommend.",
        "The material itself was not the worst however he was all over the place at time. He would explain things wrong and then essentially would go oops, its the other way and not be specific. If lectures are prerecorded, why not go back and fix it? Also the exams were poorly structured, so even if you knew the material you could get a poor score.",
        "Absolutely disrespectful: the type of prof who, when presented with a need for accommodations, says that you'll be taking a different version of the exam in a threatening manner. Unnecessarily tough grader: nearly assigns random grades to essays. Seconding another commenter, where the content is interesting, but Gulley obliterated that interest.",
        "This was a hard class but with online and covid tests and quizzes are all open note. So as long as you take really good notes with a lot of detail youll do great and wont when have to study. Buuuttt emphasis on those really good notes. And control F.",
        "Truthfully, I enjoyed every single lecture Prof. Gulley gave. There were times where I didnt understand the material but went to office hours. Prof. Gulley was super nice even if I asked dumb questions. I wish I went to office hours more but honestly such a nice guy. The exams Imo were fair. You just really have to study even if its open note.",
        "Legitimately one of the worst professors Ive ever had. Material is straightforward, but there is A LOT of it and too little time on exams. Grading is very harsh. To top it all off, there were multiple instances of cold and unsympathetic behavior towards students on his part. Idk why past students felt otherwise, maybe in-person was diff? Stay away",
        "413 is such an interesting class. Do not take if you are not interested in the subject. Great professor. He will push you to be the best student you can be. Some students say he is \"disrespectful\", but in reality he is honest, blunt, and very helpful. He promotes the best in everyone. Take the time to talk to him and ask questions! Be passionate!",
        "He is a tough grader and has high expectations, but he pushes you to be a better student and wants you to know the material. If you take the time to talk to him, he will give great advice and will be honest about what it takes to \"make it\". He is a great professor and he is passionate about the subject matter. My favorite professor of all time!",
        "Many students complain about Dr. Gulley, but he is a reasonable human being that wants the best for his students. He is a blunt \"tell it how it is\" type of professor and I personally think that is great. He is passionate about what he does and is so knowledgeable about the subject. He does not deserve all the hate he gets. Amazing person and prof.",
        "If you take this course, definitely prepare to study and work for it. I think the online exams being open notes resulted in him making the time given difficult, but it also resulted in people studying less, which proved to be the perfect storm. He was extremely rude and disrespectful to multiple students though - I would never take his course again",
        "This is a very challenging course as far as I know. I did well on PSYC 210, so I didn't expect PSYC 413 to be too hard. Please take serious consideration when selecting this class cos this prof. made the course much much harder because of the pandemic.",
        "I cried multiple times while I was taking this class... That's it.",
        "This class is perfect if you want to go into medicine or therapy. Dr. Gulley is very straightforward and the exams are open note. As long as you watch the lectures and take detailed notes, you will do well. The information is also very interesting and applicable to the real world.",
        "Maybe he is friendlier in person but he came off extremely & unnecessarily rude via emails & course Q&As. I would not recommend this course online. No homework or EC. There is not enough time to even complete exams. Half is fill in the blank with up to 3 blanks/question & two 25 point free responses that he'll give 2 points on for 10 sentences?",
        "I was so excited to take this class, and I am SO DISAPPOINTED! He gave so much material, and sometimes the lectures looked like they were meant to for other classes as material did not match up. He was somewhat condescending in his emails, and blamed students for low grades. Half of the people failing the exam should be a sign of something wrong!",
        "Prof. Gulley is quite an ineffective teacher. The content of this course was interesting, but he seems uninterested in the well-being of his students and does not seem to care about teaching this course. Exams were too long for the allotted amount of time, essays graded harshly. I do not recommend taking this course.",
        "Never been one to publicly rip on ANY teacher I've had in the past but I'd really like to give it up for Mr. Joshua Gulley. Completely invalidated my poor mental health as I struggled with being isolated during the pandemic which took a toll on my school work. Was told verbatim \"that's tough\". Clearly just here to collect a paycheck, DONT BOTHER.",
        "He's unapproachable, doesn't seem to like students, and is honestly just rude. He also made things so much harder during the pandemic and blames students for struggling in his class. His time limits on exams are ridiculous. Would never take again.",
        "The pandemic made everything difficult, but Professor Gulley really doesn't have to make the course harder because everything is open book now. I think the class is amazing, but the amount of information given and the time allowed for the three exams is making me really stressed. I studied, but honestly, I don't think I know how to anymore.",
        "Loved him. He would give the entire multiple choice question bank before the exams so you can basically memorize the answers, as well as the free response questions bank (but without the answers). He was kind and easy to talk to during office hours. There are 2 big extra credit opportunities, as well as several attendance extra credits."
    ],
    "tags": [
        "Get ready to read|Lecture heavy",
        "Graded by few things|Tough grader",
        "Test heavy|Tough grader",
        "Lecture heavy|Tough grader",
        "Test heavy",
        "Amazing lectures|Lecture heavy",
        "Test heavy|Tough grader",
        "Gives good feedback|Get ready to read|Lecture heavy",
        "Gives good feedback|Get ready to read|Lecture heavy",
        "Gives good feedback|Lecture heavy|Tough grader",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Skip class? You won't pass.",
        "Lecture heavy|Tough grader",
        "Accessible outside class|Graded by few things|Clear grading criteria",
        "Test heavy|Lecture heavy|Tough grader",
        "Test heavy|Lecture heavy|Tough grader",
        "Test heavy|Lecture heavy|Tough grader",
        "Test heavy|Lecture heavy|Tough grader",
        "Tough grader",
        "So many papers|Tough grader",
        "Accessible outside class|Lecture heavy|EXTRA CREDIT"
    ],
    "rating": 2.48,
    "initial": "Gulley, J",
    "name": "Joshua Gulley"
}