{
    "comments": [
        "He is an excellent professor and his course is organized extremely well. But because he asks questions that require you to really use your head, students believe he is being unfair to them. This kind of attitude not only holds you back from learning but from enjoying this class - and really was enjoyable for me! ALSO he has a beautiful voice.",
        "Hes not a bad person but the only thing that got me a good grade in this class was the fact that I watched Hummels lectures to learn the content from my friends laptop. His lectures are not helpful. He expects you to read the pre-lecture slides but theyre so disorganized. The exams arent hard but the wording sometimes isnt correct English.",
        "I would avoid Dr. G if possible. He is rude to students who ask questions in class (& during lecture with 300+ people, he called out students by first and last name when they got the wrong answer). His exams are not relevant to his practice problems. The only reason that I didn't fail was because I took the merit portion with a great ta.",
        "His class is really test heavy. If your not getting perfect scores on your homework and quizzes go to office hours and tutoring do whatever you can to get help because failing those test will hurt your grade.",
        "Lectures are heavy, you really need to focus to understand the material from him during lecture and thats only possible if you are on Adderall. Exams are really tough so get ready to spend countless hours of self-learning. Personally, I didn't learn much from him it was mainly through book, youtube, TA and worksheet. Avoid him if you can.",
        "Dr. G does care about his students. He is flexible with grading and lets you argue back points. Do this bc midterms are often unfairly tough. He curves but not enough for most. Lectures aren't good. Prepare to teach yourself a lot of material. Take notes, do his practice problems, get a good TA (Daniel Gray), and be prepared to work for your grade",
        "He is available outside of class, but his tests are very difficult and they bring down your grade. His explanations of lectures are very confusing and he uses analogies that don't make sense.",
        "Dr. G is amazing because he really wants students to be successful in his class. He offers up to 25 extra credit points and has lots of office hours and appointment times! Chem 102 is hard no matter the professor. Dr.G just makes you really work for it. Tests are tricky and hurt your grade the most. Lazinessbad grades. Proceed with caution :)",
        "Great and intelligent guy but awful at explaining things. Dont go to lecture without knowing what hes talking about beforehand or just dont go at all. Exams are full of trick questions and not straightforward at all like other chem exams. I got <55% on every single test that semester but curve brought me to a C+ in class so thats good I guess",
        "Honestly do all the practice midterms and you should be fine (engineering majors)",
        "Dr. G is a good professor, regardless of the common word that he makes things difficult. Those who complain are just narrow-minded and can't accept the difficulty. His lectures are very easy to pay attention to, if you read the content before going, as you're supposed to. Most people are used to slacking off, which are the same people who complain.",
        "This is a hard class, and Dr. G makes it harder. He is harsh and unapproachable. It seems he has no regard for the mental health of his students. His exams are extremely difficult, and the phrasing of the questions makes even relatively simple questions indecipherable. Don't take his class if you don't have to.",
        "Good lectures, basically tells you everything you need to know for the midterms. It's not an easy A, but he will tell you everything you need to know for the test.",
        "Dr. G definitely has a very challenging Chem 102. Although it was incredibly challenging, it was so helpful and made every other chem class so much easier. I learned so much in this class because you actually need to learn the concepts and understand the why. Office hours are a huge help because he takes the time to offer lots of guidance.",
        "Chem 102 is a weed out class, but Dr. G is likely to be your best option. Lectures are decent, but you want to go to office hours for an A. Tests frequently are just different enough from the class material to really kick your butt. Good news-I averaged a 60 on midterms and finals, and ended with a C+. It might not be pretty, but you'll pass.",
        "CHEM 102 is not an easy class, regardless of who is teaching it. However, Dr. G is a professor who makes it enjoyable and understandable. His lectures can be very confusing. However, he does have open door office hours and responds to requested office hours very quickly. He often helps you in office hours on what to study for the exam.",
        "This class was pretty hard. What he teaches in lecture seems easier compared to what's on the exam. His analogies are helpful sometimes. He's a pretty new professor, so some exams can be easier than others, but overall they are pretty hard. At the end of the semester, since almost EVERYONE failed the final, he added a bunch of extra credit points.",
        "He is a very good guy who genuinely cares about his students. The tests are very hard and challenging including the finals but he curved them at the end to adjust low grade. A solid choice over Tina Huang because he teaches well. He makes you suffer in the semester but pulls through in the end. 9/10 would take again.",
        "Lectures don't give enough information about the content. The exams are rarely curved and brutal, filled with various twists to the point where it's less about content and more about reading past intentionally poorly worded questions. He does want his students to succeed, but he makes it extremely difficult to do so. Avoid if possible.",
        "Dr. G is a great professor. Chem 102 is going to be hard regardless but he makes it OK. He tries his best to help all his students and understand the concepts. If you put in the work to understand the topics and do extra practice, you will get an A in this class.",
        "His lectures were sometimes confusing if you don't read the chapters ahead of time, but he always offered to set up appointments for office hours if anyone needed help. Of course, you have to put in the work to get a good grade. His tests are reasonable as long as you study and read the questions carefully during the test.",
        "One of the worst professors I've ever had. Do everything you can to make sure you do not have him if you want a good grade in chem. Tests are almost impossible and are nothing like the practice exams.",
        "Hes very condescending when students do badly on his difficult tests, even though he admits to making them hard on purpose. Also, aftee a student said he used too many stories/metaphors in his explanations and it was confusing, he started to use even more stories.",
        "He has a genuine desire for his students to succeed. However, the class is very difficult. The quizzes and practice exam questions do not adequately prepare you for the tests. Be prepared to do a lot of additional practice problems and reteaching yourself the concepts.",
        "His tests are very difficult and dont match the content we learn in lecture/discussion at all. Despite students doing very poorly on his tests, he simply tells us that were not thinking hard enough, and looks down on students who do poorly. It seems that the positive reviews are from previous years, when his class was much easier.",
        "Reads off slides which he copies straight from the textbook. But then he puts in useless anecdotes and train-of-thought concepts that make no sense and makes the class nonsensical. His exams are twice as hard as any homework, quiz or online assignment. Bad teaching, worse prep. Also no retakes - not close to as good or lenient as other professors.",
        "His lectures were extremely convoluted and at sometimes seemingly philosophical. He does not explain the material on which he tests on because he expects you to understand the \"story\" behind the content and assumes that most of his questions can be solved using basic logic.",
        "Don't have anything to say",
        "He is a genuinely nice person who really cares about his students. HOWEVER, his lectures are the worst. He doesnt explain things well and I always leave lectures more confused than ever. He gives out curves, but I really had to study a lot on my own to get the grade I did. At one point I stopped taking notes because it was impossible.",
        "Dr.G is not a great teacher. His lectures were basically useless and they never helped me in discussion. I often felt like it was my first time seeing test question on the test. His quizzes are near impossible the first time around but he does do retakes. The only reason I'm going to pass the class is bc of all the EC. If you can take Hummel do it.",
        "He is very caring and wants everyone to do well but his lectures make absolutely no sense. I can't follow his train of thought and most of the time left lectures more confused than when I went in. He has a lot of office hours so use those but beware of his tests that are never even close to the review guides especially the final.",
        "Dr. G is an easy A. If you put in the work, it will directly reflect in the grade you receive! Tons of extra credit, nearly impossible to fail. Also, significantly easier than all the other chem 102 teachers!",
        "Dr. G is an extremely caring fellow  he bent over backwards for his students. I do not regret taking him over Hummel. If you can  take him! Loads of wiggle room to ensure you get a good grade. This does not mean he is easy, though. Watch out for his midterms after the first one! They get tricky...",
        "Dr. G is one of the most caring teachers I have ever had. He always puts his students first and is super nice during office hours. I will say through that his tests are quite difficult and sometimes the material on the exams is not thouroughly covered during class. Overall a solid prof. but get ready to work for the grade",
        "Strongly recommend. Very caring about his students. Has many extra credits. Great review session before final.",
        "Honestly one of the greatest people you can talk to. Cares about all his students even though the course itself is very difficult with a very low average GPA. Lots of people complain about the pace of the course due to it involving a lot of various topics, but honestly very manageable as long as you work hard.",
        "Great lecturer, sometimes goes off on tangents though, tries to be fair in terms of grading, good amount of extra credit opportunities.",
        "terrible. impossible to understand his trains of thought in lecture, and then half the exam has nothing to do with anything that was covered in lecture or from worksheets- and you're supposed to just know it, OR occasionally mark E on the scantron if it was something he expected you to not know!",
        "Thought i got a 12% on the 2nd exam, and he was extremely helpful.. found out 5 days later i got a 60% instead. He is very lenient extremely professional and he loves helping students. Hes very considerate of your progress in his class. Exams arent impossible, and he is very straight up about exam difficulty. Recommend him highly",
        "Pretty cool guy but the material you end up being tested on is near impossible to fully study whether out of the book or past exams (which there are very few). He rarely curves and just taking notes from his lectures will not prepare you for the exams.",
        "Terrible. Teaches a weed out class, but believes no one should be left behind, then has to increase the pace of the course to twice that of other classes in order to catch up. Puts material you havent learned yet on tests and expects you to answer E) Not enough information. Goes off on random tangents about how he is doing this for your benefit.",
        "He will make sure everyone fully understand's whatever topic you guys are covering and then he moves on. Class gets a little behind at first."
    ],
    "tags": [
        "Skip class? You won't pass.|Clear grading criteria|Amazing lectures",
        "Hilarious",
        "Lots of homework|Test heavy|Lecture heavy",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Test heavy|Lecture heavy|Tough grader",
        "Accessible outside class|Participation matters|Test heavy",
        "Skip class? You won't pass.|Lecture heavy|Tough grader",
        "Accessible outside class|Test heavy|Clear grading criteria",
        "Test heavy|Tough grader",
        "Respected|Skip class? You won't pass.|Test heavy",
        "Respected|Hilarious|Amazing lectures",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Gives good feedback|Respected|Amazing lectures",
        "Accessible outside class|EXTRA CREDIT|Tough grader",
        "Test heavy|Hilarious|Tough grader",
        "Accessible outside class|Test heavy|Caring",
        "Tough Grader|Skip class? You won't pass.|TEST HEAVY",
        "Tough Grader|Respected|EXTRA CREDIT",
        "Tough Grader|Skip class? You won't pass.",
        "Respected|Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS",
        "Get ready to read|Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS",
        "TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|ACCESSIBLE OUTSIDE CLASS|TEST HEAVY",
        "Tough Grader|Get ready to read|TEST HEAVY",
        "Tough Grader|TEST HEAVY",
        "Tough Grader|Get ready to read|TEST HEAVY",
        "Respected|Skip class? You won't pass.|Amazing lectures",
        "TEST HEAVY|EXTRA CREDIT",
        "LOTS OF HOMEWORK|ACCESSIBLE OUTSIDE CLASS|TEST HEAVY",
        "Hilarious|TEST HEAVY|Tests are tough",
        "Gives good feedback|ACCESSIBLE OUTSIDE CLASS|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Caring|EXTRA CREDIT",
        "Respected|TEST HEAVY|Caring",
        "Respected|ACCESSIBLE OUTSIDE CLASS|Caring",
        "Inspirational|Caring|EXTRA CREDIT",
        "Gives good feedback|Skip class? You won't pass.|Amazing lectures",
        "LOTS OF HOMEWORK|TEST HEAVY",
        "ACCESSIBLE OUTSIDE CLASS|Hilarious|EXTRA CREDIT",
        "TEST HEAVY|GRADED BY FEW THINGS",
        "Skip class? You won't pass.|TEST HEAVY|LECTURE HEAVY",
        "Inspirational|Hilarious|Amazing lectures"
    ],
    "rating": 3.0,
    "initial": "Gunasekera, M",
    "name": "Mutha Gunasekera"
}