{
    "comments": [
        "I was a little nervous heading into ACE 100 after looking at these reviews. However, I was pleasantly surprised! The lectures weren't the most exciting, but Professor Gundersen was nice and laid out everything we needed to do clearly. The lectures were posted online if you didn't make it to the Zoom which was very convenient.",
        "I took it in Summer 2020, so i don't know about regular semesters, and it only has 4 quizzes in total. Homework are based on textbook, and the textbook is really helpful , so definitely take a look when listening to the lectures and doing homework. She gives extra credit simply coming to at least one office hour. Such a friendly professor.",
        "Super patient, will answer any question that you have. I didn't read the instructions correctly on her extra credit and she still gave me credit! So nice about everything and she grades super fairly and is easily accessible for questions related to exams or homework. I honestly can't say enough good things about her!",
        "Took her statistics class and she was very nice and caring. Lectures aren't really mandatory but she gives a lot of extra credit that can be added towards your exams. Class was fairly easy, as the online homework problems are all accessible if you have Chegg.",
        "Horrible lectures, horrible exams, horrible teaching-style. Don't go to her lectures unless you want a free napping period, they're useless anyways. Textbook teaches better than she can. I haven't been to lecture since the first midterm, and, trust me, you'll be better off not going.",
        "Lisa Gundersen makes you buy the Cengage website because she is too lazy to create her own homework. The homework on Cengage is not supported by her notes. During lecture, she uses terrible analogies that make her points even more confusing than they may already be. One could even she does not even understand the material she is teaching.",
        "Never again.",
        "It was difficult to focus in the class as the lectures are quite dry. I took it when attendance was not mandatory, and stopped attending when I had a D in the class. My final grade went up to a B+ when I did that.",
        "She didn't follow the syllabus because she spent five days talking bout one thing. She's very annoying to listen too and its hard to sit through the class. You don't have to show up to pass even though she says you need to. Just read the textbook and you will learn more from that than you will from her.",
        "Her lecturers are by far the most boring I have encountered. She is not good about covering actual exam material in class. There is a $70 charge to use Aplia and a crummy eText because she can't use blackboard like everyone else. She had to make attendance mandatory because everyone skipped her class because it's a waste of time.",
        "Look at the lecture slides online before you waste your time going to class. There's really no point unless there are multiple graphs in the slides to fill in. She spends a lot of time going over one problem... an unnecessary amount of time and it gets old. Aplia is so much harder than the actual exams"
    ],
    "tags": [
        "Graded by few things|Clear grading criteria",
        "Gives good feedback|Lecture heavy|EXTRA CREDIT",
        "Lecture heavy|Caring|EXTRA CREDIT",
        "Test heavy|Clear grading criteria|EXTRA CREDIT",
        "Get ready to read|Graded by few things|Test heavy",
        "Graded by few things|Test heavy|Tough grader",
        "LOTS OF HOMEWORK|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "LECTURE HEAVY",
        "LECTURE HEAVY",
        "GRADED BY FEW THINGS|LECTURE HEAVY"
    ],
    "rating": 2.45,
    "initial": "Gunderson, L",
    "name": "Lisa Gunderson"
}