{
    "comments": [
        "Class would often go over the ending time. Absolutely amazing lecturer, especially in regard to social justice issues. Honestly, I wish she would have lectured more. Way too many fruitless discussions. A class where you're supposed to feel a bit uncomfortable, I think, but doesn't put in enough groundwork into supporting that. (Esp. on enby issues)",
        "In one of my essays, I wrote the opinion that social justice teaching may be difficult to implement in math classes - I received the response to go back and reread the source that I totally understood. This class is hypocritical and does not encourage 'brave spaces' when asking questions and taking on opinions about the class itself.",
        "do not take this class if you want to have a good semester of college. \"mATh iS noT A VeRb!\"",
        "This class was very lecture and reading heavy. I have never met a professor with such strong opinions about how she defines racism, race, gender, etc. She is not open to any other opinions besides her own. Also MATH IS NOT A VERB...",
        "no words. i hated this class",
        "She wasn't culturally competent and wouldn't budge to move over for perspectives from other cultures.",
        "worst. class. ever. she made everyone in the class feel inferior to her opinions and I was personally too scared to speak up in case she shut me down.",
        "She literally gave me anxiety. She calls students out during class and you will get in trouble if you do not know the material. She doesn't care about anyone else's opinions except her own; she did try to incorporate opinions from other students this semester. Comparing older students experience and mine with her, they are similar. worst teacher.",
        "Dr.G was one of worst teachers I have ever encountered. If this class isn't mandatory for you, do not take it. She is not empathetic and only sees things from her perspective. She also assigns a lot of work every week, but understandable because it counts for the advanced composition credit. I would never consider her to have as a teacher again.",
        "Social Justice NIGHTMARE.",
        "Good professor. She lectures a lot and asks a lot about opinions. The class pushes you outside of your comfort zone",
        "I came to this University because of a talk Dr. G gave at a conference. She gave one of the most poignant descriptions of funds of knowledge as it plays out in mathematics learning. I have taken 3 of her courses now. In each, I have had to work really hard, but I have received meaningful feedback. She makes her students the focus of everything.",
        "Listened to her at the NCTM Regional. I will disclose that I am of color. Mathematics is a Noun not a Verb. Gutierrez proclaims herself as a scholar who argues mathematics operate as whiteness and I was quite embarrassed that I shared the same intellectual space with someone who is confused about math. Students benefit from truth not fiction.",
        "She does not care about the students or their opinions. Free thinking is not encouraged. She focuses about spreading her ideologies more so than teaching the subjects. Her ideas are not sane; she talks about privilege all the time. These classes are filled too much with her personal ideologies.",
        "I find that when professors are skilled they take the time to think through how to facilitate discussions in class, make the class appropriately challenging by giving readings that are meaningful. Thank you for not treating me like a robot like people who want a degree without doing any work.",
        "Blew my mind away. I've never thought of how education and teaching were part of system designed to stop children from questioning. Through this class, I learned so much about how to authentically empower children, how to engage in deep conversations, and not to be scared of talking about race, gender, and power.",
        "She's great!",
        "Dr. G is great and culturally competent! Her class had clear grading criteria & your grade was based on if you tried to participate or not. She made her class a space for all expressions and opinions while still remaining true to the idea of equality in education. Understanding of different perspective, but not allowing for bigotry, Dr. G is a gem.",
        "Dr. G professes social justice as a constant practice, and stemming from the understanding of other's circumstances. She repeatedly holds us after class ends, making rude comments to the students who leave, including insulting a student who had to leave class to go to her job. She takes student suggestions but is condescending while practicing them",
        "Rochelle basically turns lectures into discussion. Instead of taking the time to prepare a PowerPoint or basic points on that weeks readings that we had trouble with, she has the students lead a discussion and even has them be the ones to write on the board. She gets payed to have students do her work basically. A lot of readings and no clarity..."
    ],
    "tags": [
        "Get ready to read|Group projects|Caring",
        "Lots of homework|Get ready to read|Group projects",
        "Lots of homework|Get ready to read|Participation matters",
        "Participation matters|Skip class? You won't pass.|So many papers",
        "Lots of homework|Skip class? You won't pass.",
        "Skip class? You won't pass.|Group projects|So many papers",
        "Lots of homework|Get ready to read|Participation matters",
        "Skip class? You won't pass.|Lecture heavy",
        "Lots of homework|Skip class? You won't pass.|Graded by few things",
        "Skip class? You won't pass.",
        "Inspirational|Caring|GROUP PROJECTS",
        "Gives good feedback|Respected|Get ready to read",
        "Hilarious",
        "Tough Grader|Hilarious",
        "Gives good feedback|Respected|Inspirational",
        "Respected|Inspirational|Caring",
        "Participation matters|Inspirational|Amazing lectures",
        "Participation matters|Inspirational|Amazing lectures",
        "Get ready to read|EXTRA CREDIT|GROUP PROJECTS",
        "LOTS OF HOMEWORK|EXTRA CREDIT|GROUP PROJECTS"
    ],
    "rating": 2.4,
    "initial": "Gutierrez, R",
    "name": "Rochelle Gutierrez"
}