{
    "comments": [
        "Every bad review here is accurate. If you're required to take one of her classes, I recommend professor Leonard on YouTube. He's hard carrying me through the class right now. Watch the Guzman lectures, but be careful of the many typos (lectures aren't even her). Read the textbook after the lectures and definitely do the hw. Worst professor ever.",
        "I think I could be the prof of this course too. You just need to use other professors' video as lectures, give TAs the worksheets years ago and let them answer all questions then throw some exams and get students average 50/100. Btw, the exam is far from what is taught in class",
        "I made this account specifically for this. There is not a single positive thing to be said. Doesn't answer emails, lecture videos are incomplete and not her own. Teaching from Chicago. Annoyed when I do reach out. Test material not at all what was covered in class. I'm being deprived of an education. This is the worst teacher I've had in my life.",
        "Imagine Billy from Billy and Mandy teaching the class. Got it? Now imagine Billy got hit in the head with a school bus.",
        "Homework is pretty much but it is easy so kind of waste time. Tests every two weeks and you need to prepare well for it. Lectures is fine but sometimes mistakes happened.",
        "Nice professor!!! I think she is really good at teaching and few homework to do. Midterms are pretty easy if you study per hour a day. She also replies emails very fast. I think she is a good professor.",
        "lectures are cheeks ngl its not even her in the lectures tho so i guess i cant be mad at her bc she isnt involved in the class whatsoever but yeah every review below me is 100% accurate and im sure the ones following mine will also be Well the years start coming and they dont stop coming Fed to the rules and i hit the ground running didnt make sen",
        "Whats taught in class is nowhere near whats asked in the exams, the lectures are useless and its not even her, she just uses other professors lectures.",
        "231 no",
        "The stuff we learn during the online lectures is nowhere near the same things that we have on the online homework and the test. There are insane numbers on her no calculator tests and I have absolutely no idea how she expects us to do the problems no calculator with these inverse trig functions and square roots.",
        "very hard exam",
        "******* professor that never replies to emails and she never teaches online but downloading other people's online lectures to ask us to watch.",
        "She goes fast in lectures, but she NEEDS to. It's calculus. If you're still confused or couldn't read the board, GO TO HER OFFICE HOURS. Her explanations may be lengthy but it's because she's good at what she does and cares about your understanding. If you ask for help, she'll give you that and so much more until you get it. She's a great person.",
        "Um, okay, so... if you skip lecture, ya'know, you wont pass, m'kay? The problem... the problem is... that lecture is, that is to say..., lecture is, infuriating, ya'know? Kay... so , in other words, she talks like this, kay? And takes 2 minutes... that is, 2 minutes... to say what could, in other words, mkay, be said in 1.",
        "Rosemary Guzman might be and most likely is the worst professor at U of I. If you can, immediately look to switch to a different professor's lecture. Her lectures feel like a fever dream. She goes way too fast and overcomplicates straightforward topics. The class ends up being twice as hard and an uphill battle. Worst teacher ever.",
        "So Terrible",
        "Rosemary made me hate myself multiple times throughout the semester. The lectures, if you're new to calculus, might help, but I quit showing up after the first two weeks. They're useless. You'll learn anything important in your discussion section. Study thoroughly because the tests will be hard problems.",
        "Goes through lecture way too fast, she'll be up there sweating and out of breath from writing too fast maybe thats a sign that she should slow down lol",
        "I was frustrated with how Guzman would constantly take class into overtime, and I had another class to get to. And she would say something important for a quiz or homework problem in that overtime.",
        "If you take her class don't bother even going to lectures. By far the worst teacher ive ever seen. All she does is mumble and talk to the chalkboard. Best way is to learn topics is through youtube. Pretty big curve at end of class.",
        "Doesn't make any sense in lecture, unorganized and sloppy.",
        "While the information in lecture is very important, Professor Guzman is incredibly hard to follow and I ended up teaching myself this class through the book and online resources. I would highly recommend taking this course through another professor since she clearly does not care about teaching or if the students understand the material.",
        "She is by the far the wort professor ive ever seen",
        "The professor knows her stuff. The students do not. That remains the theme of this course throughout the entire semester. Don't bother showing up to lecture, she generally doesn't even teach the material correctly (think solids of revolution). Pray that your TA knows their stuff because if you plan on learning. Or even better, take MATH220 the A",
        "No point of going to the lectures, you really don't learn anything. The only place I actually learn for this class is during the discussion sessions. Huge shout out to my amazing TA. The professor is just not a good teacher, it's pretty clear she understands the material but don't know how to teach them. Be prepare to do a lot learning by yourself.",
        "Professor attempts to cover too many topics at once. Since the professor is unorganized and not able to clearly explain concepts you must put in a lot of out of class time. Material itself is not difficult but prof specific test grading rubrics make it almost impossible to get an A. Even with previous calc experience TAKE A DIFFERENT PROFESSOR!!!!",
        "One of the worst I've ever had. Skipping classes and learning by yourself would be the wise thing to do. She makes things more difficult than they should be and she failed to explain herself clearly. She uploads her course note online so that you might have an idea of what she's trying to teach. If you're with Guzman, be prepared to teach yourself.",
        "If her job is to make you not like math, she passes woth flying colors. She constantly talks to the blackboard, goes way to fast in class, and always runs out of time before teaching topics needed for homework. Definitely just skip class and teach yourself.",
        "She's by far the worst teacher I have ever had. She teaches to the blackboard and goes so fast. She's not very loud and doesn't use the microphone system (it does work because the professor before her lecture would use it). She makes learning this already difficult material even harder. I realized I had her for math231 and immediately switched out.",
        "This class was challenging to begin with and by having this \"professor\", it made it 10x worse.  She does not know how to lecture one bit.  She speaks into the blackboard and does not even ask the class if they have any questions.  Be prepared to teach yourself the course and try to ask your TA if you have any questions.  If you can, don't take her!",
        "To be 100% honest Professor Guzman was the worst teacher I've ever had. She only talks into the blackboard and is very difficult to follow.",
        "She was boring, awful, and very confusing. I took Calc I and Calc II before taking it with her, so I skipped lectures after the first few ones because of how confusing she was. Do yourself a favor, just teach it yourself."
    ],
    "tags": [
        "Lots of homework|Test heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Skip class? You won't pass.|Test heavy",
        "Skip class? You won't pass.|Test heavy|Tough grader",
        "Lots of homework|Test heavy",
        "Gives good feedback|Respected|Get ready to read",
        "Lots of homework|Test heavy|Hilarious",
        "Test heavy",
        "Lots of homework|Lecture heavy",
        "Skip class? You won't pass.",
        "Test heavy|Group projects",
        "Lots of homework|Tough grader",
        "Gives good feedback|Accessible outside class|Caring",
        "Skip class? You won't pass.",
        "Get ready to read|Test heavy",
        "Test heavy|Lecture heavy|Tough grader",
        "Graded by few things|Test heavy|Tough grader",
        "Get ready to read|Skip class? You won't pass.|Lecture heavy",
        "Skip class? You won't pass.|Lecture heavy",
        "Lots of homework|Test heavy",
        "Graded by few things|Test heavy",
        "Get ready to read|Test heavy|Lecture heavy",
        "Get ready to read|GRADED BY FEW THINGS|LECTURE HEAVY",
        "Tough Grader|TEST HEAVY",
        "Tough Grader|TEST HEAVY|GRADED BY FEW THINGS",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY",
        "Tough Grader|TEST HEAVY",
        "Inspirational",
        "Get ready to read",
        "Get ready to read|LOTS OF HOMEWORK|Clear grading criteria",
        "LOTS OF HOMEWORK|TEST HEAVY|LECTURE HEAVY",
        "LOTS OF HOMEWORK"
    ],
    "rating": 1.38,
    "initial": "Guzman, R",
    "name": "Rosemary Guzman"
}