{
    "comments": [
        "Loved his class! I wish I had the chance to experience it in person!",
        "With the all online version (no zoom) if you do all the assignments such as connect and short quizzes on compass, you will get an A. No tests.",
        "We didn't have any zoom classes. The class was graded completely off assignments and participation from the weekly readings. His lectures were very helpful but honestly I only watched one or two and was still able to get an A. Great guy and would highly recommend.",
        "He's really enthusiastic and makes the lectures interesting. He really knows a lot about advertising and makes the content in his class interesting an engaging. The group project is also really fun. The only con is that he is a little lazy and takes a while to grade. I went a whole semester without having any grades in but ended up with 100%",
        "One of my favorite classes that I took freshman year. This class will convince you to become an advertising major!",
        "Lectures arent really required but half of the test questions are lecture material so go be sure to go.",
        "He has so much insight in the field of advertising. The class is super easy & you actually learn things that will help u in a career. He is really nice and caring & a great teacher all around. The only downside to this class is that you have to buy cengage for $119 in order to do the homework. The homework is easy & due at the end of the semester.",
        "Steve is awesome! He gives great lectures with a lot of examples and it really feels like he's just talking about things he's passionate about and incorporating them into lecture. He gives detailed study guides for exams so the class is fairly easy. If you're even somewhat interested in the major, take this class!",
        "For ADV 150, Professor Hall is a great professor and always has his own stories for everything. His lectures are not boring and the first day said all slides will have less than a sentence. He wants you to pass and will give TONS of extra credit. Attend class because half the test questions are from lecture and other half are textbook.",
        "tests are divided between lectures and textbook. They do not cross pollinate. You can do well enough without the book, but be prepared to buy something brand new for an A",
        "You do need to go to class to do well, listening and taking detailed notes on what he says and the examples he shows is needed to do well on the exams. But as long as you do that, the homework, and the 3 projects throughout, you're guaranteed an A. Steve is hilarious, though, class is always fun to attend.",
        "On the second day of class I fainted and he rode in the ambulance with me and waited in the hospital with me for hours until I was released. I was so impressed by how caring he was. I will never forget his kindness.",
        "Professor Hall opened my eyes to advertising and how cool some projects can be. There was never a boring class. He told us what would be on the tests and helped us excel for the writing assignment we had. If you have an extra elective to burn, this class is awesome for it.",
        "Professor Hall is a super cool guy and made me want to get into advertising. His lectures are almost all pictures and videos so make sure you take notes on what he shows (they're on the tests) The study guides are super accurate to whats on the test and towards the end of the semester he gives a ton of extra credit!",
        "His lectures are very engaging and interesting but make sure you take detailed notes because even small things will end up on tests.  Your grades are defined by how well you do on the 4 tests and the end group project.  Leave yourself a couple days to study.  USE THE STUDY GUIDE, HE MAKES HIS TESTS DIRECTLY FROM THEM.",
        "PAY ATTENTION TO THE LECTURES! Write down specific details about the examples he shows in class. They might seem random, but they appear on the exams. His tests are split pretty much 50/50 between the lectures and text."
    ],
    "tags": [
        "Respected|Accessible outside class|Hilarious",
        "Graded by few things|Clear grading criteria",
        "Graded by few things|Hilarious|EXTRA CREDIT",
        "Inspirational|Group projects|Amazing lectures",
        "Inspirational|Hilarious|EXTRA CREDIT",
        "Amazing lectures|Hilarious",
        "Respected|Inspirational|Amazing lectures",
        "Respected|Amazing lectures|EXTRA CREDIT",
        "Respected|Skip class? You won't pass.|EXTRA CREDIT",
        "Inspirational|GRADED BY FEW THINGS|EXTRA CREDIT",
        "Inspirational|Hilarious|Amazing lectures",
        "Caring",
        "Hilarious|Amazing lectures|EXTRA CREDIT",
        "Amazing lectures",
        "Get ready to read|Participation matters|TEST HEAVY",
        "Get ready to read|Skip class? You won't pass.|LECTURE HEAVY"
    ],
    "rating": 4.75,
    "initial": "Hall, S",
    "name": "Steven Hall"
}