{
    "comments": [
        "If you're not mathematically mature, DO NOT take his class. However, if you're up for a challenge then 100% take his class. He will push you to your absolute max and then some. This can be overwhelming for a lot, but stick through and you'll be surprised how much you improved in a semester. Also, deadly exams and HWs so don't overload.",
        "After answering every question with \"check the syllabus\" throughout the semester, a homework assignment was silently added to said syllabus with 4 weeks left of the semester. When I initially presented testing accommodations, I was told to take the exam with the rest of the class, or drop the course (way past the drop deadline, might I add).",
        "His true colors were revealed after I took his course online. Shows absolutely no care for teaching. Extremely unfair conditions especially given COVID times.",
        "Very worthwhile assignments. I think he tries to make things look easy but people just find it hard to get on his wavelength sometimes. When you go back and read what he says it makes a lot more sense, and his slides are great. Needs to work on communication, but written material is excellent.",
        "The first few lectures weren't great, but got better as the semester went on. Grading was fair; prof was helpful in office hours (if necessarily inaccessible outside office hours due to 500 person class size). Buy a textbook! (Recommended: Algorithm Design, Kleinberg-Tardos). Struggle through the assignments solo to learn the material better.",
        "Issues mentioned are generally overblown. Knows how to build grit.",
        "The course is difficult, that much is undeniable. Sariel has his weaknesses but at the end of the day he is incredibly intelligent and really provides students with the resources they need to succeed. I have much respect for him and am happy to have taken this course with his lead!",
        "He gave horrible and tedious lectures. He was so mean to students and did not care if we got it or not. He even refused to answer questions about 374 during his office hour. Don't take his courses.",
        "Avoid at all cost! 1)Literally the worst lecturer. Really thick accent and goes through concepts really fast without explaining in details. 2) Homework problems are really difficult to understand. Grammar errors and weird phrasings makes most students spend hours on piazza just asking for clarifications..",
        "He's definitely not a good lecturer. I don't know how the CS department allowed him to teach a heavy course like CS374. On the other hand, I believe he's a great guy and genius. But lecturing is definitely not a thing for him."
    ],
    "tags": [
        "Lots of homework|Skip class? You won't pass.|Test heavy",
        "Skip class? You won't pass.",
        "Lots of homework|Test heavy|Tough grader",
        "Tough Grader|Gives good feedback|ACCESSIBLE OUTSIDE CLASS",
        "Gives good feedback|Respected|Clear grading criteria",
        "Gives good feedback|Tests are tough|Would take again",
        "LOTS OF HOMEWORK|Hilarious|Tests are tough",
        "Tests are tough|LECTURE HEAVY",
        "Tough Grader|LOTS OF HOMEWORK|Tests are tough",
        "Tough Grader|TEST HEAVY|LECTURE HEAVY"
    ],
    "rating": 2.8,
    "initial": "Har-Peled, S",
    "name": "Sariel Har-Peled"
}