{
    "comments": [
        "DeVille is the best professor I've ever had and possibly will ever have. His grading criteria is very clear and there's no room for confusion in how anything's done. Study the homework solutions since the midterms and finals are based on them. Always available by office hours or email. I'll be blessed if I ever get to take another course with him.",
        "DeVille was my first math professor I had during my career at UIUC, and I couldn't be happier I had the privilege to be in his class. He demonstrated complete understanding of material covered in expansive detail, if you're confused about something, he'll find a way to explain it. He's also humorous, making his lectures a pleasure to attend",
        "This guy is the an amazing teacher. For me he was the best teacher first semester. His lectures are very organized and clear. He does an amazing job of teaching and lectures are very worthwhile to attend. You want Lee Deville for Calc 231.",
        "DeVille is a mathematical god. His explanations are very in-depth (can get a little confusing) but overall its incredibly clear and the webassigns that go along with it help you perfect your knowledge of Calc 2. Extremely caring of his students, always there to help. Midterms aren't super easy (average around a 75) but super easy final.",
        "He's an amazing professor, math 231 is hard but he makes it as easy as possible while still making sure that you learn.",
        "He is a great lecturer, makes you work for your grade- challenge problems frequently in homework",
        "Very very good teacher. Class is run extremely well, and DeVille is a very humorous and approachable guy. Definitely knows his stuff too. Homework is a nightmare though; this is an extremely difficult class, especially if youre in the engineering sections. WebAssign is relatively easy; weekly worksheets require a great deal of thought.",
        "Lee DeVille is a great math professor. He is very reasonable, funny, and extremely easy to understand. He gives great lectures. The engineering math is different and makes for lots of work, but he is great about answering all the questions he can. He is very easy to approach and tried to learn all the 300 kids' names in my class. I recommend him."
    ],
    "tags": [
        "Gives good feedback|Skip class? You won't pass.|GRADED BY FEW THINGS",
        "Respected|Inspirational|Amazing lectures",
        "Skip class? You won't pass.|LOTS OF HOMEWORK|Amazing lectures",
        "Gives good feedback|Hilarious|Caring",
        "Gives good feedback|Skip class? You won't pass.|Caring",
        "Skip class? You won't pass.|ACCESSIBLE OUTSIDE CLASS|Amazing lectures",
        "LOTS OF HOMEWORK|Hilarious|Amazing lectures",
        "Respected|LOTS OF HOMEWORK|Caring"
    ],
    "rating": 4.88,
    "initial": "Lee Deville, R",
    "name": "Robert Lee Deville"
}