{
    "comments": [
        "Dr. Downie is passionate about his work and this comes across clearly in his lectures. The content can be difficult for someone who has never been exposed to plants, but by the end of it you will learn so much.",
        "Best class!",
        "Prof. Downie is an amazing teacher! If you are truly interested in plant biology, I recommend him 100%. The only things I would warn are that 1, this class is not for the faint of heart. There are a lot of plant families to memorize, so if that sounds unbearable, I would steer clear. 2, labs depend greatly on how good the TA is. Otherwise, loved it",
        "Not sure why everyone loves this prof tbh, he is nice but extremely strict. The material is boring & repetitive if you're not genuinely into plant taxonomy. If you're pre med- stay away. The amount of rote memorization is comparable to an MCB class. I got an A but only bc of the extra credit. I know plenty of ppl that didn't- I wouldn't recommend.",
        "An excelllent clz. I learned a alot about plant taxonomy.",
        "Professor Downie was right when he warned us about his class. I enjoyed his class; he uses the class manual to look over the most important characteristic of the plants families. There are a lot of quizzes and extra credit and some of these question came in the final. Overall it was a good class and his goal is teach about botanic.",
        "I took this class two years ago and I thought I never would ever use the material I learned, well I jost got a job where I have to identify plants and I am so happy thank you dr Downie!"
    ],
    "tags": [
        "Clear grading criteria|Amazing lectures|Caring",
        "Respected|Clear grading criteria|Caring",
        "Hilarious|Amazing lectures|Lecture heavy",
        "Accessible outside class|Get ready to read|Tough grader",
        "Clear grading criteria|Caring|EXTRA CREDIT",
        "Participation matters|Caring|EXTRA CREDIT",
        "ACCESSIBLE OUTSIDE CLASS|Clear grading criteria|EXTRA CREDIT"
    ],
    "rating": 4.57,
    "initial": "R. Downie, S",
    "name": "Stephen R. Downie"
}